------------------------------------------------------------------------------------
-- game/resources/common_res.lua
--
--
--
-- @module      公共资源
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local common_res = import('game/resources/common_res')
------------------------------------------------------------------------------------

local common_res = {
   -- 是否有进度条0 技能  2 传送  4 挖矿 6 挖药 7 剥皮...
    PRO_INFO = {
        ['技能'] = 0,
        ['物品'] = 1,
        ['传送'] = 2,
        ['乐普'] = 3,
        ['挖矿'] = 4,
        ['挖药'] = 6,
        ['剥皮'] = 7,

    },
}

-- 自身模块
local this = common_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return common_res

-------------------------------------------------------------------------------------