------------------------------------------------------------------------------------
-- game/resources/dungeon_cir_res.lua
--
--
--
-- @module      dungeon_cir_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local dungeon_cir_res = import('game/resources/dungeon_cir_res')
------------------------------------------------------------------------------------
--
---@class dungeon_cir_res
local dungeon_cir_res = {
    MUST_DO_TASK = {
        ['阿吉罗斯之尾'] = {
            idx        = 1,
            task_name  = '蛇王宝玉',
            map_pos    = { map_name = '国境地带', map_id = 10222, area_name = '' },
            move_to    = { x = 24931.0, y = 17485.0, z = 511.99981689453, r = 100 }, -- 移动到指定点,r为 范围,当前为目标坐标点
            check_move = { x = 24582, y = 17523, z = 511, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['苏醒的魔兽'] = {
            idx        = 2,
            task_name  = '苏醒的魔兽',
            map_pos    = { map_name = '薄暮之雾', map_id = 10222, area_name = '' },
            move_to    = { x = 17076, y = 9116, z = 1308, r = 100 },--false
            check_move = { x = 16583, y = 9184, z = 1292, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['赤之结界'] = {
            idx        = 3,
            task_name  = '赤之结界',
            map_pos    = { map_name = '音之森', map_id = 10222, area_name = '' },
            move_to    = { x = -19356, y = 17657, z = 1597, r = 100 },--false
            check_move = { x = -19368, y = 17185, z = 1599, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['咒灵洞穴'] = {
            idx        = 4,
            task_name  = '守魂的怪物',
            map_pos    = { map_name = '薄暮之雾', map_id = 10222, area_name = '' },
            move_to    = { x = 20818, y = 24400, z = 767, r = 100 },--false
            check_move = { x = 20823, y = 24258, z = 767, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['燕之结界'] = {
            idx        = 5,
            task_name  = '燕之结界',
            map_pos    = { map_name = '紫藤之丘', map_id = 10222, area_name = '' },
            move_to    = { x = 7779, y = 18581, z = 1076, r = 100 },--false
            check_move = { x = 7927, y = 18383, z = 1076, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['海掠者巢穴'] = {
            idx        = 6,
            task_name  = '前往海掠者巢穴',
            map_pos    = { map_name = '丰饶森林', map_id = 11012, area_name = '' },
            move_to    = { x = 26903.0, y = 27445.0, z = 146.04295349121, r = 100 },
            check_move = { x = 26695, y = 27510, z = 214, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['萨维拉洞穴'] = {
            idx        = 7,
            task_name  = '灾祸之源',
            map_pos    = { map_name = '奥兹霍丘陵', map_id = 11012, area_name = '' },
            move_to    = { x = 11339, y = -13748, z = 510, r = 100 },
            check_move = { x = 11023, y = -13710, z = 510, r = 100 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['光辉山脊'] = {
            idx        = 8,
            task_name  = '灾祸之源',
            map_pos    = { map_name = '雷科巴', map_id = 11012, area_name = '' },
            move_to    = { x = 25322, y = -2526, z = 2047, r = 100 },
            check_move = { x = 25033, y = -2419, z = 2047 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
        ['灰锤矿山'] = {
            idx        = 9,
            task_name  = '灾祸之源',
            map_pos    = { map_name = '比尔布森林', map_id = 11012, area_name = '' },
            move_to    = { x = 22118, y = -2546, z = 2044, r = 100 },
            check_move = { x = 22203, y = -2209, z = 2044 },--false
            stop_skill = { '天谴雷罚','爆裂炽焰' },--'末日',燎原烈火，闪电漩涡，重力反转，霜冻，海啸席卷，旋风骤袭
            use_skill  = { '燎原烈火','闪电漩涡','重力反转','霜冻','海啸席卷','旋风骤袭'},
            use_idx    = {
                ['重力反转'] = 1,
                ['霜冻'] = 2,
                ['海啸席卷'] = 3,
                ['旋风骤袭'] = 4,
                ['燎原烈火'] = 5,
                ['闪电漩涡'] = 6,
            },
        },
    },
}

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return dungeon_cir_res

-------------------------------------------------------------------------------------