-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   item_res
-- @describe: 物品资源
-- @version:  v1.0
--
local pairs  = pairs
local string = string
-------------------------------------------------------------------------------------
-- 物品资源
---@class exchange_res
local exchange_res = {
    SELL_ITEM = {
        ['卢佩恩神像碎片'] = {num = 50},
        ['灾祸孢子'] = {num = 50},
        ['神官之书'] = {num = 20},
        ['格朗高勒之牙'] = {num = 20},
        ['次元之石'] = {num = 5},
        ['阿吉罗斯之皮'] = {num = 5},
        ['绯红法杖'] = {num = 2},

        ['鹰戒'] = {num = 50},
        ['罗纳恩的钥匙'] = {num = 50},
        ['亡者硬币'] = {num = 20},
        ['洛奥登河的传说'] = {num = 20},
        ['长老的短剑'] = {num = 5},
        ['卢特兰骑士列传'] = {num = 5},
        ['黑狼旗'] = {num = 2},

        ['蜂蜜'] = {num = 50},
        ['飘来的水瓶'] = {num = 50},
        ['托托克的起源'] = {num = 20},
        ['悬赏通缉'] = {num = 20},
        ['恶臭鳞片'] = {num = 5},
        ['刻着花纹的石头'] = {num = 5},
        ['腰果果实'] = {num = 2},

        ['骑士团的盔甲碎片'] = {num = 50},
        ['阿马隆的日志'] = {num = 50},
        ['星辰护卫的记录'] = {num = 20},
        ['厚实的羊皮纸'] = {num = 20},
        ['冒险家的日志'] = {num = 5},
        ['王室警告文'] = {num = 5},
        ['带有密码的纸张'] = {num = 2},-- 贝隆

        ['记着奇怪信号的铁板'] = {num = 50},
        ['玛丽的机器人偶'] = {num = 50},
        ['克拉提尔圣书'] = {num = 20},
        ['诺伊霍泰日报'] = {num = 20},
        ['重装行者报告书'] = {num = 5},
        ['艾尔盖茨宣传单'] = {num = 5},
        ['装在瓶子里的沙子'] = {num = 2},-- 阿尔泰因

        ['西恩英雄传说'] = {num = 50},
        ['装有雾气的葫芦瓶'] = {num = 50},
        ['安忆谷料理书'] = {num = 20},
        ['边界古书'] = {num = 20},
        ['香儿的封印符'] = {num = 5},
        ['妖怪面具'] = {num = 5},
        ['巨大花瓣'] = {num = 2},-- 安忆谷

        ['太阳盐'] = {num = 50},
        ['恶民的誓约'] = {num = 50},
        ['萨维拉研究日志'] = {num = 20},
        ['拉梅拉的镜子'] = {num = 20},
        ['利维坦诺斯之核'] = {num = 5},
        ['盐树果实'] = {num = 5},
        ['流民之梦'] = {num = 2},-- 尤狄亚

        ['希里安通缉传单'] = {num = 50},
        ['百夫长的手册'] = {num = 50},
        ['红手佣兵团手套'] = {num = 20},
        ['没落的贵族项链'] = {num = 20},
        ['卢特兰大王的传说'] ={num = 5},
        ['女骑士的木刻娃娃'] = {num = 5},
        ['林赛的戒指'] = {num = 2},-- 卢特兰西部
    },
    TIP = {
      [0] = {1,1},
      [1] = {2,19},
      [2] = {20,39},
      [3] = {40,59},
      [4] = {60,79},
      [5] = {80,99},
      [8] = {100,199},
      [13] = {200,299},
      [18] = {300,399},
      [23] = {400,499},
      [28] = {500,599},
      [33] = {600,699},
      [38] = {700,799},
      [43] = {800,899},
      [48] = {900,999},
      [75] = {1000,1999},
      [125] = {2000,2999},
      [175] = {3000,3999},
      [225] = {4000,4999},
      [275] = {5000,5999},
      [325] = {6000,6999},
      [375] = {7000,7999},
      [425] = {8000,8999},
      [475] = {9000,9999},

    },



}

local this = exchange_res

-------------------------------------------------------------------------------------
-- 返回对象
return exchange_res

-------------------------------------------------------------------------------------