-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   item_res
-- @describe: 物品资源
-- @version:  v1.0
--
local pairs  = pairs
local string = string
-------------------------------------------------------------------------------------
-- 物品资源
---@class item_res
local item_res = {
    -- 需要分解的物品
    NEED_DECO_ITEM = {
        '英雄朴素护身符','英雄隐约护身符','英雄优雅护身符',
    },
    -- 需要删除的物品
    NEED_DEL_ITEM  = {
        '飞翔之石','糠','米','孤独未知','孤独昆虫的魔窟','充满着植物的广场','香蕉叶','被某人藏起来的果汁杯','丘丘丘果冻','形状不明的内脏','厚实的精肉','稀有职业专用刻印书自选箱子',
        '稀有战斗刻印书选择袋子','可尼的果园仓库钥匙','引导者首饰箱子',
        '弱肉强食刻印书','禁忌秘术刻印书','雷电之怒刻印书','举步生风刻印书','先发制人刻印书','紧急救援刻印书','乘胜追击刻印书','巅峰刻印书','觉醒刻印书','节制刻印书','咒术人偶刻印书'
    },
    -- 选择箱子对应物品资源
    SEL_BOX_ITEM   = {
        ['[跳级]坐骑：马匹自选箱子'] = {
            ['坐骑：罗格希尔黑马'] = 0x0001F472,
        },
        ['[跳级]坐骑：瓢虫自选箱子'] = {
            ['坐骑：红色瓢虫'] = 0x1F407,
        },
        ['碎片自选箱子'] = {
            ['和谐碎片袋子（中）'] = 0x03F1105C,
            ['荣誉碎片袋子（中）'] = 0x03F11070,
        },
        ['方舟通行证碎片自选箱子'] = {
            ['和谐碎片袋子（大）'] = 0x03F1105D,
            ['荣誉碎片袋子（大）'] = 0x03F11071,
        },
        ['方舟通行证特殊碎片自选箱子'] = {
            ['和谐碎片袋子（大）'] = 0x03F1105D,
            ['荣誉碎片袋子（大）'] = 0x03F11071,
        },
        ['方舟通行证突破石自选箱子'] = {
            ['和谐突破石(绑定)']    = 0x03F0C234,
            ['伟大荣誉突破石(绑定)'] = 0x03F0C246,
        },
        ['守护石结晶袋子'] = {
            ['守护石碎片(绑定)'] = 0x03F0A35F,
            ['守护石结晶(绑定)'] = 0x03F0A361,
        },
        ['守护石自选箱子'] = {
            ['守护石碎片(绑定)'] = 0x03F0A35F,
            ['守护石结晶(绑定)'] = 0x03F0A361,
        },
        ['破坏石自选箱子'] = {
            ['破坏石碎片(绑定)'] = 0x03F0A2FB,
            ['破坏石结晶(绑定)'] = 0x03F0A2FD,
        },
        ['突破石自选箱子'] = {
            ['和谐突破石(绑定)']    = 0x03F0C234,
            ['伟大荣誉突破石(绑定)'] = 0x03F0C246,
        },
    },
    -- 使用物品时触发的选择箱子选择对象
    SEL_ITEM       = {
        ['[跳级]坐骑：瓢虫自选箱子'] = { sel_name = '坐骑：红色瓢虫',prop_level = 0,level = 1 },

    },
    -- 需要使用的物品
    NEED_USE_ITEM  = {
        '开业礼品','微光的守护石碎片袋子','绚光的守护石碎片袋子','微光的破坏石碎片袋子','绚光的破坏石碎片袋子','和谐碎片箱子','通关奖励','领地支援物品箱子','星辰之息箱子','眼镜箱子',
        '微光的碎片箱子（大）','微光的碎片箱子（中）','微光的碎片箱子（小）','微光的和谐突破石箱子','绚光的和谐突破石箱子','共鸣气息恢复秘药','超大型战斗经验药水','和谐突破石箱子','卢佩恩之力的货币箱子',
        '坐骑：','宠物：','拉梅拉的镜子','之歌','情感表现','王室奖励','复活羽毛','伯雷亚领地补给','太初碎片','亡者的遗物盒','撕裂','疾行','专注','断罪','交易牌','烁亮硬币','梅内里克之书',
        '压制','狂奔','疾风','海掠者的柜子','艾伦的旧包','巴鲁图','加比休','奥胡','船员申请书：摩卡摩卡','埃施','哈伯克','达旦','巨型蠕虫','卡多甘','之光的货币','船舶材料箱', --
        '丰饶','永劫精华','讨伐：','讨伐:','贝隆北部直升券','贝隆北部通行证装备箱子','蓝钻','古代铂金币',--,'弱肉强食刻印书','举步生风刻印书','禁忌秘术刻印书','先发制人刻印书','雷电之怒刻印书','乘胜追击刻印书','紧急救援刻印书'
        '方舟通行证融合材料箱子','方舟通行证特殊融合材料箱子','和谐碎片袋子（大）','和谐碎片袋子（中）','和谐碎片袋子（小）','荣誉碎片袋子（大）','荣誉碎片袋子（中）','荣誉碎片袋子（小）','寂静挽歌','爱情小夜曲','共鸣之歌',
        '卡的权能','0金块','预备精炼材料箱子','：末日','阴影精炼材料箱子','守护石碎片袋子','破坏石碎片袋子','贝拉的祝福','荣誉碎片箱子','破坏石结晶袋子','知识传授装备箱子'
        --'宝石','全体卡牌包','稀有卡牌包','灾祸孢子',
    },
    -- 打开物品所需道具等级
    OPEN_NEED_POWER = {
        ['荣誉碎片箱子'] = 1250,
        ['伟大荣誉突破石箱子'] = 1250,
        ['破坏石结晶袋子'] = 1250,
        ['守护石结晶袋子'] = 1250,
        ['3阶宝石箱子（3级）'] = 1370,
    },
    -- 血量恢复药水
    HP_ITEM = {
        [1] = { level = 50, prop_level = 1400, money = 2250, add_hp = 41216, name = '神秘治疗药水' },
        [2] = { level = 50, prop_level = 1200, money = 1500, add_hp = 23344, name = '星光治疗药水' },
        [3] = { level = 50, prop_level = 1000, money = 620, add_hp = 15264, name = '祝福治愈药水' },
        [4] = { level = 50, prop_level = 900, money = 460, add_hp = 13960, name = '净化治愈药水' },
        [5] = { level = 50, prop_level = 700, money = 260, add_hp = 10584, name = '守护治愈药水' },
        [6] = { level = 50, prop_level = 500, money = 220, add_hp = 8832, name = '神圣治愈药水' },
        [7] = { level = 48, money = 100, add_hp = 4312, name = '强化治疗药水' },
        [8] = { level = 37, money = 60, add_hp = 2608, name = '达人治疗药水' },
        [9] = { level = 26, money = 35, add_hp = 1592, name = '名人治疗药水' },
        [10] = { level = 18, money = 20, add_hp = 968, name = '高级治疗药水' },
        [11] = { level = 11, money = 10, add_hp = 768, name = '普通治疗药水' },
        [12] = { level = 1, money = 6, add_hp = 600, name = '初级治疗药水' },
    },
    -- 立刻恢复药
    HP_REGAIN = {
        '恢复药(绑定)'
    },
    POTION_MONEY = {
        ['初级治疗药水'] = {  money = 6 },
        ['普通治疗药水'] = {  money = 10 },
        ['高级治疗药水'] = {  money = 20 },
        ['名人治疗药水'] = {  money = 35 },
        ['达人治疗药水'] = {  money = 60 },
        ['强化治疗药水'] = {  money = 100 },
        ['神圣治愈药水'] = {  money = 220 },
        ['守护治愈药水'] = {  money = 260 },
        ['净化治愈药水'] = {  money = 460 },
        ['祝福治愈药水'] = {  money = 620 },
        ['星光治疗药水'] = {  money = 1500 },
        ['神秘治疗药水'] = {  money = 2250 },
    },
}

local this = item_res

-- 是否需要保留的物品
local need_reserve = {}
-------------------------------------------------------------------------------------
-- 设置指定物品是否需要保留[true 需要保留  false 不保留]
item_res.set_need_reserve = function(name,value)
    need_reserve[name] = value
end

-------------------------------------------------------------------------------------
-- [读取] 获取指定物品开使用的选择箱子信息
item_res.get_box_info_by_sel_name = function(sel_name)
    local info_list = this.SEL_BOX_ITEM
    local list      = {}
    for box_name,v in pairs(info_list) do
        if v[sel_name] then
            table.insert(list,box_name)
        end
    end
    return list
end

-------------------------------------------------------------------------------------
-- [读取] 获取指定箱子,所需物品 对应的ID
item_res.get_res_id_by_box_name_and_sel_name = function(box_name,sel_name)
    local info   = this.SEL_BOX_ITEM[box_name]
    local res_id = 0
    if info then
        res_id = info[sel_name]
    end
    return res_id
end

-------------------------------------------------------------------------------------
-- 指定物品是否需要保留[true 需要保留  false 不保留]
item_res.is_need_reserve = function(name)
    return need_reserve[name]
end

-------------------------------------------------------------------------------------
-- 判断物品是否绑定
item_res.is_bind_by_name = function(name)
    for _, v in pairs(this.BIND_STAMP) do
        if string.find(name, v) then
            return true
        end
    end
    return false
end

-------------------------------------------------------------------------------------
-- 物品是否可分解
item_res.is_can_deco_by_name = function(name)
    for _, v in pairs(this.NEED_DECO_ITEM) do
        if name == v and not need_reserve[name] then
            return true
        end
    end
    return false
end

-------------------------------------------------------------------------------------
-- 物品是否可删除
item_res.is_can_del_by_name = function(name)
    for _, v in pairs(this.NEED_DEL_ITEM) do
        if name == v and not need_reserve[name] then
            return true
        end
    end
    return false
end

-------------------------------------------------------------------------------------
-- 返回对象
return item_res

-------------------------------------------------------------------------------------