------------------------------------------------------------------------------------
-- game/resources/map_area_res.lua
--
--
--
-- @module      地图区域资源
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local map_area_res = import('game/resources/map_area_res')
------------------------------------------------------------------------------------
-- 坐标说明
-- 正上边扩展【x + 扩展值,y + 扩展值】
-- 左上边扩展【x + 扩展值,y】
-- 正左边扩展【x + 扩展值,y - 扩展值】
-- 左下边扩展【x ,y - 扩展值】
-- 正右边扩展【x - 扩展值,y + 扩展值】
-- 右上边扩展【x,y + 扩展值】
-- 正下边扩展【x - 扩展值,y - 扩展值】
-- 右下边扩展【x - 扩展值,y】
------------------------------------------------------------------------------------
local import       = import
local actor_unit   = actor_unit
local local_player = local_player
local utils        = import('base/utils')
local pairs        = pairs
local math         = math
local table        = table

---@class map_area_res
local map_area_res = {
    -- 每个区域对应的切换信息
    map_area_move = {
        -- 帕普尼卡
        ['星沙海滩'] = {
            ['星沙海滩-钓鱼点'] = {
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-负一楼'] = { x = 13017.0, y = 4478.0, z = 512.80969238281, key_call = 'KEY_G', wait_time = 1 },
                },
            },
            ['星沙海滩-负一楼'] = {
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-钓鱼点'] = { x = 12707.0, y = 4421.0, z = 255.99996948242, key_call = 'KEY_G', wait_time = 3 },
                    ['星沙海滩-电梯'] = { x = 5963.0, y = 7243.0, z = 278.26974487305, wait_time = 1, ['操作'] = { res_id = 0x1169D1, type = 15, action = 4 }, },
                },
            },

            ['星沙海滩-电梯'] = {
                ['移动类型'] = '升降', -- 升降/移动
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-负一楼'] = { x = 5963.0, y = 7243.0, z = 278.26974487305,key_call = 'KEY_G',wait_time = 1 },
                    ['星沙海滩-大板块'] = { x = 5880.0, y = 8364.0, z = 1308.7410888672,key_call = 'KEY_G',wait_time = 1 },
                },
            },

            ['星沙海滩-大板块'] = {
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-电梯'] = { x = 5880.0, y = 8364.0, z = 1308.7410888672, wait_time = 1, ['操作'] = { res_id = 0x1169D1, type = 15, action = 4 }, },
                    ['星沙海滩-一楼'] = { x = 3693.0, y = 14586.0, z = 1535.9996337891,key_call = 'KEY_G',wait_time = 3 },
                },
            },

            ['星沙海滩-一楼'] = {
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-大板块'] = { x = 3642.0, y = 14842.0, z = 1794.1995849609,key_call = 'KEY_G',wait_time = 1 },
                    ['星沙海滩-二楼'] = { x = 5147.0, y = 15682.0, z = 1791.9996337891,key_call = 'KEY_G',wait_time = 3 },
                },
            },
            ['星沙海滩-二楼'] = {
                ['所属大陆'] = '星沙海滩',
                ['可换地图'] = {
                    ['星沙海滩-一楼'] = { x = 5480.0, y = 15704.0, z = 2050.0,key_call = 'KEY_G',wait_time = 1 },
                },
            },

        },

        ['悠浅海路'] = {
            ['悠浅海路-中央广场'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-生命之林连接处'] = { x = 19706.060546875, y = 8562.302734375, z = 641.00042724609,key_call = 'KEY_G',wait_time = 13 },
                    ['悠浅海路-灰色火山'] = { x = 16457.0, y = 4985.0, z = 902.75720214844,key_call = 'KEY_G',wait_time = 2 },
                    ['悠浅海路-居民二楼'] ={ x = 3713.0, y = 13563.0, z = 720.96130371094,key_call = 'KEY_G',wait_time = 3 },
                    ['悠浅海路-破船'] ={ x = 18296.0, y = 18525.0, z = 237.41427612305,key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['悠浅海路-居民二楼'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-中央广场'] ={ x = 4028.0, y = 13549.0, z = 977.72839355469,key_call = 'KEY_G',wait_time = 1 },
                },
            },
            ['悠浅海路-破船'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-中央广场'] ={ x = 18535.0, y = 18448.0, z = 744.3359375,key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['悠浅海路-灰色火山'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-中央广场'] ={ x = 16486.0, y = 4619.0, z = 1151.6564941406,key_call = 'KEY_G',wait_time = 1 },
                },
            },
            ['悠浅海路-生命之林连接处'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-生命之林左下'] = { x = 22754.0, y = 9027.0, z = 637.60699462891,key_call = 'KEY_G',wait_time = 3 },
                    ['悠浅海路-生命之林'] = { x = 22947.0, y = 11131.0, z = 654.81103515625,key_call = 'KEY_G',wait_time = 2 },
                    ['悠浅海路-中央广场'] = { x = 20824.0, y = 8553.0, z = 641.00042724609,key_call = 'KEY_G',wait_time = 13 },
                },
            },
            ['悠浅海路-生命之林'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-生命之林连接处'] = { x = 23303.0, y = 11008.0, z = 382.21276855469,key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['悠浅海路-生命之林左下'] = {
                ['所属大陆'] = '悠浅海路',
                ['可换地图'] = {
                    ['悠浅海路-生命之林连接处'] = { x = 22786.0, y = 8285.0, z = 642.27954101562,key_call = 'KEY_G',wait_time = 3 },
                },
            },
        },

        ['妮亚村'] = {
            ['妮亚村-监狱'] = {
                ['所属大陆'] = '妮亚村',
                ['可换地图'] = {
                    ['妮亚村-船'] = { x = 5761.0, y = 4404.0, z = 521.16381835938, wait_time = 1, ['操作'] = { res_id = 0x116585, type = 15, action = 4 }, },
                },
            },
            ['妮亚村-船'] = {
                ['所属大陆'] = '妮亚村',
                ['移动类型'] = '移动', -- 升降/移动
                ['可换地图'] = {
                    ['妮亚村-监狱'] = { x = 5761.0, y = 4404.0, z = 521.16381835938, wait_time = 1,break_m = 220 },
                    ['妮亚村-海滩'] = { x = 2888.0, y = 3094.0, z = 488.89495849609, wait_time = 2,break_m = 240 },
                },
            },
            ['妮亚村-海滩'] = {
                ['所属大陆'] = '妮亚村',
                ['可换地图'] = {
                    ['妮亚村-船'] = { x = 2888.0, y = 3094.0, z = 488.89495849609, wait_time = 1, ['操作'] = { res_id = 0x116585, type = 15, action = 4 }, },
                    ['妮亚村-海滩楼梯'] = { x = 1598.0, y = 1296.0, z = 620.19519042969, wait_time = 1, ['操作'] = { res_id = 0x116586, type = 15, action = 4 }, },
                },
            },
            ['妮亚村-海滩楼梯'] = {
                ['所属大陆'] = '妮亚村',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['妮亚村-海滩'] = { x = 1598.0, y = 1296.0, z = 620.19519042969, wait_time = 1 },
                    ['妮亚村-村子'] = { x = 530.0, y = 1271.0, z = 1659.759765625, wait_time = 1 },
                },
            },
            ['妮亚村-村子'] = {
                ['所属大陆'] = '妮亚村',
                ['可换地图'] = {
                    ['妮亚村-海滩楼梯'] = { x = 530.0, y = 1271.0, z = 1659.759765625, wait_time = 1, ['操作'] = { res_id = 0x116586, type = 15, action = 4 }, },
                },
            },
        },

        ['蒂卡蒂卡聚落'] = {
            ['蒂卡蒂卡聚落-月广场'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-月广场一'] = { x = -224.0, y = -30570.0, z = -2626.458984375,key_call = 'KEY_G',wait_time = 1 },
                },
            },
            ['蒂卡蒂卡聚落-月广场一'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-月广场'] = { x = -556.0, y = -30569.0, z = -2626.3579101562,key_call = 'KEY_G',wait_time = 1 },
                    ['蒂卡蒂卡聚落-月岛'] = { x = -2361.068359375, y = -30150.888671875, z = -2626.3579101562 }
                },
            },
            ['蒂卡蒂卡聚落-月岛'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-船'] = { x = 15999.0, y = 13052.0, z = -1096.0, wait_time = 1, ['操作'] = { res_id = 0x116A35, type = 15, action = 4 }, },
                    ['蒂卡蒂卡聚落-月广场一'] = { x = 16350.881835938, y = 12437.573242188,z = -1092 }
                },
            },
            ['蒂卡蒂卡聚落-船'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['移动类型'] = '移动', -- 升降/移动
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-月岛'] = { x = 15999.0, y = 13052.0, z = -1096.0, wait_time = 1 },
                    ['蒂卡蒂卡聚落-部落'] = { x = 17058.0, y = 14529.0, z = -1092,wait_time = 1 },
                },
            },

            ['蒂卡蒂卡聚落-岛F'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-部落'] = { x = 10837.0, y = 12817.0, z = -787.357421875,key_call = 'KEY_G',wait_time = 1 },

                },
            },
            ['蒂卡蒂卡聚落-门口'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-部落'] = { x = 1860.0, y = 7207.0, z = 6.5618438720703,key_call = 'KEY_G',wait_time = 13 },
                },
            },

            ['蒂卡蒂卡聚落-台子一'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-部落'] = { x = 11934.0, y = 2073.0, z = 6.4254302978516,key_call = 'KEY_G',wait_time = 3 },
                    ['蒂卡蒂卡聚落-台子二'] = { x = 13035.0, y = 510.0, z = 1.8615570068359,key_call = 'KEY_G',wait_time = 3 },
                },
            },
            ['蒂卡蒂卡聚落-台子二'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-台子一'] = { x = 13369.0, y = -29.0, z = -1.5548400878906,key_call = 'KEY_G',wait_time = 3 },
                    ['蒂卡蒂卡聚落-台子三'] = { x = 14100.0, y = -525.0, z = -52.39631652832,key_call = 'KEY_G',wait_time = 6 },
                },
            },
            ['蒂卡蒂卡聚落-台子三'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-台子二'] = { x = 14220.0, y = -443.0, z = 424.26788330078,key_call = 'KEY_G',wait_time = 2 },
                    ['蒂卡蒂卡聚落-台子四'] = { x = 14633.0, y = 1201.0, z = 475.11157226562,key_call = 'KEY_G',wait_time = 3 },
                },
            },
            ['蒂卡蒂卡聚落-台子四'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-台子三'] = { x = 14696.0, y = 1847.0, z = 495.15856933594,key_call = 'KEY_G',wait_time = 3 },
                    ['蒂卡蒂卡聚落-台子五'] = { x = 13278.0, y = 4361.0, z = 798.3310546875,key_call = 'KEY_G',wait_time = 3 },
                },
            },
            ['蒂卡蒂卡聚落-台子五'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-台子四'] = { x = 12638.0, y = 4664.0, z = 780.33959960938,key_call = 'KEY_G',wait_time = 3 },
                },
            },

            ['蒂卡蒂卡聚落-部落'] = {
                ['所属大陆'] = '蒂卡蒂卡聚落',
                ['可换地图'] = {
                    ['蒂卡蒂卡聚落-船'] = { x = 17058.0, y = 14529.0, z = -1092, wait_time = 1, ['操作'] = { res_id = 0x116A35, type = 15, action = 4 }, },
                    ['蒂卡蒂卡聚落-岛F'] = { x = 10486.0, y = 12901.0, z = -523.50799560547,key_call = 'KEY_G',wait_time = 1 },
                    ['蒂卡蒂卡聚落-台子一'] = { x = 11866.0, y = 1696.0, z = 250.09713745117,key_call = 'KEY_G',wait_time = 1 },
                    ['蒂卡蒂卡聚落-门口'] = { x = 1846.0, y = 6087.0, z = 0.587646484375,key_call = 'KEY_G',wait_time = 13 },
                },
            },

        },

        ['秘密森林'] = {
            ['秘密森林-门口'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口一'] = { x = 4900.0, y = 12717.0, z = 535.76550292969, key_call = 'KEY_G', wait_time = 13 },
                },
            },
            ['秘密森林-门口一'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口'] = { x = 5378.0, y = 12245.0, z = 513.208984375, key_call = 'KEY_G', wait_time = 13 },
                    ['秘密森林-门口二'] = { x = 4972.0, y = 11278.0, z = 521.59777832031, key_call = 'KEY_G', wait_time = 1 },
                },
            },
            ['秘密森林-门口二'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口一'] = { x = 4702.0, y = 11020.0, z = 520.12634277344, key_call = 'KEY_G', wait_time = 1 },
                    ['秘密森林-门口三'] = { x = 4624.0, y = 9784.0, z = 523.75390625, key_call = 'KEY_G', wait_time = 3 },
                },
            },
            ['秘密森林-门口三'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口二'] = { x = 5227.0, y = 9532.0, z = 510.98950195312, key_call = 'KEY_G', wait_time = 1 },
                    ['秘密森林-门口四'] = { x = 8385.0, y = 5409.0, z = 515.24353027344, key_call = 'KEY_G', wait_time = 1 },
                },
            },
            ['秘密森林-门口四'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口三'] = { x = 8773.0, y = 5425.0, z = 255.99987792969, key_call = 'KEY_G', wait_time = 4 },
                    ['秘密森林-门口五'] = { x = 15516.0, y = 6056.0, z = 261.67608642578, key_call = 'KEY_G', wait_time = 13 },
                },
            },
            ['秘密森林-门口五'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口四'] = { x = 15656.0, y = 6066.0, z = 1298.7592773438,key_call = 'KEY_G',wait_time = 2 },
                    ['秘密森林-连接处'] = { x = 15862.0, y = 5658.0, z = 1298.5988769531,key_call = 'KEY_G',wait_time = 7 },
                },
            },
            ['秘密森林-左边小圆盘'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-连接处'] = { x = 16893.0, y = 4682.0, z = 1795.3990478516,key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['秘密森林-副本门口'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-连接处'] = { x = 18934.0, y = 10900.0, z = 1678.3149414062,key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['秘密森林-连接处'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-门口五'] = { x = 16007.0, y = 5546.0, z = 1792.3360595703,key_call = 'KEY_G',wait_time = 2 },
                    ['秘密森林-左边小圆盘'] = { x = 16567.0, y = 5224.0, z = 1792.3360595703,key_call = 'KEY_G',wait_time = 4 },
                    ['秘密森林-副本门口'] = { x = 18420.0, y = 10614.0, z = 1682.6506347656,key_call = 'KEY_G',wait_time = 4 },
                    ['秘密森林-C形连接'] = { x = 16411.0, y = 9568.0, z = 1929.0814208984,key_call = 'KEY_G',wait_time = 3 },


                },
            },
            ['秘密森林-右边小圆盘'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-C形连接'] = { x = 15444.0, y = 10106.0, z = 1673.0168457031,key_call = 'KEY_G',wait_time = 4 },
                },
            },


            ['秘密森林-C形连接'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-连接处'] = { x = 15787.0, y = 9411.0, z = 1929.0814208984,key_call = 'KEY_G',wait_time = 3 },
                    ['秘密森林-右边小圆盘'] = { x = 15311.0, y = 9805.0, z = 1953.1477050781,key_call = 'KEY_G',wait_time = 1 },
                    ['秘密森林-远端一'] = { x = 12876.0, y = 8986.0, z = 1918.0574951172,key_call = 'KEY_G',wait_time = 2},
                },
            },

            ['秘密森林-远端一'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-C形连接'] = { x = 12690.0, y = 9092.0, z = 1419.6282958984,key_call = 'KEY_G',wait_time = 7 },
                    ['秘密森林-远端二'] = { x = 12354.0, y = 9389.0, z = 1406.2476806641,key_call = 'KEY_G',wait_time = 2 },
                },
            },

            ['秘密森林-远端二'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-远端一'] = { x = 12195.0, y = 9394.0, z = 903.06311035156,key_call = 'KEY_G',wait_time = 7 },
                    ['秘密森林-远端'] = { x = 12975.75390625, y = 11905.455078125, z = 380.47155761719,key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['秘密森林-远端'] = {
                ['所属大陆'] = '秘密森林',
                ['可换地图'] = {
                    ['秘密森林-远端二'] = { x = 12820.0, y = 12231.0, z = 641.99200439453,key_call = 'KEY_G',wait_time = 1 },
                },
            },

        },

        ['银波湖'] = {
            ['银波湖-中间'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-右下'] = { x = 21536.0, y = 25478.0, z = 2880.0, key_call = 'KEY_G' },
                    ['银波湖-右上'] = { x = 29985.0, y = 21381.0, z = 4095.0, key_call = 'KEY_G' },
                    ['银波湖-中间小'] = { x = 21659.0, y = 17661.0, z = 2945.1259765625, key_call = 'KEY_G' },
                    ['银波湖-左下'] = { x = 21374.0, y = 11300.0, z = 3016.6276855469, key_call = 'KEY_G' },
                },
            },
            ['银波湖-左下'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-中间'] = { x = 21390.0, y = 10972.0, z = 3016.6293945312, key_call = 'KEY_G' },
                    ['银波湖-左下一'] = { x = 21090.0, y = 1932.0, z = 2468.6264648438, key_call = 'KEY_G' },
                },
            },
            ['银波湖-左下一'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-左下二'] = { x = 22269.0, y = 1525.0, z = 2197.9008789062, key_call = 'KEY_G' },
                    ['银波湖-左下'] = { x = 21429.0, y = 1940.0, z = 2198.9995117188, key_call = 'KEY_G' },
                },
            },
            ['银波湖-左下二'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-左下三'] = { x = 22415.0, y = 678.0, z = 1949.8271484375, key_call = 'KEY_G' },
                    ['银波湖-左下一'] = { x = 22329.0, y = 1186.0, z = 1948.3231201172, key_call = 'KEY_G' },
                },
            },
            ['银波湖-左下三'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-左下二'] = { x = 22634.0, y = -335.0, z = 1948.5355224609, key_call = 'KEY_G' },
                    ['银波湖-左下四'] = { x = 22670.0, y = -655.0, z = 1947.1052246094, key_call = 'KEY_G' },
                },
            },
            ['银波湖-左下四'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-左下三'] = { x = 22738.845703125, y = -926.75872802734, z = 1690.9916992188, key_call = 'KEY_G' },
                },
            },
            ['银波湖-右下'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-中间'] = { x = 21587.0, y = 25833.0, z = 3137.7724609375, key_call = 'KEY_G' },
                },
            },
            ['银波湖-右上'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-中间'] = { x = 29992.0, y = 21492.0, z = 5126.8032226562, key_call = 'KEY_G' },
                },
            },
            ['银波湖-中间小'] = {
                ['所属大陆'] = '银波湖',
                ['可换地图'] = {
                    ['银波湖-中间'] = { x = 21202.0, y = 16529.0, z = 2690.9243164062, key_call = 'KEY_G' },
                },
            },
        },

        ['琉璃莲花池'] = {
            ['琉璃莲花池-大板块'] = {
                ['所属大陆'] = '琉璃莲花池',
                ['可换地图'] = {
                    ['琉璃莲花池-左一'] = { x = 25875.0, y = 22559.0, z = 771.07788085938, key_call = 'KEY_G' },
                },
            },
            ['琉璃莲花池-左一'] = {
                ['所属大陆'] = '琉璃莲花池',
                ['可换地图'] = {
                    ['琉璃莲花池-大板块'] = { x = 25875.0, y = 22390.0, z = 255.99984741211, key_call = 'KEY_G' },
                    ['琉璃莲花池-左二'] = { x = 25226.0, y = 19065.0, z = 255.42477416992, key_call = 'KEY_G' },
                },
            },
            ['琉璃莲花池-左二'] = {
                ['所属大陆'] = '琉璃莲花池',
                ['可换地图'] = {
                    ['琉璃莲花池-左一'] = { x = 25061.0, y = 19095.0, z = -768.00018310547, key_call = 'KEY_G' },
                },
            },
        },

        ['风弥之丘'] = {
            ['风弥之丘-大板块'] = {
                ['所属大陆'] = '风弥之丘',
                ['可换地图'] = {
                    ['风弥之丘-左一'] = { x = 12035.0, y = 16130.0, z = 2075.8088378906, key_call = 'KEY_G' },
                },
            },
            ['风弥之丘-左一'] = {
                ['所属大陆'] = '风弥之丘',
                ['可换地图'] = {
                    ['风弥之丘-大板块'] = { x = 11881.0, y = 14950.0, z = 2864.7390136719, key_call = 'KEY_G' },
                    ['风弥之丘-左二'] = { x = 11588.0, y = 12474.0, z = 2881.5029296875, key_call = 'KEY_G' },


                },
            },
            ['风弥之丘-左二'] = {
                ['所属大陆'] = '风弥之丘',
                ['可换地图'] = {
                    ['风弥之丘-左三'] = { x = 13292.0, y = 12540.0, z = 3921.3383789062, key_call = 'KEY_G' },
                    ['风弥之丘-左一'] = { x = 11722.0, y = 12451.0, z = 3916.201171875, key_call = 'KEY_G' },
                },
            },
            ['风弥之丘-左三'] = {
                ['所属大陆'] = '风弥之丘',
                ['可换地图'] = {
                    ['风弥之丘-左二'] = { x = 13954.0, y = 12573.0, z = 3917.958984375, key_call = 'KEY_G' },
                },
            },
        },

        ['埃尔乔文之荫'] = {
            ['埃尔乔文之荫-阴影大地'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-连接一'] = { x = 1283.0, y = 17799.0, z = 2049.5402832031, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-连接一'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-阴影大地'] = { x = 1071.0, y = 17804.0, z = 1535.9997558594, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-连接二'] = { x = 5337.6362304688, y = 20131.025390625, z = 1540.2091064453, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-连接二'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-连接一'] = { x = 5171.0, y = 20233.0, z = 1023.9998779297, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-森林东'] = { x = 4324.2778320312, y = 21698.482421875, z = 1128.6997070312, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-森林东'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-连接二'] = { x = 1360.0, y = 22552.0, z = 511.99981689453, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-遗忘海'] = { x = 18548.0, y = 13254.0, z = 957.84436035156, wait_time = 1, ['操作'] = { res_id = 0xF6E33, type = 15, action = 4 }, },
                    ['埃尔乔文之荫-中间连接点'] = { x = 9770.0, y = 15148.0, z = 1023.9997558594, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-中间连接点'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-森林东'] = { x = 9819.0, y = 15356.0, z = 1539.9415283203, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-左边'] = { x = 9787.0, y = 11429.0, z = 1535.9996337891, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-左边'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-中间连接点'] = { x = 9756.66796875, y = 11324.002929688, z = 1041.0, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-遗忘海'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['移动类型'] = '移动', -- 升降/移动
                ['可换地图'] = {
                    ['埃尔乔文之荫-森林东'] = { x = 18543.0, y = 13262.0, z = 957.84436035156 },
                    ['埃尔乔文之荫-副本连接一'] = { x = 21288.0, y = 12112.0, z = 957.84436035156 },
                },
            },
            ['埃尔乔文之荫-副本连接一'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-遗忘海'] = { x = 21288.0, y = 12112.0, z = 957.84436035156, wait_time = 1, ['操作'] = { res_id = 0xF6E33, type = 15, action = 4 }, },
                    ['埃尔乔文之荫-副本连接二'] = { x = 23668.0, y = 10965.0, z = 1025.2677001953, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-副本连接二'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-副本连接一'] = { x = 24088.0, y = 10509.0, z = 1028.8565673828, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-副本连接三'] = { x = 24296.0, y = 10538.0, z = 1028.8563232422, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-副本连接三'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-副本连接二'] = { x = 24506.0, y = 10774.0, z = 1280.0678710938, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-副本连接四'] = { x = 24749.0, y = 10743.0, z = 1280.0676269531, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-副本连接四'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-副本连接三'] = { x = 24960.0, y = 10489.0, z = 1031.7232666016, key_call = 'KEY_G' },
                    ['埃尔乔文之荫-副本门口'] = { x = 25248.0, y = 10411.0, z = 1028.0753173828, key_call = 'KEY_G' },
                },
            },
            ['埃尔乔文之荫-副本门口'] = {
                ['所属大陆'] = '埃尔乔文之荫',
                ['可换地图'] = {
                    ['埃尔乔文之荫-副本连接四'] = { x = 25920.0, y = 10482.0, z = 1026.2678222656, key_call = 'KEY_G' },
                },
            },
        },

        ['破败的泽纳尔'] = {
            ['破败的泽纳尔-右边'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-电梯二'] = { x = 18696.044921875, y = 10219.252929688, z = -1968.3555908203, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                },
            },
            ['破败的泽纳尔-电梯二'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['破败的泽纳尔-右边'] = { x = 18696.044921875, y = 10219.252929688, z = -1968.3555908203 },
                    ['破败的泽纳尔-中间'] = { x = 19200.0, y = 9675.0, z = -1016.9251708984 },
                },
            },
            ['破败的泽纳尔-中间'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-电梯二'] = { x = 19200.0, y = 9675.0, z = -1016.9251708984, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                    ['破败的泽纳尔-电梯一'] = { x = 25471.0, y = 12106.0, z = -941.64202880859, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                },
            },

            ['破败的泽纳尔-电梯一'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['破败的泽纳尔-中间'] = { x = 25471.0, y = 12106.0, z = -941.64202880859 },
                    ['破败的泽纳尔-下边'] = { x = 26004.0, y = 11548.0, z = 7.0749359130859 },
                },
            },
            ['破败的泽纳尔-下边'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-电梯一'] = { x = 26004.0, y = 11548.0, z = 7.0749359130859, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                    ['破败的泽纳尔-外圈'] = { x = 14491.516601562, y = 12236.9609375, z = 791.75897216797 },
                },
            },
            ['破败的泽纳尔-外圈'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-下边'] = { x = 24796.083984375, y = 27788.36328125, z = 2643.2502441406 },
                    ['破败的泽纳尔-内电梯'] = { x = 25563.0, y = 31068.0, z = 2577.0, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                },
            },
            ['破败的泽纳尔-内电梯'] = {
                ['移动类型'] = '升降', -- 升降/移动
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-外圈'] = { x = 25563.0, y = 31068.0, z = 2577.0, wait_time = 1 },
                    ['破败的泽纳尔-内中间'] = { x = 25616.0, y = 30275.0, z = 23.399993896484 },
                },
            },
            ['破败的泽纳尔-内中间'] = {
                ['所属大陆'] = '破败的泽纳尔',
                ['可换地图'] = {
                    ['破败的泽纳尔-内电梯'] = { x = 25616.0, y = 30275.0, z = 23.399993896484, wait_time = 1, ['操作'] = { res_id = 0xF6E29, type = 15, action = 4 }, },
                },
            },
        },

        ['铁锤工坊'] = {
            ['铁锤工坊-连接点'] = {
                ['所属大陆'] = '铁锤工坊',
                ['可换地图'] = {
                    ['铁锤工坊-中间'] = { x = -29493.0, y = -26966.0, z = 3415.9997558594, key_call = 'KEY_G' },
                    ['铁锤工坊-大板块'] = { x = -30481.0, y = -25509.0, z = 3417.0, key_call = 'KEY_G' },
                },
            },
            ['铁锤工坊-中间'] = {
                ['所属大陆'] = '铁锤工坊',
                ['可换地图'] = {
                    ['铁锤工坊-连接点'] = { x = -29313.0, y = -26960.0, z = 3928.7312011719, key_call = 'KEY_G' },
                },
            },
            ['铁锤工坊-大板块'] = {
                ['所属大陆'] = '铁锤工坊',
                ['可换地图'] = {
                    ['铁锤工坊-连接点'] = { x = -30658.0, y = -25501.0, z = 2903.9995117188, key_call = 'KEY_G',wait_time = 6 },
                },
            },
        },

        ['黑砧工坊'] = {
            ['黑砧工坊-大板块'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-下小'] = { x = 14047.0, y = 12534.0, z = -514.09033203125, key_call = 'KEY_G' },
                    ['黑砧工坊-右上'] = { x = 27246.0, y = 25947.0, z = 560.15570068359, key_call = 'KEY_G' },
                    ['黑砧工坊-右小'] = { x = 15112.0, y = 24856.0, z = -1680.6899414062, key_call = 'KEY_G' },

                },
            },
            ['黑砧工坊-右小'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-大板块'] = { x = 15167.0, y = 25212.0, z = -1658.7513427734, key_call = 'KEY_G' },
                    ['黑砧工坊-正右'] = { x = 14885.068359375, y = 25488.0703125, z = -1657.2391357422, key_call = 'KEY_G' },
                },
            },
            ['黑砧工坊-正右'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-右小'] = { x = 14699.0, y = 25720.0, z = -1910.9998779297, key_call = 'KEY_G' },
                    ['黑砧工坊-副本连接'] = { x = 14053.522460938, y = 26727.166015625, z = -1837.6147460938, key_call = 'KEY_G' },
                },
            },
            ['黑砧工坊-副本连接'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-正右'] = { x = 14005.0, y = 26568.0, z = -2350.0, key_call = 'KEY_G',wait_time = 6 },
                    ['黑砧工坊-副本门口'] = { x = 13169.9140625, y = 25856.556640625, z = -2351.3198242188, key_call = 'KEY_G' },
                },
            },
            ['黑砧工坊-副本门口'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-副本连接'] = { x = 12812.0, y = 25902.0, z = -2353.9262695312, key_call = 'KEY_G' },
                },
            },
            ['黑砧工坊-右上'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-大板块'] = { x = 27239.0, y = 26283.0, z = 318.16448974609, key_call = 'KEY_G' },
                },
            },
            ['黑砧工坊-下小'] = {
                ['所属大陆'] = '黑砧工坊',
                ['可换地图'] = {
                    ['黑砧工坊-大板块'] = { x = 13993.0, y = 12388.0, z = -1023.9998779297, key_call = 'KEY_G' },
                },
            },
        },

        ['伟大之城'] = {
            ['伟大之城-主城'] = {
                ['可换地图'] = {
                    ['伟大之城-升降机'] = { x = 7152, y = 15941, z = 4260,wait_time = 1,['操作'] = { res_id = 0x113E76,type = 15,action = 4 }, },--false
                },
            },
            ['伟大之城-升降机'] = {
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['伟大之城-连接黑砧工坊'] = { x = 6498, y = 15940, z = 3065 },--false
                    ['伟大之城-主城'] = { x = 7246, y = 15927, z = 4260 },--false
                },
            },
            ['伟大之城-连接黑砧工坊'] = {
                ['可换地图'] = {
                    ['伟大之城-升降机'] = { x = 6575, y = 15927, z = 3065,wait_time = 1,['操作'] = { res_id = 0x113E76,type = 15,action = 4 }, },--false
                },
            },
        },

        ['未竟庭院'] = {
            ['未竟庭院-二楼'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-升降机'] = { x = -24281.0, y = 12943.0, z = 2197.267578125, wait_time = 1, ['操作'] = { res_id = 0x1142C2, type = 15, action = 4 }, },
                },
            },
            ['未竟庭院-升降机'] = {
                ['所属大陆'] = '未竟庭院',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['未竟庭院-二楼'] = { x = -24281.0, y = 12943.0, z = 2197.267578125, },
                    ['未竟庭院-大右'] = { x = -24297.720703125, y = 12937.411132812, z = 902.46728515625, },
                },
            },
            ['未竟庭院-大右'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-升降机'] = { x = -24297.720703125, y = 12937.411132812, z = 902.46728515625, wait_time = 1, ['操作'] = { res_id = 0x1142C2, type = 15, action = 4 }, },
                    ['未竟庭院-连接'] = { x = -11999.0, y = 19042.0, z = 6.0001831054688, key_call = 'KEY_G' },

                },
            },
            ['未竟庭院-连接'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-大右'] = { x = -11847.0, y = 19025.0, z = 1040.2941894531, key_call = 'KEY_G' },
                    ['未竟庭院-小正上'] = { x = -4935.0, y = 19434.0, z = 1038.6408691406, key_call = 'KEY_G' },
                    ['未竟庭院-小正左'] = { x = -4734.0, y = 17842.0, z = 1028.3026123047, key_call = 'KEY_G' },
                    ['未竟庭院-小正下'] = { x = -5276.0, y = 17048.0, z = 1037.763671875, key_call = 'KEY_G' },
                    ['未竟庭院-大左'] = { x = -6708.0, y = 12344.0, z = 1001.4282226562, key_call = 'KEY_G' },
                },
            },
            ['未竟庭院-小正左'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-连接'] = { x = -4553.0, y = 17805.0, z = 1560.5048828125, key_call = 'KEY_G' },
                },
            },
            ['未竟庭院-小正上'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-连接'] = { x = -4747.0, y = 19699.0, z = 1297.7543945312, key_call = 'KEY_G' },
                },
            },
            ['未竟庭院-大左'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-连接'] = { x = -6536.005859375, y = 12371.483398438, z = 2023.4001464844, key_call = 'KEY_G' },
                },
            },
            ['未竟庭院-小正下'] = {
                ['所属大陆'] = '未竟庭院',
                ['可换地图'] = {
                    ['未竟庭院-连接'] = { x = -5626.0, y = 17044.0, z = 782.03137207031, key_call = 'KEY_G' },
                },
            },

        },

        ['应许之地'] = {
            ['应许之地-遗忘的老路'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-熔岩绝壁连接'] = { x = 17066.0, y = 7451.0, z = 1287.291015625, key_call = 'KEY_G' },
                    ['应许之地-广场'] = { x = 18287.0, y = 17364.0, z = 251.94766235352, key_call = 'KEY_G' },
                },
            },
            ['应许之地-熔岩绝壁连接'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-遗忘的老路'] = { x = 16907.0, y = 7522.0, z = 771.99975585938, key_call = 'KEY_G' },
                    ['应许之地-熔岩绝壁'] = { x = 16368.0, y = 7416.0, z = 771.32000732422, key_call = 'KEY_G' },
                },
            },
            ['应许之地-熔岩绝壁'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-熔岩绝壁连接'] = { x = 16018.0, y = 7296.0, z = 511.99975585938, key_call = 'KEY_G' },
                },
            },
            ['应许之地-广场'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-安息之地'] = { x = 13830.0, y = 16781.0, z = 177.40069580078, key_call = 'KEY_G' },
                },
            },
            ['应许之地-安息之地'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-广场'] = { x = 13678.0, y = 16788.0, z = -328.57244873047, key_call = 'KEY_G' },
                    ['应许之地-陆下人浮雕连接一'] = { x = 9780.0, y = 20898.0, z = -125.2822265625, key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['应许之地-陆下人浮雕连接一'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-安息之地'] = { x = 9753.0, y = 21206.0, z = -111.49348449707, key_call = 'KEY_G',wait_time = 2 },
                    ['应许之地-陆下人浮雕连接二'] = { x = 9961.0, y = 22205.0, z = -110.48126220703, key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['应许之地-陆下人浮雕连接二'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-陆下人浮雕连接一'] = { x = 10219.0, y = 22465.0, z = 134.57975769043, key_call = 'KEY_G',wait_time = 3 },
                    ['应许之地-陆下人浮雕'] = { x = 11181.0, y = 23555.0, z = 127.99977111816, key_call = 'KEY_G',wait_time = 8,stop_riding = true },
                },
            },
            ['应许之地-陆下人浮雕'] = {
                ['所属大陆'] = '应许之地',
                ['可换地图'] = {
                    ['应许之地-陆下人浮雕连接二'] = { x = 11220.0, y = 23731.0, z = 1148.9700927734, key_call = 'KEY_G',wait_time = 2 },
                    ['应许之地-遗忘的老路'] = { x = 17037.0, y = 22291.0, z = 1148.2153320312, key_call = 'KEY_G',wait_time = 2 },
                },
            },
        },

        ['红月印迹'] = {
            ['红月印迹-碎片山丘'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-碎片山丘上边'] = { x = 5859.0, y = 4052.0, z = 1256.30859375,wait_time = 9,key_call = 'KEY_G'},
                },
            },
            ['红月印迹-碎片山丘上边'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-碎片山丘'] = { x = 6162.0, y = 5085.0, z = 1262.2835693359,wait_time = 9,key_call = 'KEY_G'},
                    ['红月印迹-碎片山丘上边连接受伤的大地'] =  { x = 7080.0, y = 6377.0, z = 1236.14453125,wait_time = 2,key_call = 'KEY_G'},
                },
            },
            ['红月印迹-碎片山丘上边连接受伤的大地'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-碎片山丘上边'] = { x = 7155.0, y = 6220.0, z = 732.99981689453,key_call = 'KEY_G',wait_time = 4 },
                    ['红月印迹-受伤的大地连接碎片山丘电梯'] =  { x = 8995.0, y = 5384.0, z = 735.66363525391, wait_time = 1, ['操作'] = { res_id = 0x10A749, type = 15, action = 4 }, },
                },
            },
            ['红月印迹-受伤的大地连接碎片山丘电梯'] = {
                ['所属大陆'] = '红月印迹',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['红月印迹-碎片山丘上边连接受伤的大地'] = { x = 8995.0, y = 5384.0, z = 735.66363525391, wait_time = 1 },
                    ['红月印迹-受伤的大地'] =  { x = 9223.9013671875, y = 4893.8061523438, z = 259.89266967773,wait_time = 1 },
                },
            },

            ['红月印迹-受伤的大地'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-受伤的大地连接碎片山丘电梯'] = { x = 9227.1201171875, y = 4877.3510742188, z = 259.94616699219, wait_time = 1, ['操作'] = { res_id = 0x10A749, type = 15, action = 4 }, },
                    ['红月印迹-沉默之环一'] =  { x = 18520.0, y = 2547.0, z = 260.0778503418,key_call = 'KEY_G',wait_time = 13 },
                    ['红月印迹-罪恶洞穴'] = { x = 9900.0029296875, y = 7393.0024414062, z = 259.64700317383,key_call = 'KEY_G',wait_time = 2 },
                    ['红月印迹-遗忘废墟'] =  { x = 10769.0, y = 6908.0, z = 254.13137817383,key_call = 'KEY_G',wait_time = 4 },
                },
            },
            ['红月印迹-沉默之环一'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-受伤的大地'] = { x = 18520.0, y = 2547.0, z = 260.0778503418,key_call = 'KEY_G',wait_time = 13 },
                    ['红月印迹-沉默之环二'] =  { x = 21145.0, y = 3381.0, z = 252.45040893555,key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['红月印迹-沉默之环二'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-沉默之环一'] = { x = 21483.0, y = 3256.0, z = 517.64929199219,key_call = 'KEY_G',wait_time = 1 },
                    ['红月印迹-沉默之环三'] =  { x = 21171.0, y = 4897.0, z = 515.79162597656,key_call = 'KEY_G',wait_time = 14 },
                },
            },
            ['红月印迹-沉默之环三'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-沉默之环二'] = { x = 21924.0, y = 5648.8002929688, z = 513.91076660156,key_call = 'KEY_G',wait_time = 14 },
                },
            },
            ['红月印迹-遗忘废墟'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-受伤的大地'] = { x = 10859.0, y = 6829.0, z = 770.26110839844,key_call = 'KEY_G',wait_time = 2 },
                    ['红月印迹-遗忘废墟上方'] = { x = 16893.0, y = 9845.0, z = 1249.3803710938,key_call = 'KEY_G',wait_time = 13 },
                },
            },
            ['红月印迹-遗忘废墟上方'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-遗忘废墟'] = { x = 17841.0, y = 10375.0, z = 1239.884765625,key_call = 'KEY_G',wait_time = 13 },
                },
            },

            ['红月印迹-罪恶洞穴'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-受伤的大地'] = { x = 9830.0, y = 7621.0, z = -761.00018310547,key_call = 'KEY_G',wait_time = 15 },
                    ['红月印迹-半魔人居住地'] = { x = 1031.9851074219, y = 18227.994140625, z = -1988.9998779297,key_call = 'KEY_G',wait_time = 1 },
                },
            },
            ['红月印迹-半魔人居住地'] = {
                ['所属大陆'] = '红月印迹',
                ['可换地图'] = {
                    ['红月印迹-罪恶洞穴'] = { x = -2237.0395507812, y = 47383.203125, z = -5282.4311523438,key_call = 'KEY_G',wait_time = 1 },
                },
            },
        },

        ['无名峡谷'] = {
            ['无名峡谷-赛克利亚营地'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-赛克利亚营地右小台阶'] = { x = -6432.4047851562, y = 12240.915039062, z = 16389.31640625,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-赛克利亚营地右小台阶'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-赛克利亚营地'] = { x = -6749.0, y = 12578.0, z = 16132.458984375,key_call = 'KEY_G'},
                    ['无名峡谷-赛克利亚营地下方'] = { x = -6800.0, y = 12120.0, z = 16130.924804688,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-赛克利亚营地下方'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-赛克利亚营地右小台阶'] = { x = -6962.0, y = 12130.0, z = 15103.998046875,key_call = 'KEY_G'},
                    ['无名峡谷-赛克利亚营地下方小坑'] = { x = -7399.5791015625, y = 13509.881835938, z = 15099.079101562,key_call = 'KEY_G'},
                    ['无名峡谷-黑树林'] = { x = -9363.0, y = 17293.0, z = 15107.892578125,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-赛克利亚营地下方小坑'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-赛克利亚营地下方'] = { x = -7921.0, y = 14363.0, z = 14591.999023438,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-黑树林'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-赛克利亚营地下方'] = { x = -9431.0, y = 17706.0, z = 14847.998046875,key_call = 'KEY_G'},
                    ['无名峡谷-黑树林与地图右下连接处'] = { x = -20682.0, y = 19196.0, z = 14337.90625,key_call = 'KEY_G'},
                    ['无名峡谷-半魔人居住地'] = { x = -22401.0, y = 16980.0, z = 14344.5234375,key_call = 'KEY_G'},
                },
            },

            ['无名峡谷-黑树林与地图右下连接处'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-黑树林'] = { x = -20685.0, y = 19333.0, z = 14851.771484375,key_call = 'KEY_G'},
                    ['无名峡谷-地图右下'] = { x = -22366.0, y = 20130.0, z = 14847.998046875,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-地图右下'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-黑树林与地图右下连接处'] = { x = -22379.65234375, y = 20285.263671875, z = 15363.745117188,key_call = 'KEY_G'},
                    ['无名峡谷-地图右下右下处'] = { x = -23870.0, y = 23030.0, z = 15365.96875,key_call = 'KEY_G'},
                    ['无名峡谷-地图右下左处'] = { x = -26094.0, y = 14053.0, z = 14849.985351562,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-地图右下右下处'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-地图右下'] = { x = -24019.0, y = 22971.0, z = 14847.998046875,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-地图右下左处'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-地图右下'] = { x = -25776.0, y = 14038.0, z = 14591.999023438,key_call = 'KEY_G'},
                },
            },

            ['无名峡谷-半魔人居住地'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-黑树林'] = { x = -22846.62109375, y = 16478.798828125, z = 14338.986328125,key_call = 'KEY_G'},
                    ['无名峡谷-半魔人居休息处左下一'] = { x = -17386.0, y = 10223.0, z = 15368.399414062,key_call = 'KEY_G'},
                    ['无名峡谷-半魔人居休息处左下二'] = { x = -20210.0, y = 6861.0, z = 14335.999023438,key_call = 'KEY_G'},
                    ['无名峡谷-半魔人居休息处连接营地处下'] = { x = -20727.0, y = 5640.0, z = 14335.999023438,key_call = 'KEY_G'},
                    ['无名峡谷-左中连接处'] = { x = -13769.0, y = 7397.0, z = 14857.995117188,key_call = 'KEY_G'},
                },
            },

            ['无名峡谷-半魔人居休息处左下一'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-半魔人居住地'] = { x = -17336.0, y = 9871.0, z = 15103.998046875,key_call = 'KEY_G'},
                },
            },

            ['无名峡谷-半魔人居休息处左下二'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-半魔人居住地'] = { x = -20216.0, y = 6978.0, z = 15361.615234375,key_call = 'KEY_G'},
                    ['无名峡谷-半魔人居休息处左下二瞭望塔'] = { x = -18421.0, y = 7733.0, z = 15359.998046875,key_call = 'KEY_G'},
                },
            },

            ['无名峡谷-半魔人居休息处左下二瞭望塔'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-半魔人居休息处左下二'] = { x = -18510.0, y = 7842.0, z = 15892.275390625,key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['无名峡谷-左中连接处'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-半魔人居住地'] = { x = -14018.0, y = 8199.0, z = 15103.998046875,key_call = 'KEY_G'},
                },
            },
            ['无名峡谷-半魔人居休息处连接营地处下'] = {
                ['所属大陆'] = '无名峡谷',
                ['可换地图'] = {
                    ['无名峡谷-半魔人居住地'] = { x = -20589.0, y = 5541.0, z = 14849.61328125,key_call = 'KEY_G'},
                },
            },

        },

        ['冰蝶峭壁'] = {
            ['冰蝶峭壁-右边'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-中间小'] = { x = 14586.0, y = 16293.0, z = 19.660423278809, key_call = 'KEY_G', wait_time = 2 },
                    ['冰蝶峭壁-中间'] = { x = 16691.0, y = 18285.0, z = -0.00014495849609375, key_call = 'KEY_G', wait_time = 3 },
                    ['冰蝶峭壁-下面'] = { x = 6719.599609375, y = 12723.875, z = 3.7753448486328, key_call = 'KEY_G', wait_time = 2 },
                },
            },

            ['冰蝶峭壁-下面'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-右边'] = { x = 6764.0, y = 12569.0, z = -520.97198486328, key_call = 'KEY_G', wait_time = 3 },
                },
            },
            ['冰蝶峭壁-中间小'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-右边'] = { x = 14609.0, y = 16146.0, z = -511.99993896484, key_call = 'KEY_G', wait_time = 3 },
                },
            },

            ['冰蝶峭壁-中间'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-右边'] = { x = 16838.0, y = 18284.0, z = 513.73492431641, key_call = 'KEY_G', wait_time = 2 },
                    ['冰蝶峭壁-左一'] = { x = 15222.0, y = 5410.0, z = 514.26501464844, key_call = 'KEY_G', wait_time = 2 },

                },
            },
            ['冰蝶峭壁-左一'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-中间'] = { x = 15224.0, y = 5269.0, z = -7.62939453125e-05, key_call = 'KEY_G', wait_time = 3 },
                    ['冰蝶峭壁-左二'] = { x = 15727.0, y = 3351.0, z = 2.0, key_call = 'KEY_G', wait_time = 2 },

                },
            },
            ['冰蝶峭壁-左二'] = {
                ['所属大陆'] = '冰蝶峭壁',
                ['可换地图'] = {
                    ['冰蝶峭壁-左一'] = { x = 15740.0, y = 3206.0, z = -512.00012207031,key_call = 'KEY_G',wait_time = 3 },
                },
            },
        },

        ['阴沉峭壁'] = {
            ['阴沉峭壁-门口'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-电梯'] = { x = 15858, y = 4105, z = -491, wait_time = 1, ['操作'] = { res_id = 0x10A6E5, type = 15, action = 4 }, },
                },
            },
            ['阴沉峭壁-电梯'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    ['阴沉峭壁-门口'] = {x = 15858, y = 4105, z = -491},
                    ['阴沉峭壁-圣疗院广场'] = {x = 15865.0, y = 4874.0, z = 1027.0},
                },
            },
            ['阴沉峭壁-圣疗院广场'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-电梯'] = { x = 15865, y = 4874, z = 1027, wait_time = 1, ['操作'] = { res_id = 0x10A6E5, type = 15, action = 4 }, },
                    ['阴沉峭壁-暗影圣疗院入口一'] = { x = 13191.0, y = 9764.0, z = 899.0,key_call = 'KEY_G', wait_time = 2},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口一'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗院广场'] = { x = 13198.0, y = 10425.0, z = 905.89123535156,key_call = 'KEY_G', wait_time = 2},
                    ['阴沉峭壁-暗影圣疗院入口二'] = { x = 13777.868164062, y = 10423.857421875, z = 906.30773925781,key_call = 'KEY_G', wait_time = 4},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口二'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口三'] = { x = 9098.0, y = 14403.0, z = 1025.0,key_call = 'KEY_G', wait_time = 2},
                    ['阴沉峭壁-暗影圣疗院入口一'] = { x = 13897.0, y = 10530.0, z = 1418.5311279297,key_call = 'KEY_G', wait_time = 1},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口三'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口二'] = { x = 9095.0, y = 15027.0, z = 1025.0,key_call = 'KEY_G', wait_time = 2},
                    ['阴沉峭壁-暗影圣疗院入口四'] = { x = 9056.0, y = 15591.0, z = 1025.0,key_call = 'KEY_G', wait_time = 2},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口四'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口三'] = { x = 9050.0, y = 15904.0, z = 1288.3172607422,key_call = 'KEY_G', wait_time = 1},
                    ['阴沉峭壁-暗影圣疗院入口五'] = { x = 6536.0, y = 15521.0, z = 1275.2980957031,key_call = 'KEY_G', wait_time = 1},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口五'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口四'] = { x = 6402.9409179688, y = 15535.067382812, z = 772.8154296875,key_call = 'KEY_G',wait_time = 5},
                    ['阴沉峭壁-暗影圣疗院入口六'] = { x = 4041.0, y = 14279.0, z = 769.00006103516,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口六'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口五'] = { x = 4031.0, y = 15395.0, z = 769.0,key_call = 'KEY_G',wait_time = 10},
                    ['阴沉峭壁-暗影圣疗院入口七'] = { x = 3926.0, y = 15595.0, z = 769.0,key_call = 'KEY_G',wait_time = 3},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口七'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口六'] = { x = 3928.0, y = 15749.0, z = 1276.9348144531,key_call = 'KEY_G',wait_time = 1},
                    ['阴沉峭壁-暗影圣疗院入口八'] = { x = 3961.0, y = 16495.0, z = 1275.0006103516,key_call = 'KEY_G',wait_time = 1},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口八'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口七'] = { x = 4285.0, y = 16479.0, z = 1016.9348144531,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-暗影圣疗院入口九'] = { x = 4324.0, y = 16986.0, z = 888.93487548828,key_call = 'KEY_G',wait_time = 2},
                },
            },
            ['阴沉峭壁-暗影圣疗院入口九'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口八'] = { x = 4762.0, y = 17332.0, z = 903.36303710938,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-暗影圣疗院'] = { x = 5790.0, y = 17520.0, z = 903.36303710938,key_call = 'KEY_G',wait_time = 2},
                },
            },

            ['阴沉峭壁-暗影圣疗院'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院入口九'] = { x = 6042.0, y = 17751.0, z = 647.90954589844,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-圣疗外围一'] = { x = 5307.0, y = 22151.0, z = 768.90954589844,key_call = 'KEY_G',wait_time = 2},
                },
            },
            ['阴沉峭壁-圣疗外围一'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-暗影圣疗院'] = { x = 5089.0, y = 22333.0, z = 1033.6351318359,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-圣疗外围二'] = { x = 4851.0, y = 23100.0, z = 1025.0,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-圣疗外围二'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围一'] = { x = 5625.0, y = 23869.0, z = 1034.8809814453,key_call = 'KEY_G',wait_time = 10},
                    ['阴沉峭壁-圣疗外围三'] = { x = 6158.0, y = 24327.0, z = 1031.9094238281,key_call = 'KEY_G',wait_time = 6},
                },
            },
            ['阴沉峭壁-圣疗外围三'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围二'] = { x = 6315.0, y = 24321.0, z = 1531.2980957031,key_call = 'KEY_G',wait_time = 1},
                    ['阴沉峭壁-圣疗外围四'] = { x = 9295.0, y = 24655.0, z = 1535.9095458984,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-圣疗外围四'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围三'] = { x = 9308.0, y = 25763.0, z = 1539.9095458984,key_call = 'KEY_G',wait_time = 10},
                    ['阴沉峭壁-圣疗外围'] = { x = 9279.0, y = 27223.0, z = 1535.9095458984,key_call = 'KEY_G',wait_time = 1},
                },
            },
            ['阴沉峭壁-圣疗外围'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围四'] = { x = 9296.0, y = 27539.0, z = 1281.2980957031,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-圣疗外围内三'] = { x = 13509.0, y = 30847.0, z = 771.0,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-圣疗外围内一'] = { x = 18202.0, y = 28554.0, z = 1023.9998779297,key_call = 'KEY_G',wait_time = 2},
                    ['阴沉峭壁-圣疗城郭'] = { x = 23448.0, y = 26555.0, z = 1545.0,key_call = 'KEY_G',wait_time = 2},
                },
            },
            ['阴沉峭壁-圣疗外围内三'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围'] = { x = 13978.0, y = 30591.0, z = 1287.0,key_call = 'KEY_G',wait_time = 1},
                },
            },
            ['阴沉峭壁-圣疗外围内一'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围'] = { x = 18365.341796875, y = 28568.453125, z = 1537.3399658203,key_call = 'KEY_G',wait_time = 1},
                    ['阴沉峭壁-圣疗外围内二'] = { x = 18822.0, y = 28302.0, z = 1535.9095458984,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-圣疗外围内二'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围内一'] = { x = 19947.0, y = 28293.0, z = 1539.0,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-圣疗城郭'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗外围'] = { x = 23597, y = 26567, z = 2566,key_call = 'KEY_G',wait_time = 2 },--false
                    ['阴沉峭壁-圣疗城郭一'] = { x = 25334.0, y = 26292.0, z = 2557.0,key_call = 'KEY_G'},
                },
            },
            ['阴沉峭壁-圣疗城郭一'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭'] = { x = 25321.0, y = 26131.0, z = 1543.3214111328,key_call = 'KEY_G',wait_time = 11},
                    ['阴沉峭壁-圣疗城郭二'] = { x = 23463.0, y = 18669.0, z = 1545.0,key_call = 'KEY_G',wait_time = 11},
                },
            },
            ['阴沉峭壁-圣疗城郭二'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭一'] = { x = 23595.0, y = 18655.0, z = 2566.1831054688,key_call = 'KEY_G'},
                    ['阴沉峭壁-圣疗城郭三'] = { x = 27346.0, y = 18093.0, z = 2566.1831054688,key_call = 'KEY_G'},
                },
            },
            ['阴沉峭壁-圣疗城郭三'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭二'] = { x = 27278.0, y = 18035.0, z = 1540.9998779297,key_call = 'KEY_G',wait_time = 12},
                    ['阴沉峭壁-圣疗城郭四'] = { x = 28687.0, y = 13844.0, z = 1535.1866455078,key_call = 'KEY_G'},
                },
            },
            ['阴沉峭壁-圣疗城郭四'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭三'] = { x = 28950.0, y = 13673.0, z = 1792.7589111328,key_call = 'KEY_G'},
                    ['阴沉峭壁-圣疗城郭五'] = { x = 29588.0, y = 11094.0, z = 2054.0,key_call = 'KEY_G'},
                },
            },
            ['阴沉峭壁-圣疗城郭五'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭四'] = { x = 29762.0, y = 11095.0, z = 2568.0007324219,key_call = 'KEY_G'},
                    ['阴沉峭壁-圣疗城郭六'] = { x = 29720.0, y = 10557.0, z = 2567.9973144531,key_call = 'KEY_G',wait_time = 10},
                },
            },
            ['阴沉峭壁-圣疗城郭六'] = {
                ['所属大陆'] = '阴沉峭壁',
                ['可换地图'] = {
                    ['阴沉峭壁-圣疗城郭五'] = { x = 28651.0, y = 10542.0, z = 2561.5598144531,key_call = 'KEY_G',wait_time = 10},
                },
            },
        },

        ['哀叹沼泽'] = {
            ['哀叹沼泽-呼啸森林'] = {
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-沼泽大板块'] = { x = 3926.7700195312, y = 3731.2104492188, z = 2302.5642089844,key_call = 'KEY_G',wait_time = 2 },
                },
            },

            ['哀叹沼泽-沼泽大板块'] = {
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-呼啸森林'] = { x = 4040.0, y = 3616.0, z = 1791.9996337891,key_call = 'KEY_G',wait_time = 4 },
                    ['哀叹沼泽-半魔人居住地小'] = { x = 20382.0, y = 3719.0, z = 3082.2680664062,key_call = 'KEY_G',wait_time = 3 },
                    ['哀叹沼泽-守望者栖息地'] = { x = 13089.0, y = 7175.0, z = 2047.685546875,key_call = 'KEY_G',wait_time = 2 },
                    ['哀叹沼泽-电梯'] = { x = 3970.0, y = 18527.0, z = 2048.1057128906,key_call = 'KEY_G',wait_time = 2, ['操作'] = { res_id = 0x10A681, type = 15, action = 4 }, },
                },
            },

            ['哀叹沼泽-半魔人居住地小'] = {
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-沼泽大板块'] = { x = 20399.0, y = 4979.0, z = 2048.8857421875,key_call = 'KEY_G',wait_time = 2 },
                },
            },

            ['哀叹沼泽-守望者栖息地'] = {
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-沼泽大板块'] = { x = 13086.620117188, y = 7275.1220703125, z = 2045.0,key_call = 'KEY_G',wait_time = 13 },
                },
            },

            ['哀叹沼泽-电梯'] = {
                ['移动类型'] = '移动', -- 升降/移动
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-绝望沼泽'] = { x = 5539.0, y = 18084.0, z = 1536.6088867188,key_call = 'KEY_G',wait_time = 1 },
                },
            },
            ['哀叹沼泽-绝望沼泽'] = {
                ['所属大陆'] = '哀叹沼泽',
                ['可换地图'] = {
                    ['哀叹沼泽-沼泽大板块'] = { x = 7527.0, y = 22359.0, z = 1023.9997558594,key_call = 'KEY_G',wait_time = 5 },
                },
            },
        },

        ['卡拉贾村'] = {

            ['亡者峡谷-上'] = {
                ['所属大陆'] = '卡拉贾村',
                ['可换地图'] = {
                    ['亡者峡谷-右'] = { x = -107, y = 1922, z = -3053,key_call = 'KEY_G',wait_time = 2 },--false
                    ['亡者峡谷-左'] = { x = 1344, y = 633, z = -3061,key_call = 'KEY_G',wait_time = 3 },--false
                },
            },
            ['亡者峡谷-下'] = {
                ['所属大陆'] = '卡拉贾村',
                ['可换地图'] = {
                    ['亡者峡谷-左'] = { x = -833, y = -1688, z = -3059,key_call = 'KEY_G',wait_time = 2 },--false
                    ['亡者峡谷-右'] = { x = -1560, y = -58, z = -3071,key_call = 'KEY_G',wait_time = 2 },
                },
            },
            ['亡者峡谷-左'] = {
                ['所属大陆'] = '卡拉贾村',
                ['可换地图'] = {
                    ['亡者峡谷-上'] = { x = 1352, y = -28, z = -3057,key_call = 'KEY_G',wait_time = 3 },--false
                    ['亡者峡谷-下'] = { x = -80, y = -1575, z = -3057,key_call = 'KEY_G',wait_time = 3 },--false
                },
            },
            ['亡者峡谷-右'] = {
                ['所属大陆'] = '卡拉贾村',
                ['可换地图'] = {
                    ['亡者峡谷-下'] = { x = -1802, y = 556, z = -3060,key_call = 'KEY_G',wait_time = 2 },--false
                    ['亡者峡谷-上'] = { x = -722, y = 1722, z = -3042,key_call = 'KEY_G',wait_time = 2  },--false
                },
            },
        },

        ['大岩林'] = {
            ['大岩林-西南上'] = {
                ['所属大陆'] = '大岩林',
                ['可换地图'] = {
                    ['大岩林-西南中'] = { x = 14250.0, y = 6311.0, z = 91,key_call = 'KEY_G' },--false
                },
            },
            ['大岩林-西南中'] = {
                ['所属大陆'] = '大岩林',
                ['可换地图'] = {
                    ['大岩林-西南上'] = { x = 14563.0, y = 6008.0, z = 83,key_call = 'KEY_G' },--false
                    ['大岩林-西南下-南中'] = { x = 14353.888671875, y = 5754.4423828125, z = 86,key_call = 'KEY_G' },--false
                },
            },
            ['大岩林-西南下-南中'] = {
                ['所属大陆'] = '大岩林',
                ['可换地图'] = {
                    ['大岩林-北中'] = { x = 10868.0, y = 10006.0, z = 1535,key_call = 'KEY_G' },--false,--false
                    ['大岩林-南下'] = { x = 7741.0, y = 3888.0, z = 1083,key_call = 'KEY_G' },--false
                    ['大岩林-西南中'] = { x = 14334.0, y = 5411.0, z = 81 },--false
                },
            },
            ['大岩林-北中'] = {
                ['所属大陆'] = '大岩林',
                ['可换地图'] = {
                    ['大岩林-西南下-南中'] = { x = 10968.594726562, y = 10297.685546875, z = 2047,key_call = 'KEY_G' },--false
                },
            },
            ['大岩林-南下'] = {
                ['所属大陆'] = '大岩林',
                ['可换地图'] = {
                    ['大岩林-西南下-南中'] = { x = 7720.0, y = 3638.0, z = -1,key_call = 'KEY_G',wait_time = 11 },--false
                },
            },
        },

        ['沉默巨人之森'] = {
            ['岩石之乡-下'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['可换地图'] = {
                    ['岩石之乡'] = { x = 4253.0, y = 1324.0, z = -3812,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['岩石之乡'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['可换地图'] = {
                    ['岩石之乡-下'] = { x = 4138.0, y = 1739.0, z = -3559,key_call = 'KEY_G',wait_time = 1 },--false
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['岩石之乡-升降-中间'] = { x = 8592.0, y = 7629.0, z = -3545,wait_time = 1,['操作'] = { res_id = 0x10CE59,type = 15,action = 4 }, },--false
                },
            },
            ['岩石之乡-升降-中间'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['岩石之乡'] = { x = 8592.0, y = 7629.0, z = -3545 },--false
                    ['岩石之乡-中间'] = { x = 8664.0, y = 8128.0, z = -1497 },--false
                },
            },
            ['岩石之乡-中间'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['可换地图'] = {
                    ['岩石之乡-中间-跳跃1'] = { x = 7896.0, y = 8821.0, z = -1483,key_call = 'KEY_G',wait_time = 1 },--false
                    ['托托克之首-升降-中间2'] = { x = 13817.0, y = 15593.0, z = -1492,wait_time = 1,['操作'] = { res_id = 0x10CE59,type = 15,action = 4 }, },--false
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['岩石之乡-升降-中间'] = { x = 8664.0, y = 8128.0, z = -1497,wait_time = 1,['操作'] = { res_id = 0x10CE59,type = 15,action = 4 }, },--false
                    ['岩石之乡-中间3'] = { x = 8946.4091796875, y = 14286.208007812, z = -1509,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['岩石之乡-中间3'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['可换地图'] = {
                    ['岩石之乡-中间'] = { x = 9242.0, y = 14237.0, z = -1735,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['托托克之首-升降-中间2'] = {
                ['所属大陆'] = '沉默巨人之森',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['托托克之首-下'] = { x = 14429.0, y = 15907.0, z = -466 },--false
                    ['岩石之乡-中间'] = { x = 13817.0, y = 15593.0, z = -1492 },--false
                },
            },
            ['岩石之乡-中间-跳跃1'] = {
                ['可换地图'] = {
                    ['岩石之乡-中间'] = { x = 7574.0, y = 9029.0, z = -1751,key_call = 'KEY_G',wait_time = 1 },--false
                    ['岩石之乡-中间-跳跃2'] = { x = 7702.0, y = 8767.0, z = -1796,key_call = 'KEY_G',wait_time = 1 },--false
                }
            },
            ['岩石之乡-中间-跳跃2'] = {
                ['可换地图'] = {
                    ['岩石之乡-中间-跳跃1'] = { x = 7699.0, y = 8529.0, z = -2070,key_call = 'KEY_G',wait_time = 1 },--false
                    ['托托克之臂'] = { x = 7439.0, y = 8820.0, z = -2204,key_call = 'KEY_G',wait_time = 1 },--false
                }
            },
            ['托托克之臂'] = {
                ['可换地图'] = {
                    ['岩石之乡-中间-跳跃2'] = { x = 7105.0, y = 8762.0, z = -2532,key_call = 'KEY_G',wait_time = 1 },--false
                }
            },
            ['托托克之首-下'] = {
                ['可换地图'] = {
                    ['托托克之首-升降-中间2'] = { x = 14324.0, y = 15853.0, z = -466,wait_time = 1,['操作'] = { res_id = 0x10CE59,type = 15,action = 4 }, },--false
                    ['托托克之首-上'] = { x = 15176.0, y = 20608.0, z = -484,key_call = 'KEY_G',wait_time = 10 },--false
                }
            },
            ['托托克之首-上'] = {
                ['可换地图'] = {
                    ['托托克之首-下'] = { x = 15439.0, y = 20796.0, z = 542,key_call = 'KEY_G',wait_time = 2 },--false
                    ['托托克之肩'] = { x = 26701.0, y = 17619.0, z = 536,key_call = 'KEY_G',wait_time = 6  },--false
                },
            },
            ['托托克之肩'] = {
                ['可换地图'] = {
                    ['托托克之首-上'] = { x = 27003.0, y = 17399.0, z = 1050,key_call = 'KEY_G',wait_time = 1 },--false
                    ['托托克之肩-中区'] = { x = 23305.0, y = 13423.0, z = 914,key_call = 'KEY_G',wait_time = 1  },--false
                },
            },
            ['托托克之肩-中区'] = {
                ['可换地图'] = {
                    ['托托克之肩'] = { x = 23647.0, y = 13467.0, z = 657,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
        },

        ['音之森'] = {
            ['音之森-全图'] = {
                ['所属大陆'] = '音之森',
                ['可换地图'] = {
                    ['音之森-左上2'] = { x = -6307.0, y = 14677.0, z = 2499,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['音之森-左上2'] = {
                ['所属大陆'] = '音之森',
                ['可换地图'] = {
                    ['音之森-全图'] = { x = -6061.0, y = 15021.0, z = 3009,key_call = 'KEY_G',wait_time = 1 },--false
                    ['音之森-左上1'] = { x = -5654.0, y = 14751.0, z = 3011,key_call = 'KEY_G',wait_time = 4 },--false
                },
            },
            ['音之森-左上1'] = {
                ['所属大陆'] = '音之森',
                ['可换地图'] = {
                    ['音之森-左上2'] = { x = -5374.0, y = 14748.0, z = 3522,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
        },

        ['薄暮之雾'] = {
            ['全图'] = {
                ['所属大陆'] = '薄暮之雾',
                ['可换地图'] = {
                    ['阿郎'] = { x = 22753.0, y = 16749.0, z = 1279,key_call = 'KEY_G',wait_time = 6 },--false
                },
            },
            ['阿郎'] = {
                ['所属大陆'] = '薄暮之雾',
                ['可换地图'] = {
                    ['全图'] = { x = 22944.0, y = 16903.0, z = 1804,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['云峡-上'] = {
                ['所属大陆'] = '薄暮之雾',
                ['可换地图'] = {
                    ['全图'] = { x = 16101.0, y = 13421.0, z = 1030,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
        },

        ['贫瘠通道'] = {
            ['卢芬港'] = {
                ['所属大陆'] = '贫瘠通道',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['卢芬港-升降机'] = { x = -21608.0, y = 9525.0, z = 761,wait_time = 1,['操作'] = { res_id = 0xFE6B5,type = 15,action = 4 }, },--false
                },
            },
            ['卢芬港-升降机'] = {
                ['所属大陆'] = '贫瘠通道',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['卢芬港'] = { x = -21610.0, y = 9344.0, z = 673,break_h = 100 },--false
                    ['研究营地'] = { x = -21638.0, y = 10393.0, z = 1645 },--false
                },
            },
            ['研究营地'] = {
                ['所属大陆'] = '贫瘠通道',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['卢芬港-升降机'] = { x = -21630.0, y = 10206.0, z = 1645,wait_time = 1,['操作'] = { res_id = 0xFE6B5,type = 15,action = 4 }, },--false
                    ['哨所-升降机'] = { x = -9766.0, y = 12873.0, z = 1309,wait_time = 1,['操作'] = { res_id = 0xFE6B7,type = 15,action = 4 },break_h = 50 },--false
                    ['营地-升降机'] = { x = -21585.0, y = 23797.0, z = 1510,wait_time = 1,['操作'] = { res_id = 0xFE6B6,type = 15,action = 4 },break_h = 50 },--false
                    ['东北-升降机'] = { x = -6277.0, y = 25956.0, z = 1959,wait_time = 1,['操作'] = { res_id = 0xFE6B8,type = 15,action = 4 },break_h = 50 },--false
                },
            },
            ['哨所-升降机'] = {
                ['所属大陆'] = '贫瘠通道',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['研究营地'] = { x = -9941.814453125, y = 12903.61328125, z = 1245,break_h = 100 },--false
                    ['西北区域'] = { x = -8942.0, y = 12847.0, z = 2628 },--false
                },
            },
            ['营地-升降机'] = {
                ['所属大陆'] = '贫瘠通道',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['研究营地'] = { x = -21646.89453125, y = 23843.95703125, z = 1510 },--false
                    ['营地-右上'] = { x = -20647.298828125, y = 23799.51953125, z = -157,break_h = 120 },--false
                },
            },
            ['东北-升降机'] = {
                ['所属大陆'] = '贫瘠通道',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['研究营地'] = { x = -6264.0, y = 25809.0, z = 1893,break_h = 110 },--false
                    ['东北区'] = { x = -6282.0, y = 26744.0, z = 2905,break_h = 50 },--false
                },
            },
            ['营地-右上'] = {
                ['所属大陆'] = '贫瘠通道',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['营地-升降机'] = { x = -20875.0, y = 23884.0, z = -60,wait_time = 1,['操作'] = { res_id = 0xFE6B6,type = 15,action = 4 }, },--false
                },
            },
            ['西北区域'] = {
                ['所属大陆'] = '贫瘠通道',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['哨所-升降机'] = { x = -9032.0, y = 12860.0, z = 2628,wait_time = 1,['操作'] = { res_id = 0xFE6B7,type = 15,action = 4 }, },--false
                },
            },
            ['东北区'] = {
                ['所属大陆'] = '贫瘠通道',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['东北-升降机'] = { x = -6295.0, y = 26622.0, z = 2910,wait_time = 1,['操作'] = { res_id = 0xFE6B8,type = 15,action = 4 }, },--false
                },
            },
        },

        ['分裂之地'] = {
            ['斯特恩入口'] = {
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['单轨1'] = { x = 4700.0, y = 9714.0, z = 2414,wait_time = 1,['操作'] = { res_id = 0xFE719,type = 15,action = 4 }, },--false
                },
            },
            ['单轨1'] = {
                ['所属大陆'] = '分裂之地',
                ['移动类型'] = '移动',-- 升降/移动
                ['可换地图'] = {
                    ['斯特恩入口'] = { x = 4588.0, y = 9721.0, z = 2414 },--false
                    ['主区'] = { x = 8421.0, y = 9711.0, z = 1612 },--false
                },
            },
            ['主区'] = {
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['单轨1'] = { x = 8308.0, y = 9713.0, z = 1612,wait_time = 1,['操作'] = { res_id = 0xFE719,type = 15,action = 4 }, },--false
                    ['升降机'] = { x = 13267.0, y = 7620.0, z = 1636,wait_time = 1,['操作'] = { res_id = 0xFE71B,type = 15,action = 4 }, },--false
                },
            },
            ['升降机'] = {
                ['所属大陆'] = '分裂之地',
                ['移动类型'] = '升降',-- 升降/移动
                ['可换地图'] = {
                    ['主区'] = { x = 13129.0, y = 7691.0, z = 1636 },--false
                    ['法力中继站-左'] = { x = 13851.0, y = 7010.0, z = 2331 },--false
                },
            },
            ['法力中继站-左'] = {
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['升降机'] = { x = 13726.0, y = 7168.0, z = 2337,wait_time = 1,['操作'] = { res_id = 0xFE71B,type = 15,action = 4 }, },--false
                    ['单轨2'] = { x = 17031.0, y = 5823.0, z = 2398,wait_time = 1,['操作'] = { res_id = 0xFE71C,type = 15,action = 4 }, },--false
                },
            },
            ['单轨2'] = {
                ['所属大陆'] = '分裂之地',
                ['移动类型'] = '移动',-- 升降/移动
                ['可换地图'] = {
                    ['法力中继站-左'] = { x = 16778.0, y = 5766.0, z = 2407,break_m = 600 },--false
                    ['动力控制站'] = { x = 20741.0, y = 5814.0, z = 1610 },--false
                },
            },
            ['动力控制站'] = {
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['单轨2'] = { x = 20594.0, y = 5799.0, z = 1610,wait_time = 1,['操作'] = { res_id = 0xFE71C,type = 15,action = 4 }, },--false
                },
            },
        },

        ['清风丘陵'] = {
            ['清风丘陵半圆'] = {
                ['所属大陆'] = '清风丘陵',
                ['可换地图'] = {
                    ['清风丘陵小右'] = { x = 3211.0, y = 9042.0, z = 1023.1593017578, key_call = 'KEY_G', wait_time = 6 }, --false
                    ['清风丘陵小左'] = { x = 2629.0, y = 4639.0, z = 1023.9998779297, key_call = 'KEY_G', wait_time = 6 }, --false
                    ['清风丘陵大板块'] = { x = 3113.0, y = 2965.0, z = 1016.1015625, key_call = 'KEY_G', wait_time = 6 }, --false

                },

            },
            ['清风丘陵小左'] = {
                ['所属大陆'] = '清风丘陵',
                ['可换地图'] = {
                    ['清风丘陵半圆'] = { x = 2732.1496582031, y = 4704.9721679688, z = 2025.0, key_call = 'KEY_G', wait_time = 6 }, --false
                    ['清风丘陵圆环'] = { x = 3871.0, y = 5776.0, z = 2059.7360839844, key_call = 'KEY_G', wait_time = 6 }, --false
                },
            },

            ['清风丘陵圆环'] = {
                ['所属大陆'] = '清风丘陵',
                ['可换地图'] = {
                    ['清风丘陵小右'] = { x = 5397.0, y = 9398.0, z = 1534.8937988281, key_call = 'KEY_G', wait_time = 6 }, --false
                },
            },
            ['清风丘陵小右'] = {
                ['所属大陆'] = '清风丘陵',
                ['可换地图'] = {
                    ['清风丘陵圆环'] = {  x = 4280.6284179688, y = 9392.9853515625, z = 1532.0, key_call = 'KEY_G', wait_time = 6 }, --false
                    ['清风丘陵半圆'] = {  x = 3397.0, y = 9085.0, z = 1534.2655029297, key_call = 'KEY_G', wait_time = 6 }, --false
                },
            },
            ['清风丘陵大板块'] = {
                ['所属大陆'] = '清风丘陵',
                ['可换地图'] = {
                    ['清风丘陵半圆'] = {  x = 3710.8371582031, y = 2744.1303710938, z = 1016.0, key_call = 'KEY_G', wait_time = 6 }, --false
                }
            },
        },

        ['丽泽瀑布'] = {
            ['丽泽瀑布大'] = {
                ['所属大陆'] = '丽泽瀑布',
                ['可换地图'] = {
                    ['丽泽瀑布小'] = { x = 2093.44140625, y = 22012.04296875, z = 2177.0, key_call = 'KEY_G', wait_time = 6 }, --false
                },
            },
            ['丽泽瀑布小'] = {
                ['所属大陆'] = '丽泽瀑布',
                ['可换地图'] = {
                    ['丽泽瀑布大'] = { x = 1778.0, y = 21910.0, z = 2181.9995117188, key_call = 'KEY_G', wait_time = 6 }, --false

                },
            }
        },

        ['佩斯纳尔高原'] = {
            ['佩斯纳尔高原大部分'] = {
                ['所属大陆'] = '佩斯纳尔高原',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['佩斯纳尔高原上小'] = { x = 25099.0, y = 16800.0, z = 4747.1025390625,key_call = 'KEY_G',wait_time = 3 },--false
                    ['佩斯纳尔高原中小'] = { x = 11342.017578125, y = 12345.434570312, z = 3975.4753417969,key_call = 'KEY_G',wait_time = 3 },--false
                    --['佩斯纳尔高原最上方'] = { x = 23846.0, y = 22263.0, z = 2482.78515625,wait_time = 3 },--false
                },
            },
            ['佩斯纳尔高原中小'] = {
                ['所属大陆'] = '佩斯纳尔高原',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['佩斯纳尔高原大部分'] = { x = 11070.0, y = 12350.0, z = 3464.9995117188,key_call = 'KEY_G',wait_time = 6 },--false
                },
            },
            ['佩斯纳尔高原上小'] = {
                ['所属大陆'] = '佩斯纳尔高原',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['佩斯纳尔高原大部分'] = { x = 25396.0, y = 17195.0, z = 4489.9995117188,key_call = 'KEY_G',wait_time = 5 },--false
                    ['佩斯纳尔高原最上方'] = { x = 25045.0, y = 18254.0, z = 4487.4951171875,key_call = 'KEY_G',wait_time = 3 },--false
                },
            },
            ['佩斯纳尔高原最上方'] = {
                ['所属大陆'] = '佩斯纳尔高原',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['佩斯纳尔高原上小'] = { x = 24618.0, y = 18435.0, z = 4232.9995117188,key_call = 'KEY_G',wait_time = 6 },--false
                },
            },
        },

        ['涅贝霍恩'] = {
            ['涅贝霍恩正下方'] = {
                ['所属大陆'] = '涅贝霍恩',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['涅贝霍恩大部分'] = { x = -25442.0, y = 4678.0, z = 1536.0, key_call = 'KEY_G', wait_time = 10 }, --false
                },
            },
            ['涅贝霍恩大部分'] = {
                ['所属大陆'] = '涅贝霍恩',
                ['可换地图'] = {
                    ['涅贝霍恩中间升降机'] = { x = -19098.0, y = 17811.0, z = 3035, wait_time = 1, ['操作'] = { res_id = 0xFE77D, type = 15, action = 4 }, }, --false
                    ['涅贝霍恩正下方'] = { x = -25234.208984375, y = 4618.2685546875, z = 2563.4262695312, key_call = 'KEY_G', wait_time = 2 }, --false
                },
            },
            ['涅贝霍恩中间'] = {
                ['所属大陆'] = '涅贝霍恩',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['涅贝霍恩中间升降机'] = { x = -18451.0, y = 17774.0, z = 6426.9194335938, wait_time = 1, ['操作'] = { res_id = 0xFE77D, type = 15, action = 4 }, }, --false
                },
            },
            ['涅贝霍恩中间升降机'] = {
                ['所属大陆'] = '涅贝霍恩',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['涅贝霍恩中间'] = { x = -18243.0, y = 17796.0, z = 6405.7680664062 }, --false
                    ['涅贝霍恩大部分'] = { x = -19696.390625, y = 17781.140625, z = 2858.0415039062 }, --false
                },
            },
        },

        ['巴兰卡山脉'] = {
            ['巴兰卡山脉-左边'] = {
                ['所属大陆'] = '巴兰卡山脉',
                ['可换地图'] = {
                    ['巴兰卡山脉-平移机'] = { x = 19807, y = 10043, z = 519, wait_time = 1, ['操作'] = { res_id = 0x10F5CD, type = 15, action = 4 }, }, --false
                },
            },
            ['巴兰卡山脉-右边'] = {
                ['所属大陆'] = '巴兰卡山脉',
                ['可换地图'] = {
                    ['巴兰卡山脉-平移机'] = { x = 16107, y = 10041, z = 775, wait_time = 1, ['操作'] = { res_id = 0x10F5CD, type = 15, action = 4 }, }, --false
                },
            },
            ['巴兰卡山脉-平移机'] = {
                ['所属大陆'] = '巴兰卡山脉',
                ['移动类型'] = '移动', -- 升降/移动
                ['可换地图'] = {
                    ['巴兰卡山脉-右边'] = { x = 16107, y = 10041, z = 775, break_m = 600 }, --false
                    ['巴兰卡山脉-左边'] = { x = 19807, y = 10043, z = 519, break_m = 600 }, --false
                },
            },
        },
        ['摩可可村'] = {
            ['主区'] = {
                ['可换地图'] = {
                    ['村长家'] = { x = 8362.0, y = 5682.0, z = 499 },--true
                },
            },
            ['村长家'] = {
                ['可换地图'] = {
                    ['主区'] = { x = 8325.572265625, y = 5723.3266601562, z = -5106 },--true
                },
            },
        },
        ['丰饶森林'] = {
            ['丰饶森林-门口'] = {
                ['所属大陆'] = '丰饶森林',
                ['可换地图'] = {
                    ['丰饶森林-升降机'] = { x = 3711.0, y = 2010.0, z = 1286.1599121094, wait_time = 1, ['操作'] = { res_id = 0x10CD91, type = 15, action = 4 }, }, --false
                },
            },
            ['丰饶森林-升降机'] = {
                ['所属大陆'] = '丰饶森林',
                ['移动类型'] = '升降', -- 升降/移动
                ['可换地图'] = {

                    ['丰饶森林-门口'] = { x = 3711.0, y = 2010.0, z = 1286.1599121094, wait_time = 1,break_h = 50 }, --false
                    ['丰饶森林-大板块'] = { x = 3259.0, y = 2350.0, z = 198.99975585938, wait_time = 1,break_h = 50 }, --false
                },
            },
            ['丰饶森林-大板块'] = {
                ['所属大陆'] = '丰饶森林',
                ['可换地图'] = {
                    ['丰饶森林-升降机'] = { x = 3259.0, y = 2350.0, z = 198.99975585938, wait_time = 1, ['操作'] = { res_id = 0x10CD91, type = 15, action = 4 }, }, --false
                    ['丰饶森林-副本小路'] = { x = 25148.0, y = 20275.0, z = 950.66021728516, key_call = 'KEY_G', wait_time = 5 }, --false
                    -- ['丰饶森林-山林路'] = { x = 24244.982421875, y = 11944.935546875, z = 909.99987792969, key_call = 'KEY_G', wait_time = 13 }, --false
                },
            },
            ['丰饶森林-山林路'] = {
                ['所属大陆'] = '丰饶森林',
                ['可换地图'] = {
                    --   ['丰饶森林-大板块'] = { x = 24339.0, y = 12149.0, z = 1932.9537353516, key_call = 'KEY_G', wait_time = 3 }, --false
                    ['丰饶森林-副本小路'] = { x = 26500.0, y = 20097.0, z = 1937.6000976562, key_call = 'KEY_G', wait_time = 2 }, --false
                },
            },

            ['丰饶森林-副本门口'] = {
                ['所属大陆'] = '丰饶森林',
                ['可换地图'] = {
                --    ['丰饶森林-副本小路'] = { x = 25776.0, y = 26726.0, z = 399.39324951172, key_call = 'KEY_G', wait_time = 5 }, --false
                },
            },

            --
            ['丰饶森林-副本小路'] = {
                ['所属大陆'] = '丰饶森林',
                ['可换地图'] = {
                    ['丰饶森林-副本门口'] = { x = 25188.0, y = 24980.0, z = 1428.2873535156, key_call = 'KEY_G', wait_time = 3 }, --false
                    ['丰饶森林-山林路'] = { x = 26338.0, y = 20184.0, z = 1423.9998779297, key_call = 'KEY_G', wait_time = 4 }, --false
                    ['丰饶森林-大板块'] = { x = 25417.0, y = 20254.0, z = 1425.6000976562, key_call = 'KEY_G', wait_time = 2 }, --false
                },
            },

        },

        ['赤红沙漠'] = {
            ['赤红沙漠中'] = {
                ['所属大陆'] = '赤红沙漠',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['赤红沙漠左'] = { x = 11167.784179688, y = 8018.7084960938, z = -501.34161376953,key_call = 'KEY_G',wait_time = 5 },--false
                    ['赤红沙漠下'] = { x = 7977.0, y = 9351.0, z = -548.01513671875,key_call = 'KEY_G',wait_time = 10 },--false
                    ['赤红沙漠右'] = { x = 6746.0, y = 12471.0, z = -506.92993164062,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
            ['赤红沙漠右'] = {
                ['所属大陆'] = '赤红沙漠',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['赤红沙漠上'] = { x = 9168.5244140625, y = 14172.064453125, z = 1.9999313354492,key_call = 'KEY_G',wait_time = 5 },--false
                    -- ['赤红沙漠中'] = { x = 6387.0, y = 12668.0, z = 12.287246704102,key_call = 'KEY_G',wait_time = 5 },--false
                    ['赤红沙漠下'] = { x = 3845.8669433594, y = 13163.049804688, z = 2.7720947265625,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['赤红沙漠左'] = {
                ['所属大陆'] = '赤红沙漠',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['赤红沙漠上'] = { x = 12854.0, y = 7275.0, z = 2,key_call = 'KEY_G',wait_time = 5 },--false
                    -- ['赤红沙漠中'] = { x = 11349.0, y = 7679.0, z = 12,key_call = 'KEY_G',wait_time = 5 },--false
                    ['赤红沙漠下'] = { x = 8857.0, y = 4123.0, z = 20,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
            ['赤红沙漠上'] = {
                ['所属大陆'] = '赤红沙漠',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    ['赤红沙漠右'] = { x = 9374.0, y = 14169.0, z = 519.0,key_call = 'KEY_G',wait_time = 3 },--false
                    -- ['赤红沙漠中'] = { x = 10919.0, y = 12160.0, z = 518.0,key_call = 'KEY_G',wait_time = 5 },--false
                    ['赤红沙漠左'] = { x = 13018.0, y = 7311.0, z = 513,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['赤红沙漠下'] = {
                ['所属大陆'] = '赤红沙漠',
                ['可换地图'] = {
                    -- x,y,z为等待移动目标的位置 操作为 移动目标的信息 读取到目标信息后移动到目标中心坐标
                    -- ['赤红沙漠中'] = { x = 7152.0, y = 8521.0, z = -552.0,key_call = 'KEY_G',wait_time = 10 },--false
                    ['赤红沙漠右'] = { x = 3640.0, y = 13178.0, z = -512.0,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
        },

        ['海上乐园佩托'] = {
            ['所属大陆'] = '海上乐园佩托',
            ['码头'] = {
                ['可换地图'] = {
                    ['船上甲板'] = { x = 8223.087890625, y = -6241.6328125, z = 143 },--true
                    ['造船厂'] = { x = 7637.5297851562, y = -9662.513671875, z = 495 },--true
                },
            },
            ['造船厂'] = {
                ['可换地图'] = {
                    ['码头'] = { x = -8192.67578125, y = 5893.9350585938, z = -351 },--true
                },
            },
            ['船上甲板'] = {
                ['可换地图'] = {
                    ['码头'] = { x = 29535.0, y = 4370.0, z = 183 },--false
                    ['商业街'] = { x = 25693.19140625, y = 2109.5754394531, z = 126 },--true
                },
            },
            ['商业街'] = {
                ['可换地图'] = {
                    ['船上甲板'] = { x = 5507.0, y = 7363.0, z = -6 },--false
                    ['冰室'] = { x = 7339.1606445312, y = 13192.393554688, z = 367 },--true
                },
            },
            ['冰室'] = {
                ['可换地图'] = {
                    ['商业街'] = { x = -8829.6767578125, y = -4780.8979492188, z = -640 },--true
                    ['船长室'] = { x = -8139.5776367188, y = -8983.98046875, z = 25 },--true
                },
            },
            ['船长室'] = {
                ['可换地图'] = {
                    ['冰室'] = { x = -1376.5476074219, y = 17208.189453125, z = -291 },--true
                },
            },
        },

        ['熊猫扑扑岛'] = {
            ['所属大陆'] = '熊猫扑扑岛',
            ['主区'] = {
                ['可换地图'] = {
                    ['峭壁1'] = { x = 5341, y = 5042, z = 481,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['峭壁1'] = {
                ['可换地图'] = {
                    ['主区'] = { x = 5042, y = 4375, z = 484,key_call = 'KEY_G',wait_time = 2 },--false
                    ['峭壁2'] = { x = 4224, y = 4117, z = 490,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['峭壁2'] = {
                ['可换地图'] = {
                    ['峭壁1'] = { x = 3891, y = 4313, z = 215,key_call = 'KEY_G',wait_time = 2 },--false
                    ['峭壁3'] = { x = 3695, y = 3974, z = 224,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['峭壁3'] = {
                ['所属大陆'] = '熊猫扑扑岛',
                ['可换地图'] = {
                    ['峭壁2'] = { x = 3467, y = 3630, z = 226,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
        },

        ['黄昏岛'] = {
            ['所属大陆'] = '黄昏岛',
            ['主岛'] = {
                ['可换地图'] = {
                    ['旅店'] = { x = 8477.0, y = 10753.0, z = 797 },--false
                    ['右塔顶'] = { x = 3674, y = 7439, z = 260,key_call = 'KEY_G',wait_time = 5 },--false
                    ['左塔中'] = { x = 8513, y = 5998, z = 511,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['左塔中'] = {
                ['可换地图'] = {
                    ['左塔顶'] = { x = 8974, y = 6420, z = 762,key_call = 'KEY_G',wait_time = 6 },--false
                    ['主岛'] = { x = 8818, y = 6167, z = 762,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['左塔顶'] = {
                ['可换地图'] = {
                    ['左塔中'] = { x = 9052, y = 6278, z = 1273,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['右塔顶'] = {
                ['可换地图'] = {
                    ['主岛'] = { x = 3512, y = 7643, z = 772,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['旅店'] = {
                ['可换地图'] = {
                    ['主岛'] = { x = -9268.455078125, y = -15686.39453125, z = -24378 },--true
                },
            },
        },

        ['梦想海鸥岛'] = {
            ['所属大陆'] = '梦想海鸥岛',
            ['大区1'] = {
                ['可换地图'] = {
                    ['小区1'] = { x = 7627, y = 5382, z = 263,key_call = 'KEY_G',wait_time = 2 },--false
                },
            },
            ['大区2'] = {
                ['可换地图'] = {
                    ['大区1'] = { x = 8816, y = 10865, z = 527,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
            ['小区1'] = {
                ['可换地图'] = {
                    ['大区1'] = { x = 7560, y = 5051, z = 260,key_call = 'KEY_G',wait_time = 2 },--false
                    ['小区2'] = { x = 7507, y = 4558, z = 258,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
            ['小区2'] = {
                ['可换地图'] = {
                    ['大区1'] = { x = 7732, y = 4551, z = 772,wait_time = 2 },--false
                    ['大区2'] = { x = 8594, y = 4444, z = 783,key_call = 'KEY_G',wait_time = 5 },--false
                },
            },
        },

        ['黑牙驻地'] = {
            ['所属大陆'] = '黑牙驻地',
            ['主岛'] = {
                ['可换地图'] = {
                    ['中岛'] = { x = 3011, y = 5460, z = 119,key_call = 'KEY_G',wait_time = 1 },--false
                    ['黑牙的家'] = { x = 5798.0, y = 4276.0, z = 285 },--true
                },
            },
            ['左上岛'] = {
                ['可换地图'] = {
                    ['上岛'] = { x = 3662, y = 6306, z = 141,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['上岛'] = {
                ['可换地图'] = {
                    ['中岛'] = { x = 2897, y = 6757, z = 154,key_call = 'KEY_G',wait_time = 1 },--false
                    ['左上岛'] = { x = 3165, y = 6780, z = 141,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['中岛'] = {
                ['可换地图'] = {
                    ['主岛'] = { x = 2626, y = 5483, z = 136,key_call = 'KEY_G',wait_time = 1 },--false
                    ['下岛'] = { x = 2317, y = 5527, z = 147,key_call = 'KEY_G',wait_time = 1 },--false
                    ['上岛'] = { x = 2468, y = 6307, z = 145,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['下岛'] = {
                ['可换地图'] = {
                    ['中岛'] = { x = 2267, y = 5266, z = 144,key_call = 'KEY_G',wait_time = 1 },--false
                },
            },
            ['黑牙的家'] = {
                ['可换地图'] = {
                    ['主岛'] = { x = -2134.1965332031, y = -16306.881835938, z = -71 },--true
                },
            },
        },

        ['智慧岛'] = {
            ['所属大陆'] = '智慧岛',
            ['主岛'] = {
                ['可换地图'] = {

                    ['图书馆一层'] = { x = 4399.279296875, y = 4988.3383789062, z = 110 },--true
                },
            },
            ['图书馆一层'] = {
                ['可换地图'] = {
                    ['图书馆二层'] = { x = 5145.951171875, y = 5174.640625, z = -14547 },--true
                    ['主岛'] = { x = 2236.0744628906, y = 4837.4838867188, z = -14209 },--true
                },
            },
            ['图书馆二层'] = {
                ['可换地图'] = {
                    ['图书馆一层'] = { x = 2785.2329101562, y = 1084.7810058594, z = -13993 },--true
                },
            },
        },
    },
    -- 指定地图的资源 划分区域
    map_area_info = {
        ['冰蝶峭壁'] = {
            { name = '冰蝶峭壁-右边',
              area = {
                  --右上
                  { x = 26530.0, y = 24964.0 + 1000 },
                  { x = 25442.0, y = 25325.0 + 1000 },
                  { x = 22726.0, y = 25442.0 + 1000 },
                  { x = 7271.0, y = 22265.0 + 1000 },
                  { x = 7008.0, y = 22274.0 + 1000 },
                  --右下
                  { x = 7008.0 - 1000, y = 22274.0 },
                  { x = 5741.0 - 1000, y = 19017.0 },
                  { x = 5397.0 - 1000, y = 16284.984375 },
                  { x = 5285.0 - 1000, y = 14861.237304688 },
                  --正下
                  { x = 5285.0 - 100, y = 14861.0 - 100 },
                  --右下
                  { x = 6071.0 - 100, y = 13727.0 },
                  { x = 6564.0 - 100, y = 12786.0 },
                  --正下
                  { x = 6564.0 - 50, y = 12786.0 - 50 },
                  { x = 6487.0 - 20, y = 12651.0 - 20 }, --false
                  --左下
                  { x = 6569.0, y = 12660.0 - 20 },
                  { x = 6946.0, y = 12638.0 - 20 },
                  --正左
                  { x = 6946.0 + 50, y = 12638.0 - 50 },
                  --左上
                  { x = 6946.0 + 100, y = 12638.0 },
                  { x = 8194.0 + 100, y = 13931.0 },
                  { x = 8507.0 + 100, y = 15654.284179688 },
                  { x = 10120.0 + 100, y = 17104.0 },
                  --右下
                  { x = 14315.0 - 100, y = 16211.0 },
                  --正下
                  { x = 14315.0 - 50, y = 16211.0 - 50 },
                  --左下
                  { x = 14315.0, y = 16211.0 - 50 },
                  { x = 14485.0, y = 16211.0 - 50 },
                  { x = 14621.633789062, y = 16248.0 - 50 },
                  { x = 14665.0, y = 16240.0 - 20 }, --false
                  { x = 14771.0, y = 16393.0 - 50 },
                  --正左
                  { x = 14771.0 + 50, y = 16393.0 - 50 },
                  --左上
                  { x = 14749.0 + 50, y = 16703.04296875 },
                  { x = 14955.0 + 50, y = 17009.19140625 },
                  { x = 15120.0 + 50, y = 17481.0 },
                  { x = 15199.0 + 50, y = 18145.85546875 },
                  --左下
                  { x = 16418.43359375, y = 17836.0 - 50 },
                  { x = 16713.0, y = 18179.0 - 50 },
                  --正左
                  { x = 16713.0 + 50, y = 18179.0 - 50 },
                  --左上
                  { x = 16713.0 + 50, y = 18179.0 },
                  { x = 16700.0 + 50, y = 18272.6953125 },
                  { x = 16660.0 + 50, y = 18477.0 },
                  --正上
                  { x = 16660.0 + 50, y = 18477.0 + 50 },
                  { x = 16244.0 + 50, y = 18968.0 + 50 },
                  --左下
                  { x = 17870.0, y = 20835.0 - 100 },
                  { x = 18895.388671875, y = 20591.0 - 100 },
                  { x = 19987.0, y = 20090.0 - 100 },
                  { x = 22354.0, y = 20448.0 - 100 },
                  { x = 22672.892578125, y = 20307.0 - 100 },
                  { x = 23521.78515625, y = 20695.0 - 100 },
                  --左上
                  { x = 23510.0 + 100, y = 20694.0 },
                  { x = 23738.0 + 100, y = 21222.0 },
                  { x = 23901.0 + 100, y = 21641.96875 },
                  { x = 23903.0 + 100, y = 22481.0 },
                  { x = 26530.0 + 100, y = 24770.0 },
                  { x = 26530.0 + 100, y = 24964.0 },
              },
              min_cz = -10,
            },
            { name = '冰蝶峭壁-中间',
              area = {
                  --正上
                  { x = 23961.0 + 10000, y = 3744.0 + 10000 },
                  { x = 24224.0 + 10000, y = 17023.0 + 10000 },
                  { x = 22675.0 + 500, y = 18792.0 + 500 },
                  --右上
                  { x = 22674.830078125, y = 18794.0 + 500 },
                  { x = 20328.3125, y = 18322.0 + 500 },
                  { x = 16875.373046875, y = 18842.0 + 500 },
                  --正右
                  { x = 16871.0 - 50, y = 18854.0 + 50 },
                  --右下
                  { x = 16810.0 - 20, y = 18809.0 },
                  { x = 16722.0 - 20, y = 18502.7734375 },
                  { x = 16786.0 - 20, y = 18194.0 },
                  { x = 16797.0 - 20, y = 18051.0 },

                  { x = 16901.0 - 50, y = 16892.109375 },
                  { x = 16768.0 - 200, y = 14669.134765625 },
                  --正上
                  { x = 16168.0 + 100, y = 11115.0 + 100 },
                  { x = 15462.0 + 100, y = 11873.0 + 100 },
                  --右上
                  { x = 15462.12890625, y = 11873.0 + 100 },
                  { x = 15112.2734375, y = 11855.0 + 100 },
                  { x = 13857.80859375, y = 11167.0 + 100 },
                  --左上
                  { x = 11193.0 + 500, y = 12731.973632812 },
                  { x = 10577.0 + 500, y = 14238.592773438 },
                  --右上
                  { x = 10577.224609375, y = 14238.0 + 500 },
                  { x = 10318.0, y = 14356.0 + 500 },
                  --右下
                  { x = 10318.0 - 500, y = 14356.0 },
                  { x = 10085.0 - 500, y = 13865.0 },
                  { x = 9392.0 - 500, y = 12467.0 },
                  { x = 8925.0 - 500, y = 10306.563476562 },
                  { x = 9112.0 - 500, y = 5637.2177734375 },
                  --左下
                  { x = 9112.1962890625, y = 5637.0 - 500 },
                  { x = 10366.0, y = 5020.0 - 500 },
                  { x = 11647.96875, y = 4487.0 - 500 },
                  --正左
                  { x = 11647.0 + 100, y = 4487.0 - 100 },
                  { x = 12460.0 + 100, y = 4624.0 - 100 },
                  --左下
                  { x = 15036.401367188, y = 5404.0 - 20 },
                  { x = 15255.0, y = 5400.0 - 20 },
                  { x = 15409.94140625, y = 5556.0 - 20 },
                  --正左
                  { x = 15409.0 + 20, y = 5556.0 - 20 },
                  { x = 15558.0 + 100, y = 6051.0 - 100 },
                  { x = 18137.0 + 200, y = 6295.0 - 200 },
                  --正下
                  { x = 20610.0 - 300, y = 6655.0 - 300 },
                  { x = 20818.0 - 300, y = 6124.0 - 300 },
                  { x = 20977.0 - 300, y = 4515.0 - 300 },
                  { x = 23605.0 - 300, y = 3288.0 - 300 },
                  --左下
                  { x = 23605.0, y = 3288.0 - 300 },
                  --正左

                  { x = 23605.0 + 300, y = 3288.0 - 300 },
                  { x = 23605.0 + 8000, y = 3288.0 - 300 },
              }
            },
            { name = '冰蝶峭壁-左一',
              area = {
                  -- 左上
                  { x = 15974.0 + 500, y = 3462.9609375 },
                  { x = 15940.0 + 500, y = 5191.0693359375 },
                  --正上
                  { x = 15940.0 + 100, y = 5191.0 + 100 },
                  { x = 15816.0 + 100, y = 5332.0 + 100 },
                  --右上
                  { x = 15816.926757812, y = 5332.0 + 50 },
                  { x = 15511.568359375, y = 5244.0 + 50 },
                  { x = 15303.0, y = 5313.0 + 50 },
                  { x = 15022.0, y = 5284.0 + 50 },
                  --正右
                  { x = 15022.0 - 50, y = 5284.0 + 50 },
                  --右下
                  { x = 14841.0 - 500, y = 4871.0 },
                  { x = 14888.0 - 500, y = 3981.0 - 500 },
                  { x = 15539.0 - 50, y = 3419.0 - 50 },
                  --左下
                  { x = 15539.0, y = 3419.0 - 50 },
                  { x = 15664.506835938, y = 3303.0 - 50 },
                  { x = 15970.223632812, y = 3448.0 - 50 },


              }
            },
            { name = '冰蝶峭壁-左二',
              area = {
                  --左上
                  { x = 19869.0 + 500, y = 2171.28125 },
                  { x = 19945.0 + 500, y = 3321.0 },
                  { x = 19960.0 + 500, y = 3805.2307128906 },
                  --正上
                  { x = 19831.0 + 500, y = 4188.0 + 500 },
                  { x = 19385.0 + 500, y = 4661.0 + 500 },
                  { x = 18940.0 + 500, y = 4935.0 + 500 },
                  --右上
                  { x = 18940.0, y = 4935.0 + 200 },
                  { x = 17852.154296875, y = 4012.0 + 200 },
                  { x = 16602.0, y = 3345.0 + 200 },

                  { x = 16353.154296875, y = 3279.0 + 50 },
                  { x = 16038.077148438, y = 3164.0 + 50 },
                  { x = 15803.0, y = 3243.0 + 50 },
                  { x = 15546.345703125, y = 3220.0 + 50 },
                  --正右
                  { x = 15546.0 - 50, y = 3220.0 + 50 },
                  { x = 15418.0 - 200, y = 2479.0 + 200 },
                  --正下
                  { x = 15418.0 - 200, y = 2479.0 - 200 },
                  --左下
                  { x = 15995.438476562, y = 2060.0 - 500 },
                  { x = 17687.23828125, y = 1801.0 - 500 },
                  { x = 19861.865234375, y = 2166.0 - 500 },

              }
            },
            { name = '冰蝶峭壁-下面',
              area = {
                  --右上
                  { x = 6883.0, y = 12558.0 + 50 },
                  { x = 6783.4658203125, y = 12594.0 + 50 },
                  { x = 6579.0, y = 12583.0 + 50 },
                  { x = 6292.9370117188, y = 12462.0 + 50 },
                  --正上
                  { x = 5646.0 + 100, y = 12628.0 + 100 },
                  { x = 5380.0 + 100, y = 12929.0 + 100 },
                  --右上
                  { x = 5380.0, y = 12929.0 + 200 },
                  { x = 4780.5249023438, y = 12728.0 + 200 },
                  { x = 4030.8723144531, y = 12024.0 + 200 },
                  --正右
                  { x = 4030.0 - 10000, y = 12024.0 + 10000 },
                  { x = 2314.0 - 10000, y = 4742.0 + 10000 },
                  --左下
                  { x = 2313.9375, y = 4742.0 - 10000 },
                  { x = 6779.7163085938, y = 4426.0 - 10000 },
                  --正左
                  { x = 6779.0 + 500, y = 4426.0 - 500 },
                  --左上
                  { x = 6780.0 + 500, y = 4426.2680664062 },
                  { x = 7249.0 + 500, y = 9106.9072265625 },
                  { x = 7533.0 + 500, y = 10047.241210938 },
                  { x = 7186.0 + 500, y = 11827.747070312 },
                  { x = 6934.0 + 500, y = 12465.579101562 },
                  --正上
                  { x = 6934.0 + 50, y = 12465.0 + 50 },
              }
            },
            { name = '冰蝶峭壁-中间小',
              area = {
                  --正左
                  { x = 15200.0 + 200, y = 13440.0 - 200 },
                  { x = 15516.0 + 200, y = 13870.0 - 200 },
                  { x = 15794.0 + 200, y = 14468.0 - 200 },
                  --左上
                  { x = 15794.0 + 200, y = 14468.0 },
                  { x = 15562.0 + 200, y = 15101.0625 },
                  { x = 15593.0 + 200, y = 15753.0 },
                  { x = 15588.0 + 200, y = 16871.0 },
                  --正右
                  { x = 15588.0 - 50, y = 16871.0 + 50 },
                  { x = 15389.0 - 50, y = 16644.0 + 50 },
                  { x = 15262.0 - 50, y = 16357.0 + 50 },
                  { x = 15121.0 - 50, y = 15923.0 + 50 },
                  --右上
                  { x = 14847.669921875, y = 15997.0 + 50 },
                  { x = 14713.611328125, y = 16136.0 + 50 },
                  { x = 14621.0625, y = 16173.0 + 50 },
                  { x = 14427.0, y = 16137.0 + 50 },
                  --正右
                  { x = 14427.0 - 50, y = 16137.0 + 50 },
                  { x = 14124.0 - 200, y = 15833.0 + 200 },
                  { x = 14126.0 - 200, y = 14609.0 + 200 },
                  { x = 14218.0 - 200, y = 14152.0 + 200 },
                  --正下
                  { x = 14218.0 - 200, y = 14152.0 - 200 },
                  { x = 15091.0 - 200, y = 13427.0 - 200 },
              },
              min_cz = -520,
            },

        },

        ['星沙海滩'] = {
            { name = '星沙海滩-大板块',
              area = {
                  --左上
                  { x = 27700.0 + 100, y = 6228.2646484375 },
                  { x = 27742.0 + 100, y = 7493.0 },
                  { x = 27712.0 + 100, y = 7824.0 },
                  --正上
                  { x = 27712.0 + 100, y = 7824.0 + 100 },
                  { x = 26459.0 + 100, y = 9143.0 + 100 },
                  { x = 22865.0 + 100, y = 22011.0 + 100 },
                  { x = 22336.0 + 100, y = 22781.0 + 100 },
                  { x = 21110.0 + 100, y = 23325.0 + 100 },
                  --正右
                  { x = 20870.0 - 100, y = 23214.0 + 100 },
                  { x = 13686.0 - 100, y = 17515.0 + 100 },
                  { x = 12214.0 - 100, y = 17161.0 + 100 },
                  { x = 8481.0 - 100, y = 15169.0 + 100 },

                  --右上
                  { x = 6956.0, y = 13001.0 + 100 },
                  --正左
                  { x = 5511.0 + 100, y = 14144.0 - 100 },
                  --左上
                  { x = 5511.0 + 100, y = 14144.0 },
                  --正上
                  { x = 5511.0 + 100, y = 14144.0 + 100 },
                  { x = 5500.0 + 100, y = 14195.0 + 100 },
                  { x = 5430.0 + 100, y = 14341.0 + 100 },
                  { x = 5015.0 + 100, y = 14632.0 + 100 },
                  --右上
                  { x = 4997.0, y = 14653.0 + 100 },
                  { x = 4813.0, y = 14620.0 + 50 },
                  { x = 4549.0, y = 14688.0 + 50 },
                  { x = 4329.9194335938, y = 14708.0 + 50, },
                  { x = 3954.7021484375, y = 14565.0 + 100 },
                  { x = 3842.0, y = 14611.0 + 100 },
                  { x = 3722.0, y = 14631.0 + 100 },
                  { x = 3576.0, y = 14659.0 + 100 },
                  --正右
                  { x = 3576.0 - 100, y = 14659.0 + 100 },
                  { x = 3277.0 - 100, y = 13917.0 + 100 },
                  --右上
                  { x = 2121.0, y = 13727.0 + 100 },
                  --正右
                  { x = 2121.0 - 100, y = 13727.0 + 100, },
                  { x = 1200.0 - 100, y = 12803.0 + 100 },
                  --右下
                  { x = 1200.0 - 100, y = 12803.831054688 },
                  { x = 949.0 - 100, y = 11941.0 },
                  { x = 303.0 - 100, y = 10796.115234375 },
                  { x = 1131.0 - 1000, y = 8980.0 },
                  { x = 1482.0 - 1000, y = 7253.3979492188 }, -----
                  --正下
                  { x = 1482.0 - 1000, y = 7253.0 - 1000 }, -----
                  { x = 1813.0 - 1000, y = 6797.0 - 1000 },
                  { x = 3655.0 - 100, y = 7547.0 - 100 },
                  { x = 4301.0 - 100, y = 7185.0 - 100 },
                  --正左
                  { x = 4358.0 + 100, y = 7215.0 - 100 },
                  --左下
                  { x = 5628.0, y = 8103.0 - 100 },
                  ------------------
                  --正左
                  { x = 5704.0 + 10, y = 8101.0 - 10 },
                  { x = 5791.0 + 10, y = 8194.0 - 10 },
                  --左下
                  { x = 5899.0, y = 8240.0 - 10 },
                  { x = 5992.0, y = 8220.0 - 10 },
                  --正下
                  { x = 6132.0 - 10, y = 8090.0 - 10 },
                  ------------------
                  --正左
                  { x = 6132.0 + 100, y = 8090.0 - 100 },
                  { x = 6179.0 + 100, y = 8560.0 - 100 },
                  { x = 7595.0 + 100, y = 10077.0 - 100 },
                  { x = 8894.0 + 100, y = 10736.0 - 100 },
                  { x = 10327.0 + 100, y = 11538.0 - 100 },
                  { x = 10890.0 + 100, y = 11575.0 - 100 },
                  --正下
                  { x = 12240.0 - 100, y = 12288.0 - 100 },
                  { x = 13072.0 - 100, y = 11990.0 - 100 },
                  { x = 14504.0 - 100, y = 11503.0 - 100 },
                  { x = 14745.0 - 100, y = 11048.0 - 100 },
                  { x = 15260.0 - 100, y = 9068.0 - 100 },
                  --右下
                  { x = 16391.0 - 100, y = 7988.0 },
                  { x = 16450.0 - 100, y = 6445.0 },
                  { x = 16510.0 - 100, y = 3330.7678222656 },
                  --正下
                  { x = 16621.0 - 100, y = 3049.0 - 100 },
                  { x = 19136.0 - 100, y = 1208.0 - 100 },
                  --左下
                  { x = 19136.0, y = 1208.0 - 100 },
                  { x = 19539.0, y = 1123.0 - 100 },
                  { x = 20325.0, y = 1261.0 - 100 },
                  { x = 21020.0, y = 1399.0 - 100 },
                  --正左
                  { x = 21850.0 + 100, y = 1514.0 - 100 },
                  { x = 24529.0 + 100, y = 2797.0 - 100 },
                  { x = 26838.0 + 100, y = 4934.0 - 100 },


              }
            },
            { name = '星沙海滩-一楼',
              area = {
                  --左上

                  { x = 6085.0 + 10, y = 14220.0 }, --false
                  { x = 6077.0 + 20, y = 14364.0 }, --false


                  { x = 6060.0 + 10, y = 14534.0 },
                  --右上
                  { x = 5981.0, y = 14586.0 + 10 },
                  { x = 5777.0, y = 14595.0 + 10 },
                  --正上
                  { x = 5777.0 + 10, y = 14595.0 + 10 },
                  { x = 5633.0 + 10, y = 14725.0 + 10 },
                  --左上
                  { x = 5633.0 + 10, y = 14725.0 },
                  { x = 5620.0 + 10, y = 14946.0 },
                  --正左
                  { x = 5620.0 + 10, y = 14946.0 - 10 },
                  { x = 5736.0 + 10, y = 15061.0 - 10 },
                  --左上
                  { x = 5736.0 + 10, y = 15061.0 },
                  { x = 5753.0 + 10, y = 15320.881835938 },
                  { x = 5720.0 + 10, y = 15544.0 },
                  --右上
                  { x = 5720.0, y = 15544.0 + 10 },
                  { x = 5635.0, y = 15540.0 + 10 },
                  { x = 5455.0, y = 15540.0 + 10 },
                  --正上
                  { x = 5389.0 + 10, y = 15552.0 + 10 },
                  --左上
                  { x = 5370.0 + 10, y = 15616.0 },
                  { x = 5364.0 + 10, y = 15747.0 },
                  -------------------------------
                  --正左
                  { x = 5386.0 + 10, y = 15827.0 - 50 },
                  { x = 5434.0 + 10, y = 15847.0 - 50 },
                  { x = 5700.0 + 50, y = 16096.0 - 50 },
                  --正上
                  { x = 5700.0 + 50, y = 16096.0 + 50 },
                  { x = 5539.0 + 50, y = 16258.0 + 50 },
                  { x = 4790.0 + 50, y = 16612.0 + 50 },
                  --正右
                  { x = 4790.0 - 50, y = 16612.0 + 50 },
                  { x = 3589.0 - 50, y = 15657.0 + 50 },
                  { x = 3434.0 - 50, y = 15471.0 + 50 },
                  --右下
                  { x = 3363.0 - 50, y = 15220.751953125 },
                  { x = 3351.0 - 50, y = 14912.0 },
                  --左下
                  { x = 3351.0, y = 14912.0 - 50 },
                  { x = 3501.0, y = 14760.0 - 50 },
                  { x = 3804.0, y = 14760.0 - 50 },
                  { x = 4119.0, y = 14888.0 - 50 },
                  { x = 4557.0, y = 14804.0 - 50 },
                  { x = 4756.0, y = 14732.0 - 50 },
                  { x = 5132.4765625, y = 14765.713867188 },
                  --正下
                  { x = 5346.0 - 50, y = 14701.0 - 50 },
                  { x = 5531.0 - 50, y = 14559.0 - 50 },
                  { x = 5653.0 - 50, y = 14423.0 - 50 },
                  --左下
                  { x = 5653.0, y = 14423.0 - 50 },
                  { x = 5911.0, y = 14346.0 - 50 },
                  { x = 6036.0, y = 14193.0 - 50 },
                  --正左
                  { x = 6036.0 + 50, y = 14193.0 - 50 },
                  { x = 6085.0 + 50, y = 14220.0 - 50 }, --false

              }
            },
            { name = '星沙海滩-二楼',
              area = {
                  --左上
                  { x = 6320.0 + 10, y = 14791.0 },
                  { x = 6333.0 + 10, y = 15470.33984375 },
                  { x = 6239.0 + 50, y = 15692.0 },
                  --右上
                  { x = 6239.0, y = 15692.0 + 50 },
                  { x = 6164.9594726562, y = 15733.0 + 50 },
                  { x = 5921.0, y = 15729.0 },
                  { x = 5781.0, y = 15732.0 + 10 },
                  { x = 5584.0, y = 15737.0 + 10 },
                  { x = 5432.0, y = 15725.0 + 10 },
                  --正右
                  { x = 5432.0 - 10, y = 15725.0 + 10 },
                  --右下
                  { x = 5432.0 - 10, y = 15725.0 },
                  { x = 5432.0 - 10, y = 15653.0 },
                  --正下
                  { x = 5432.0 - 10, y = 15653.0 - 10 },
                  --左下
                  { x = 5432.0, y = 15653.0 - 10 },
                  { x = 5547.0, y = 15652.0 - 10 },
                  { x = 5644.0, y = 15643.0 - 10 },
                  { x = 5798.0, y = 15656.0 - 10 },
                  --正下
                  { x = 5858.0 - 10, y = 15642.0 - 10 },
                  --右下
                  { x = 5861.0 - 10, y = 15581.397460938 },
                  { x = 5857.0 - 10, y = 15516.0 },
                  { x = 5862.0 - 10, y = 15422.0 },
                  { x = 5856.0 - 10, y = 15366.0 },
                  { x = 5854.0 - 10, y = 15312.0 },
                  --正右
                  { x = 5813.0 - 10, y = 14997.0 + 10 },
                  { x = 5723.0 - 10, y = 14909.0 + 10 },
                  --右下
                  { x = 5723.0 - 10, y = 14909.0 },
                  { x = 5734.0 - 10, y = 14785.0 },
                  --正下
                  { x = 5734.0 - 10, y = 14785.0 - 10 },
                  { x = 5840.0 - 10, y = 14689.0 - 10 },
                  --左下
                  { x = 5840.0, y = 14689.0 - 10 },
                  { x = 6043.0, y = 14683.0 - 10 },
                  { x = 6235.0, y = 14688.0 - 10 },
                  --正左
                  { x = 6235.0 + 10, y = 14688.0 - 10 },
              }
            },
            { name = '星沙海滩-电梯',
              area = {

                  --正上
                  { x = 6039.0 + 10, y = 8149.0 + 10 },
                  --右上
                  { x = 5916.2548828125, y = 8205.0 + 10 },
                  --正右
                  { x = 5777.0 - 10, y = 8135.0 + 10 },
                  --右下
                  { x = 5736.0 - 10, y = 8034.9208984375 },
                  { x = 5744.0 - 10, y = 7561.736328125 }, --false
                  --正下
                  -- { x = 5788.0-10, y = 7906.0-10 },

                  { x = 5797.0 - 10, y = 7430.0 - 10 },
                  --左下
                  { x = 5920.0561523438, y = 7377.0 - 10 },
                  --正左
                  { x = 6026.0 + 10, y = 7421.0 - 10 },
                  --左上
                  { x = 6096.0 + 10, y = 7547.4169921875 },
                  { x = 6089.0 + 10, y = 8019.9189453125 }, --false
                  --正上
                  --{ x = 6045.0+10, y = 7676.0+10 },



              }
            },
            { name = '星沙海滩-负一楼',
              area = {
                  --正上
                  { x = 15363.0 + 100, y = 7428.0 + 100 },
                  { x = 15116.0 + 100, y = 7747.0 + 100 },
                  { x = 13992.0 + 100, y = 8907.0 + 100 },
                  { x = 13774.0 + 100, y = 9177.0 + 100 },
                  { x = 13477.0 + 100, y = 9767.0 + 100 },
                  { x = 13249.0 + 100, y = 10132.0 + 100 },
                  { x = 12622.0 + 100, y = 10897.0 + 100 },
                  { x = 11257.0 + 100, y = 11075.0 + 100 },
                  { x = 10846.0 + 100, y = 11109.0 + 100 },
                  --正右
                  { x = 10846.0 - 100, y = 11109.0 + 100 },
                  { x = 10268.0 - 100, y = 11095.0 + 100 },
                  { x = 9125.0 - 100, y = 10211.0 + 100 },
                  { x = 8216.0 - 100, y = 9503.0 + 100 },
                  { x = 7353.0 - 100, y = 8996.0 + 100 },
                  { x = 7240.0 - 100, y = 8971.0 + 100 },
                  { x = 6637.0 - 100, y = 8323.0 + 100 },
                  { x = 6189.0 - 100, y = 7989.0 + 100 },
                  -------------
                  --右下
                  { x = 6179.0 - 10, y = 7782.0 },
                  { x = 6116.0 - 10, y = 7482.0 },
                  --正右
                  { x = 6017.0 - 10, y = 7392.0 + 10 },
                  --右上
                  { x = 5905.0, y = 7356.0 + 10 },
                  { x = 5808.0, y = 7371.0 + 10 },
                  --正上
                  { x = 5796.0 + 10, y = 7386.0 + 10 },
                  { x = 5766.0 + 10, y = 7417.0 + 10 },
                  { x = 5726.0 + 10, y = 7462.0 + 10 },
                  { x = 5691.0 + 10, y = 7512.0 + 10 },
                  { x = 5656.0 + 10, y = 7540.0 + 10 },
                  --右上
                  { x = 5656.0, y = 7540.0 + 10 },
                  { x = 5514.0, y = 7533.0 + 10 },
                  ----------------
                  --正右
                  { x = 5514.0 - 100, y = 7533.0 + 100 },
                  { x = 5196.0 - 100, y = 7291.0 + 100 },
                  { x = 4547.0 - 100, y = 7078.0 + 100 },
                  --右下
                  { x = 4547.0 - 100, y = 7078.0 },
                  { x = 4569.0 - 100, y = 6568.0 },
                  { x = 4473.0 - 100, y = 6031.0 },
                  { x = 4490.0 - 100, y = 5428.0 },
                  --正下
                  { x = 4490.0 - 100, y = 5428.0 - 100 },
                  { x = 5191.0 - 100, y = 4585.0 - 100 },
                  --左下
                  { x = 5881.5063476562, y = 4224.0 - 100 },
                  { x = 7533.0, y = 3480.0 - 100 },
                  { x = 9153.26171875, y = 3095.0 - 100 },
                  { x = 10452.78515625, y = 2812.0 - 100 },
                  { x = 12553.0, y = 3471.0 - 100 },

                  --左上--------
                  { x = 12553.0 + 100, y = 3471.0 },
                  { x = 12778.0 + 100, y = 3693.0 },
                  { x = 12859.0 + 100, y = 4360.0 },
                  { x = 12852.0 + 100, y = 4566.0 },
                  { x = 12518.0 + 100, y = 5030.8920898438 },
                  --左下
                  { x = 13028.0, y = 5749.0 - 100 },
                  { x = 13700.196289062, y = 5495.0 - 100 },
                  --正左
                  { x = 14151.0 + 100, y = 5629.0 - 100 },
                  { x = 14532.0 + 100, y = 5881.0 - 100 },
                  { x = 14945.0 + 100, y = 6574.0 - 100 },
                  { x = 15364.0 + 100, y = 7428.0 - 100 },


              }
            },
            { name = '星沙海滩-钓鱼点',
              area = {
                  --右下
                  { x = 12992.0 - 50, y = 4631.0 },
                  { x = 12986.0 - 50, y = 4403.0 },
                  --正下
                  { x = 12986.0 - 100, y = 4403.0 - 100 },
                  { x = 13546.0 - 100, y = 3416.0 - 100 },
                  { x = 13635.0 - 100, y = 3254.0 - 100 },
                  --左下
                  { x = 13635.0, y = 3254.0 - 100 },
                  { x = 13867.0, y = 3243.0 - 100 },
                  --左上
                  { x = 13899.0 + 100, y = 3246.0 },
                  { x = 13934.0 + 100, y = 4378.0 },
                  { x = 14046.0 + 100, y = 4673.6533203125 },
                  { x = 13838.0 + 100, y = 5001.8500976562 },
                  --右上
                  { x = 13838.942382812, y = 5001.0 + 100 },
                  { x = 13336.912109375, y = 4704.0 + 100 },
                  { x = 12992.0, y = 4631.0 + 100 },
                  --正右
                  { x = 12992.0 - 100, y = 4631.0 + 100 },

              }
            },
        },

        ['秘密森林'] = {
            { name = '秘密森林-门口',
              area = {
                  --左上
                  { x = 5074.0 + 100, y = 2988.0 },
                  { x = 5480.0 + 100, y = 4276.0 },
                  { x = 4311.0 + 100, y = 5755.0 },
                  { x = 3513.0 + 100, y = 8164.0 },
                  { x = 3166.0 + 100, y = 9910.0 },
                  --正左
                  { x = 3453.0 + 100, y = 10578.0 - 100 },
                  { x = 4198.0 + 100, y = 11231.0 - 100 },
                  { x = 4898.0 + 100, y = 12630.0 - 100 },
                  { x = 5164.0 + 100, y = 13005.0 - 100 },
                  --左上
                  { x = 5164.0 + 100, y = 13005.0 },
                  --正上
                  { x = 5164.0 + 100, y = 13005.0 + 100 },
                  { x = 4565.0 + 100, y = 13660.0 + 100 },
                  --右上
                  { x = 4565.0, y = 13660.0 + 100 },
                  { x = 2831.0, y = 13773.0 + 100 },
                  { x = 2185.0, y = 13431.0 + 100 },
                  --正右
                  { x = 2045.0 - 100, y = 13333.0 + 100 },
                  { x = 1447.0 - 100, y = 12435.0 + 100 },
                  { x = 1143.0 - 100, y = 11830.0 + 100 },
                  { x = 1064.0 - 100, y = 11360.0 + 100 },
                  --右下
                  { x = 1064.0 - 100, y = 11360.0 },
                  { x = 1085.0 - 100, y = 10282.0 },
                  { x = 1217.0 - 100, y = 8825.0 },
                  { x = 1379.0 - 100, y = 7217.0 },
                  { x = 1249.0 - 100, y = 6231.0 },
                  { x = 1416.0 - 100, y = 3526.0 },
                  { x = 1586.0 - 100, y = 3218.0 },
                  { x = 2746.0 - 100, y = 1197.0 },
                  --正下
                  { x = 2746.0 - 300, y = 1197.0 - 300 },
                  { x = 2931.0 - 100, y = 938.0 - 100 },
                  --左下
                  { x = 2931.0, y = 938.0 - 100 },
                  { x = 3623.0, y = 1196.0 - 100 },
                  --正左
                  { x = 3623.0 + 100, y = 1196.0 - 100 },
                  { x = 5074.0 + 100, y = 2988.0 - 100 },


              }
            },
            { name = '秘密森林-门口一',
              area = {
                  --正上
                  { x = 7378.0 + 100, y = 12445.0 + 100 },
                  --右上
                  { x = 7378.0, y = 12445.0 + 100 },
                  { x = 6632.0, y = 12535.0 + 100 },
                  { x = 6176.0, y = 12528.0 + 100 },
                  { x = 5386.0, y = 12328.0 + 100 },
                  { x = 5225.0 - 100, y = 12221.0 + 100 }, --false
                  { x = 5048.0, y = 11852.0 + 100 },
                  --正右
                  { x = 5048.0 - 100, y = 11852.0 + 100 },
                  { x = 4859.0 - 100, y = 11314.0 + 100 },
                  --右下
                  { x = 4859.0 - 100, y = 11314.0 },
                  --正下
                  { x = 4859.0 - 100, y = 11314.0 - 100 },
                  { x = 4987.0 - 100, y = 11165.0 - 100 },
                  --左下
                  { x = 5071.0, y = 11137.0 - 100 },
                  { x = 5332.0, y = 11191.0 - 100 },

                  --正左
                  { x = 5332.0 + 100, y = 11191.0 - 100 },
                  --左下
                  { x = 6417.0, y = 11268.0 - 100 },
                  { x = 6984.0, y = 11376.0 - 100 },
                  --正左
                  { x = 6984.0 + 100, y = 11376.0 - 100 },
                  { x = 7407.0 + 100, y = 11832.0 - 100 },
                  --左上
                  { x = 7407.0 + 100, y = 11832.0 },
                  { x = 7378.0 + 100, y = 12445.0 },
              }
            },
            { name = '秘密森林-门口二',
              area = {
                  -- 右上
                  { x = 4875.0, y = 10982.0 + 100 },
                  { x = 4633.0, y = 11079.0 + 100 },
                  --正右
                  { x = 4622.0 - 100, y = 11068.0 + 100 },
                  { x = 4282.0 - 100, y = 10668.0 + 100 },
                  { x = 4050.0 - 100, y = 10278.0 + 100 },
                  --右下
                  { x = 4050.0 - 100, y = 10278.170898438 },
                  { x = 4024.0 - 100, y = 9810.3466796875 },
                  --正下
                  { x = 4054.0 - 100, y = 9703.0 - 100 },
                  { x = 4453.0 - 100, y = 9517.0 - 100 },
                  --正左
                  { x = 4453.0 + 100, y = 9517.0 - 100 },
                  { x = 4652.0 + 100, y = 9753.0 - 100 },
                  { x = 4842.0 + 100, y = 9897.0 - 100 },
                  { x = 4899.0 + 100, y = 10173.0 - 100 },
                  { x = 4892.0 + 100, y = 10989.0 - 100 },
                  --左上
                  { x = 4875.0 + 100, y = 10982.0 },


              }
            },
            { name = '秘密森林-门口三',
              area = {

                  --左上
                  { x = 8573.0 + 50, y = 5131.0 },
                  { x = 8473.0 + 50, y = 5376.0 },
                  { x = 8525.0 + 50, y = 5559.0 },
                  --正上
                  { x = 8525.0 + 100, y = 5559.0 + 100 },
                  { x = 8290.0 + 100, y = 8317.0 + 100 },
                  { x = 7939.0 + 100, y = 8925.0 + 100 },
                  { x = 7300.0 + 100, y = 10061.0 + 100 },
                  --右上
                  { x = 7300.0, y = 10061.0 + 100 },
                  { x = 6353.0, y = 10045.0 + 100 },
                  { x = 5221.0, y = 9626.0 + 100 },
                  --正右
                  { x = 5221.0 - 100, y = 9626.0 + 100 },
                  --右下
                  { x = 5199.0 - 100, y = 9399.0 },
                  --正下
                  { x = 5480.0 - 100, y = 8752.0 - 100 },
                  { x = 5846.0 - 100, y = 8387.0 - 100 },
                  { x = 6986.0 - 100, y = 7027.0 - 100 },
                  { x = 7226.0 - 100, y = 6211.0 - 100 },
                  { x = 7354.0 - 100, y = 5752.0 - 100 },
                  { x = 7787.0 - 100, y = 5107.0 - 100 },
                  --左下
                  { x = 7787.0, y = 5107.0 - 100 },
                  { x = 8573.0, y = 5131.0 - 100 },
              }
            },
            { name = '秘密森林-门口四',
              area = {
                  -- 正上
                  { x = 15562.0 + 50, y = 6141.0 + 50 },
                  --右上
                  { x = 15562.0, y = 6141.0 + 100 },
                  { x = 15022.0, y = 6040.0 + 100 },
                  { x = 12399.0, y = 5639.0 + 100 },
                  { x = 10114.0, y = 6407.0 + 100 },
                  { x = 8889.0, y = 6136.0 + 100 },

                  --正右
                  { x = 8889.0 - 100, y = 6136.0 + 100 },
                  --右下
                  { x = 8889.0 - 100, y = 6136.7724609375 },
                  { x = 8792.0 - 100, y = 6123.6748046875 },
                  { x = 8706.0 - 100, y = 5814.216796875 },
                  { x = 8665.0 - 100, y = 5670.0942382812 },
                  { x = 8680.0 - 100, y = 5589.697265625 },
                  { x = 8704.0 - 100, y = 5472.3364257812 },
                  { x = 8719.0 - 100, y = 5397.2866210938 },
                  { x = 8732.0 - 100, y = 5335.0439453125 },
                  --正下
                  { x = 8733.0 - 100, y = 5327.0 - 100 },
                  { x = 9058.0 - 100, y = 4121.0 - 100 },
                  { x = 9743.0 - 100, y = 1571.0 - 100 },
                  --    左下
                  { x = 10400.0, y = 1636.0 - 100 },
                  { x = 12957.0, y = 1729.0 - 100 },
                  { x = 14016.0, y = 3297.0 - 100 },
                  { x = 15012.0, y = 4903.0 - 100 },
                  { x = 15452.0, y = 5832.0 - 100 },
                  --正左
                  { x = 15452.0 + 100, y = 5832.0 - 100 },

              }
            },
            { name = '秘密森林-门口五',
              area = {
                  --正左
                  { x = 15940.0 + 20, y = 5558.0 - 20 },
                  { x = 16051.0 + 20, y = 5879.0 - 20 },
                  { x = 16076.0 + 20, y = 6084.0 - 20 },
                  --正上
                  { x = 16075.0 + 20, y = 6090.0 + 20 },
                  { x = 15878.0 + 20, y = 6185.0 + 20 },
                  --正右
                  { x = 15878.0 - 20, y = 6185.0 + 20 },
                  { x = 15637.0 - 20, y = 6131.0 + 20 },
                  { x = 15736.0 - 20, y = 5536.0 + 20 },
                  --正下
                  { x = 15736.0 - 20, y = 5536.0 - 20 },
                  { x = 15940.0 - 20, y = 5558.0 - 20 },


              }
            },
            { name = '秘密森林-左边小圆盘',
              area = {
                  -- 正上
                  { x = 17667.0 + 100, y = 4166.0 + 100 },
                  { x = 17406.0 + 100, y = 4431.0 + 100 },
                  { x = 16931.0 + 100, y = 4758.0 + 100 },
                  -- 正右
                  { x = 16931.0 - 100, y = 4758.0 + 100 },
                  { x = 16866.0 - 100, y = 4583.0 + 100 },
                  { x = 16791.0 - 100, y = 4379.0 + 100 },
                  --右下
                  { x = 16791.0 - 100, y = 4379.6450195312 },
                  { x = 16720.0 - 100, y = 4026.0 },
                  { x = 16754.0 - 100, y = 3595.0 },
                  { x = 16893.0 - 100, y = 3285.0 },
                  --正下
                  { x = 16893.0 - 100, y = 3285.0 - 100 },
                  --正左
                  { x = 16893.0 + 100, y = 3285.0 - 100 },
                  { x = 17274.0 + 100, y = 3483.0 - 100 },
                  { x = 17587.0 + 100, y = 3904.0 - 100 },
                  { x = 17699.0 + 100, y = 4152.0 - 100 },


              }
            },
            { name = '秘密森林-连接处',
              area = {
                  --正上
                  { x = 18482.0 + 100, y = 10562.0 + 100 },
                  { x = 18274.0 + 100, y = 10804.0 + 100 },
                  { x = 17748.0 + 100, y = 11090.0 + 100 },
                  { x = 17236.0 + 100, y = 11208.0 + 100 },
                  --正右
                  { x = 17236.0 - 100, y = 11208.0 + 100 },
                  { x = 16958.0 - 100, y = 11011.0 + 100 },
                  { x = 16797.0 - 100, y = 10220.0 + 100 },
                  { x = 16404.0 - 100, y = 9607.0 + 100 },
                  --右下
                  { x = 16407.0 - 100, y = 9608.73828125 },
                  { x = 16469.0 - 100, y = 7544.9228515625 },
                  --右上
                  { x = 16302.0, y = 5940.0 + 20 },
                  --正右
                  { x = 16026.0 - 20, y = 5650.0 + 20 },
                  --右下
                  { x = 15944.0 - 20, y = 5443.0 },
                  --正下
                  { x = 16064.0 - 100, y = 5310.0 - 100 },
                  { x = 16248.0 - 100, y = 5172.0 - 100 },
                  { x = 16440.0 - 100, y = 5094.0 - 100 },
                  --左下
                  { x = 16440.0, y = 5094.0 - 100 },
                  --正左
                  { x = 16440.0 + 100, y = 5094.0 - 100 },
                  { x = 16787.0 + 100, y = 5468.0 - 100 },
                  { x = 17558.0 + 100, y = 6340.0 - 100 },
                  { x = 18073.0 + 100, y = 6488.0 - 100 },
                  { x = 18298.0 + 100, y = 7072.0 - 100 },
                  { x = 18998.0 + 100, y = 8484.0 - 100 },
                  { x = 19206.0 + 100, y = 8953.0 - 100 },
                  --正上
                  { x = 19204.0 + 100, y = 8959.0 + 100 },
                  { x = 19056.0 + 100, y = 9362.0 + 100 },
                  { x = 18736.0 + 100, y = 9648.0 + 100 },


              }
            },
            { name = '秘密森林-副本门口',
              area = {
                  --正上
                  { x = 20365.0 + 100, y = 10780.0 + 100 },
                  { x = 20216.0 + 100, y = 11285.0 + 100 },
                  --右上
                  { x = 20216.0, y = 11285.0 + 100 },
                  { x = 18787.0, y = 11025.0 + 100 },
                  --正右
                  { x = 18787.0 - 100, y = 11025.0 + 100 },
                  --正下
                  { x = 18787.0 - 100, y = 11025.0 - 100 },
                  { x = 18963.0 - 100, y = 10825.0 - 100 },
                  { x = 20123.0 - 100, y = 10646.0 - 100 },
                  --正左
                  { x = 20123.0 + 100, y = 10646.0 - 100 },
                  { x = 20342.0 + 100, y = 10711.0 - 100 },
                  { x = 20365.0 + 100, y = 10780.0 - 100 },

              }
            },
            { name = '秘密森林-C形连接',
              area = {
                  --左上
                  { x = 15851.0 + 100, y = 7559.060546875 },
                  { x = 15834.0 + 100, y = 7923.869140625 },
                  { x = 15789.0 + 100, y = 9379.0 },
                  { x = 15710.0 + 100, y = 9599.0 },
                  --正上
                  { x = 15710.0 + 100, y = 9599.0 + 100 },
                  { x = 15450.0 + 100, y = 9830.0 + 100 },
                  --右上
                  { x = 15306.0, y = 9801.0 + 100 },
                  { x = 14994.0, y = 9601.0 + 100 },
                  { x = 14156.0, y = 9785.0 + 100 },
                  { x = 13254.0, y = 9384.0 + 100 },
                  { x = 12991.0, y = 9202.0 + 100 },
                  --正右
                  { x = 12991.0 - 50, y = 9202.0 + 50 },
                  --右下
                  { x = 12991.0 - 20, y = 9202.0 },
                  { x = 12815.0 - 20, y = 9001.845703125 }, --false
                  { x = 12840.0 - 20, y = 8968.1650390625 },
                  { x = 12846.0 - 20, y = 8499.5859375 },

                  { x = 12811.0 - 100, y = 8141.0 },
                  { x = 13069.0 - 100, y = 7501.0 },
                  --正下
                  { x = 13069.0 - 100, y = 7501.0 - 100 },
                  --左下
                  { x = 13100.0, y = 7383.0 - 100 },
                  { x = 13621.0, y = 7185.0 - 100 },
                  { x = 15163.0, y = 7065.0 - 100 },
                  --正左
                  { x = 15163.0 + 100, y = 7065.0 - 100 },
                  { x = 15851.0 + 100, y = 7559.0 - 100 },

              }
            },
            { name = '秘密森林-右边小圆盘',
              area = {
                  --左上
                  { x = 16122.0 + 100, y = 10241.0 },
                  --正上
                  { x = 15733.0 + 100, y = 10653.0 + 100 },
                  --右上
                  { x = 15401.0, y = 10650.0 + 100 },
                  --正右
                  { x = 15166.0 - 100, y = 10353.0 + 100 },
                  --正下
                  { x = 15274.0 - 100, y = 10096.0 - 100 },
                  --左下
                  { x = 15483.0, y = 10020.0 - 100 },
                  { x = 15822.0, y = 9936.0 - 100 },
              }
            },
            { name = '秘密森林-远端一',
              area = {
                  --正左
                  { x = 11761.0 + 100, y = 7702.0 - 100 },
                  { x = 12135.0 + 100, y = 7809.0 - 100 },
                  { x = 12579.0 + 100, y = 8151.0 - 100 },
                  --左上
                  { x = 12579.0 + 20, y = 8151.0 },
                  { x = 12717.0 + 20, y = 8492.0 },
                  { x = 12758.0 + 20, y = 8953.0 },
                  { x = 12857.0 + 20, y = 9093.0 },
                  { x = 12898.0 + 20, y = 9364.0 },
                  --正上
                  { x = 12898.0 + 50, y = 9364.0 + 50 },
                  { x = 12484.0 + 100, y = 9582.0 + 100 },
                  --正右
                  { x = 12484.0 - 100, y = 9582.0 + 100 },
                  { x = 12344.0 - 100, y = 9359.0 + 100 },
                  --右下
                  { x = 12344.0 - 50, y = 9359.0 },
                  { x = 12316.0 - 50, y = 9012.0 },
                  { x = 12205.0 - 50, y = 8277.0 },
                  --正右
                  { x = 12205.0 - 100, y = 8277.0 + 100 },
                  { x = 11794.0 - 100, y = 8084.0 + 100 },
                  --正下
                  { x = 11794.0 - 100, y = 8084.0 - 100 },
                  { x = 11761.0 - 100, y = 7702.0 - 100 },
              }
            },
            { name = '秘密森林-远端二',
              area = {
                  --左上
                  { x = 12231.0 + 20, y = 9301.0 },
                  { x = 12252.0 + 20, y = 9344.0 }, --false
                  { x = 12225.0 + 10, y = 9428.0 + 10 }, --false
                  { x = 12168.0 + 20, y = 9494.0 },
                  --正上
                  { x = 12168.0 + 100, y = 9494.0 + 100 },
                  --右上
                  { x = 12168.0, y = 9494.0 + 100 },
                  --左下
                  { x = 12067.0, y = 10562.0 - 100 },
                  { x = 13254.0, y = 11032.0 - 100 },
                  --正左
                  { x = 13254.0 + 100, y = 11032.0 - 100 },
                  --左上
                  { x = 13510.0 + 100, y = 11468.0 },
                  --正上
                  { x = 13510.0 + 100, y = 11468.0 + 100 },
                  { x = 13331.0 + 100, y = 11740.0 + 100 },
                  { x = 13069.0 + 100, y = 11899.0 + 100 },
                  --右上
                  { x = 13069.0, y = 11899.0 + 100 },
                  { x = 12810.0, y = 12031.0 + 100 },
                  { x = 12420.0, y = 11714.0 + 100 },
                  --正右
                  { x = 12420.0 - 100, y = 11714.0 + 100 },
                  { x = 10784.0 - 100, y = 11053.0 + 100 },
                  { x = 10216.0 - 100, y = 10675.0 + 100 },
                  { x = 9594.0 - 100, y = 9604.0 + 100 },
                  --右下
                  { x = 9594.0 - 100, y = 9604.0 },
                  { x = 9627.0 - 100, y = 9370.0 },
                  --正下
                  { x = 9627.0 - 100, y = 9370.0 - 100 },
                  { x = 9835.0 - 100, y = 9075.0 - 100 },
                  --左下
                  { x = 9835.0, y = 9075.0 - 100 },
                  { x = 10237.0, y = 8951.0 - 100 },
                  { x = 11414.0, y = 9096.0 - 100 },
                  { x = 12231.0, y = 9301.0 - 100 },
                  --正左
                  { x = 12231.0 + 50, y = 9301.0 - 50 },
              }
            },
            { name = '秘密森林-远端',
              area = {
                  --正上
                  { x = 14915.0 + 100, y = 16059.0 + 100 },
                  --右上
                  { x = 13534.54296875, y = 16068.0 + 100 },
                  --正右
                  { x = 13534.0 - 100, y = 16068.0 + 100 },
                  --右下
                  { x = 12764.0 - 100, y = 14524.000976562 },
                  { x = 12733.0 - 100, y = 13107.942382812 },
                  { x = 12513.0 - 100, y = 12276.0 },
                  --正下
                  { x = 12513.0 - 100, y = 12276.0 - 100 },
                  --左下
                  { x = 12513.0, y = 12276.0 - 100 },
                  { x = 12765.228515625, y = 12197.0 - 100 },
                  { x = 13081.448242188, y = 12216.0 - 100 },
                  --左上
                  { x = 13081.0 + 100, y = 12216.897460938 },
                  { x = 13650.0 + 100, y = 13660.387695312 },
                  --正左
                  { x = 14788.0 + 100, y = 14482.0 - 100 },
                  --左上
                  { x = 14788.0 + 100, y = 14482.016601562 },

              }
            },
        },

        ['蒂卡蒂卡聚落'] = {
            { name = '蒂卡蒂卡聚落-门口',
              area = {
                  --正上
                  { x = 7146.0 + 300, y = 21524.0 + 300 },
                  { x = 6609.0 + 300, y = 21597.0 + 300 },
                  --右上
                  { x = 4506.5092773438, y = 22265.0 + 300 },
                  { x = -440.40979003906, y = 20746.0 + 300 },
                  --正右
                  { x = -910.0 - 300, y = 20365.0 + 300 },
                  { x = -423.0 - 300, y = 10266.0 + 300 },
                  { x = -738.0 - 300, y = 8713.0 + 300 },
                  { x = -1038.0 - 300, y = 7917.0 + 300 },
                  { x = -1065.0 - 300, y = 7571.0 + 300 },
                  --右下
                  { x = -1065.0 - 300, y = 7571.0 },
                  --正下
                  { x = -1065.0 - 300, y = 7571.0 - 300 },
                  { x = 12.0 - 300, y = 6177.0 - 300 },
                  { x = 12.0 - 300, y = 6177.0 - 300 },
                  { x = 1914.0 - 300, y = 7202.0 - 300 },
                  --正左
                  { x = 1914.0 + 300, y = 7202.0 - 300 },
                  --左上
                  { x = 1931.0 + 300, y = 7219.0 },
                  { x = 2085.0 + 300, y = 8120.6479492188 },
                  { x = 1788.0 + 300, y = 9214.4423828125 },
                  --正左
                  { x = 1765.0 + 300, y = 10525.0 - 300 },
                  { x = 2114.0 + 300, y = 11062.0 - 300 },
                  { x = 2559.0 + 300, y = 12029.0 - 300 },
                  { x = 2916.0 + 300, y = 12597.0 - 300 },
                  { x = 3522.0 + 300, y = 13752.0 - 300 },
                  { x = 3625.0 + 300, y = 14081.0 - 300 },
                  { x = 6156.0 + 300, y = 18640.0 - 300 },
                  --左上
                  { x = 6156.0 + 300, y = 18640.0 },
                  { x = 6416.0 + 300, y = 19283.0 },
                  { x = 6630.0 + 300, y = 19751.0 },
                  { x = 6985.0 + 300, y = 20353.0 },
                  { x = 7267.0 + 300, y = 20865.0 },
                  { x = 7157.0 + 300, y = 21534.0 },


              }
            },
            { name = '蒂卡蒂卡聚落-部落',
              area = {
                  --右上
                  { x = 20607.0, y = 14979.0 + 300 },
                  { x = 19936.0, y = 14823.0 + 300 },
                  { x = 18799.0, y = 14855.0 + 300 },
                  { x = 17628.0, y = 14839.0 + 300 },
                  --正右
                  { x = 17628.0 - 10, y = 14839.0 + 10 },
                  { x = 17146.0 - 10, y = 14697.0 + 10 },
                  { x = 17059.0 - 10, y = 14592.0 + 10 },
                  { x = 16939.0 - 10, y = 14477.0 + 10 },
                  { x = 17053.0 - 10, y = 14178.0 + 10 },
                  --正下
                  { x = 17053.0 - 10, y = 14178.0 - 10 },
                  { x = 17307.0 - 20, y = 13944.0 - 20 },
                  { x = 17399.0 - 20, y = 13826.0 - 20 },
                  { x = 18196.0 - 300, y = 13607.0 - 300 },
                  --左下

                  { x = 18196.0, y = 13607.0 - 300 },
                  { x = 18688.0, y = 13867.0 - 300 },
                  { x = 19263.962890625, y = 14082.0 - 300 },
                  --右下
                  { x = 19431.0 - 300, y = 13471.0 },
                  { x = 19440.0 - 300, y = 13284.0 },
                  { x = 19261.0 - 300, y = 11913.0 },
                  --右上
                  { x = 17866.0, y = 10370.0 + 300 },
                  { x = 17580.0, y = 10236.0 + 300 },
                  { x = 17239.0, y = 9901.0 + 300 },
                  { x = 15573.0, y = 9264.0 + 300 },
                  --左上
                  { x = 13150.0 + 300, y = 11490.185546875 },
                  { x = 13173.0 + 300, y = 11971.0 },
                  { x = 13036.0 + 300, y = 12030.0 },
                  --右上
                  { x = 13036.0, y = 12030.0 + 300 },
                  --正右
                  { x = 12898.0 - 300, y = 11968.0 + 300 },
                  { x = 12738.0 - 300, y = 10707.0 + 300 },
                  { x = 12515.0 - 300, y = 10368.0 + 300 },
                  { x = 12222.0 - 300, y = 10148.0 + 300 },
                  { x = 11849.0 - 300, y = 9466.0 + 300 },
                  --正上
                  { x = 9365.0 + 300, y = 10410.0 + 300 },

                  --左上
                  { x = 9259.0 + 300, y = 11393.0 },
                  --左下
                  { x = 9876.0, y = 12429.0 - 300 },
                  --正左
                  { x = 10535.0 + 50, y = 12844.0 - 50 },
                  --左上
                  { x = 10546.0 + 300, y = 12965.58984375 },
                  --正上
                  { x = 10546.0 + 300, y = 12965.0 + 300 },
                  --右上
                  { x = 10546.0, y = 12965.0 + 300 },
                  --左下
                  { x = 11032.889648438, y = 15795.0 - 300 },
                  --正左
                  { x = 11032.0 + 300, y = 15795.0 - 300 },
                  { x = 11510.0 + 300, y = 16341.0 - 300 },
                  --左上
                  { x = 11510.0 + 300, y = 16341.0 },
                  { x = 11519.0 + 300, y = 17122.0 },
                  { x = 11211.0 + 300, y = 17789.0 },
                  --正上
                  { x = 11211.0 + 300, y = 17789.0 + 300 },
                  --右上
                  { x = 11211.0, y = 17789.0 + 300 },
                  { x = 10704.0, y = 17837.0 + 300 },
                  { x = 10058.0, y = 17692.0 + 300 },
                  { x = 9549.0, y = 17386.0 + 300 },
                  { x = 6699.0, y = 15522.0 + 300 },
                  { x = 4175.0, y = 13469.0 + 300 },
                  --正右
                  { x = 4175.0 - 300, y = 13469.0 + 300 },
                  { x = 3713.0 - 300, y = 13084.0 + 300 },
                  { x = 3443.0 - 300, y = 12500.0 + 300 },
                  { x = 3359.0 - 300, y = 12308.0 + 300 },
                  --右下
                  { x = 3359.0 - 300, y = 12308.0 },
                  { x = 3406.0 - 300, y = 11554.0 },
                  { x = 3243.0 - 300, y = 10868.0 },
                  { x = 3409.0 - 300, y = 9961.4736328125 },
                  { x = 3231.0 - 300, y = 9090.0 },
                  { x = 3241.0 - 300, y = 7856.1630859375 },
                  { x = 3378.0 - 300, y = 7491.0 },
                  --正下
                  { x = 3974.0 - 300, y = 6731.0 - 300 },
                  --正上
                  { x = 1945.0 + 300, y = 6185.0 + 300 },
                  --右上
                  { x = 1976.0, y = 6190.0 + 300 },
                  { x = 1695.0, y = 6147.0 + 300 },
                  --正右
                  { x = 1695.0 - 300, y = 6147.0 + 300 },
                  { x = 1377.0 - 300, y = 5686.0 + 300 },
                  { x = 840.0 - 300, y = 5400.0 + 300 },
                  { x = 403.0 - 300, y = 5249.0 + 300 },
                  { x = 147.0 - 300, y = 5149.0 + 300 },
                  { x = 114.0 - 300, y = 5092.0 + 300 },
                  --右下
                  { x = 114.0 - 300, y = 5092.0 },
                  { x = 110.0 - 300, y = 4513.0 },
                  { x = -17.0 - 300, y = 3095.0 },
                  { x = 133.0 - 300, y = 2207.0 },
                  --正下
                  { x = 140.0 - 300, y = 2217.0 - 300 },
                  { x = 812.0 - 300, y = 1574.0 - 300 },
                  { x = 1848.0 - 300, y = 847.0 - 300 },
                  --左下
                  { x = 2133.484375, y = 790.0 - 300 },
                  { x = 8398.6064453125, y = -1883.0 - 300 },
                  --左上
                  { x = 8394.0 + 300, y = -1867.3869628906 },
                  { x = 9433.0 + 300, y = -1124.7905273438 },
                  { x = 10261.0 + 300, y = -78.0 },
                  { x = 11988.0 + 300, y = 641.0 },
                  { x = 12105.0 + 300, y = 894.0 },
                  { x = 12120.0 + 300, y = 1387.0 },
                  --正上
                  { x = 12101.0 + 50, y = 1395.0 + 50 },
                  { x = 11948.0 + 50, y = 1641.0 + 50 },
                  { x = 11861.0 + 50, y = 1700.0 + 50 },
                  { x = 11696.0 + 50, y = 1802.0 + 50 },
                  { x = 11602.0 + 50, y = 1888.0 + 50 },
                  --右上
                  { x = 11176.0, y = 1791.0 + 300 },
                  --左上
                  { x = 9775.0 + 300, y = 4613.0 },
                  { x = 9980.0 + 300, y = 5339.0 },
                  { x = 10021.0 + 300, y = 8005.3315429688 },
                  --左下
                  { x = 13204.0, y = 7542.0 - 300 },
                  --右下
                  { x = 16229.0 - 300, y = 6859.958984375 },
                  --正右
                  { x = 16229.0 - 300, y = 6859.0 + 300 },
                  { x = 15758.0 - 300, y = 5829.0 + 300 },
                  --右下
                  { x = 15758.0 - 300, y = 5829.0 },
                  --正下
                  { x = 15758.0 - 300, y = 5829.0 - 300 },
                  { x = 16037.0 - 300, y = 5333.0 - 300 },
                  { x = 18189.0 - 300, y = 2007.0 - 300 },
                  { x = 18607.0 - 300, y = 1520.0 - 300 },
                  { x = 18879.0 - 300, y = 1149.0 - 300 },
                  --左下
                  { x = 19804.0, y = 796.0 - 300 },
                  { x = 20507.0, y = 870.0 - 300 },
                  --正左
                  { x = 20507.0 + 300, y = 870.0 - 300 },
                  { x = 21225.0 + 300, y = 2291.0 - 300 },
                  { x = 21444.0 + 300, y = 2969.0 - 300 },
                  --正上
                  { x = 21113.0 + 300, y = 3009.0 + 300 },
                  --正左
                  { x = 19621.0 + 300, y = 6907.0 - 300 },
                  { x = 20623.0 + 300, y = 9032.0 - 300 },
                  { x = 21789.0 + 300, y = 10537.0 - 300 },
                  { x = 22467.0 + 300, y = 11293.0 - 300 },
                  --左上
                  { x = 22537.0 + 300, y = 12220.0 },
                  { x = 22159.0 + 300, y = 13120.0 },
                  --正上
                  { x = 22159.0 + 300, y = 13120.0 + 300 },
                  { x = 21883.0 + 300, y = 13517.0 + 300 },
                  { x = 20889.0 + 300, y = 14234.0 + 300 },
                  { x = 20723.0 + 300, y = 14906.0 + 300 },

              }
            },
            { name = '蒂卡蒂卡聚落-台子一',
              area = {
                  --正上
                  { x = 13290.00 + 50, y = 987.0 + 50 },
                  { x = 13214.0 + 50, y = 1186.0 + 50 },
                  { x = 13082.0 + 50, y = 1331.0 + 50 },
                  { x = 12554.0 + 50, y = 1993.0 + 50 },
                  { x = 12198.0 + 50, y = 2236.0 + 50 },
                  { x = 11899.0 + 50, y = 2371.0 + 50 },
                  --正右
                  { x = 11899.0 - 50, y = 2371.0 + 50 },
                  { x = 11842.0 - 50, y = 2364.0 + 50 },
                  { x = 11810.0 - 50, y = 2055.0 + 50 },
                  --正下
                  { x = 11752.0 - 20, y = 1841.0 - 20 },
                  { x = 11974.0 - 20, y = 1704.0 - 20 },
                  { x = 12517.0 - 20, y = 1274.0 - 20 },
                  --正右
                  { x = 12501.0 - 50, y = 1032.0 + 50 },
                  { x = 12256.0 - 50, y = 812.0 + 50 },
                  --正下
                  { x = 12256.0 - 50, y = 812.0 - 50 },
                  { x = 12538.0 - 50, y = 421.0 - 50 },
                  --正左
                  { x = 12538.0 + 50, y = 421.0 - 50 },
                  { x = 12955.0 + 50, y = 406.0 - 50 },
                  { x = 13160.0 + 50, y = 540.0 - 50 },
                  { x = 13268.0 + 50, y = 727.0 - 50 },
                  --左上
                  { x = 13274.0 + 50, y = 991.0 },
                  { x = 13184.0 + 50, y = 1238.0 },


              }
            },
            { name = '蒂卡蒂卡聚落-台子二',
              area = {
                  --左下
                  { x = 13995.0, y = -1444.0 - 50 },
                  --正左
                  { x = 14420.0 + 50, y = -1201.0 - 50 },
                  { x = 14547.0 + 50, y = -1088.0 - 50 },
                  --左上
                  { x = 14538.00 + 50, y = -998.0 },
                  { x = 14258.0 + 50, y = -760.46185302734 },
                  --左上
                  { x = 14247.0 + 50, y = -759.48419189453 },
                  { x = 14227.0 + 50, y = -706.76641845703 },
                  { x = 14212.0 + 50, y = -671.81604003906 },
                  { x = 14183.0 + 50, y = -600.0 },
                  { x = 14116.0 + 50, y = -410.0 },
                  { x = 14110.0 + 50, y = -367.0 },
                  --正上
                  { x = 14110.0 + 50, y = -367.0 + 50 },
                  { x = 13899.0 + 50, y = -226.0 + 50 },
                  { x = 13538.0 + 50, y = -39.0 + 50 },
                  --右上
                  { x = 13303.87890625, y = -48.0 + 50 },
                  --右下
                  { x = 13303.0 - 50, y = -48.038536071777 },
                  { x = 13205.0 - 50, y = -674.0 },
                  --正下
                  { x = 13205.0 - 50, y = -674.0 - 50 },
                  { x = 13435.0 - 50, y = -1082.0 - 50 },
                  { x = 13995.0 - 50, y = -1444.0 - 50 },

              }
            },
            { name = '蒂卡蒂卡聚落-台子三',
              area = {
                  --右下
                  { x = 14237.0 - 50, y = -329.0 },
                  { x = 14217.0 - 50, y = -470.0 },
                  --正下
                  { x = 14351.0 - 100, y = -576.0 - 100 },
                  --左下
                  { x = 14351.0, y = -576.0 - 100 },
                  { x = 14485.0, y = -517.0 - 100 },
                  { x = 14638.0, y = -394.0 - 100 },
                  --正左
                  { x = 14771.0 + 100, y = -208.0 - 100 },
                  { x = 15201.0 + 100, y = 365.0 - 100 },
                  --左上
                  { x = 15078.0 + 100, y = 839.44152832031 },
                  { x = 15017.0 + 100, y = 1219.0 },
                  --正上
                  { x = 15017.0 + 100, y = 1219.0 + 100 },
                  --右上
                  { x = 14638.448242188, y = 1277.0 + 100 },
                  --正右
                  { x = 14288.0 - 100, y = 1011.0 + 100 },
                  --右下
                  { x = 14210.0 - 100, y = 860.36322021484 },

              }
            },
            { name = '蒂卡蒂卡聚落-台子四',
              area ={
                  --正左
                  { x = 14736.0 + 100, y = 2041.0 - 100 },
                  { x = 15219.0 + 100, y = 3205.0 - 100 },
                  --左上
                  { x = 15412.0 + 100, y = 3766.0 },
                  --正上
                  { x = 15185.0 + 100, y = 4040.0 + 100 },
                  { x = 14609.0 + 100, y = 4367.0 + 100 },
                  { x = 14231.0 + 100, y = 4621.0 + 100 },
                  { x = 13648.0 + 100, y = 4771.0 + 100 },
                  --右上
                  { x = 13401.0, y = 4757.0 + 100 },
                  --正右
                  { x = 13249.0 - 100, y = 4615.0 + 100 },
                  --右下
                  { x = 13243.0 - 100, y = 4358.0 },
                  --正下
                  { x = 13384.0 - 100, y = 4201.0 - 100 },
                  --正右
                  { x = 13213.0 - 100, y = 3013.0 + 100 },
                  { x = 12930.0 - 100, y = 2812.0 + 100 },
                  --右下
                  { x = 12916.0 - 100, y = 2531.0 },
                  { x = 12931.0 - 100, y = 2232.0 },
                  --正下
                  { x = 12931.0 - 100, y = 2232.0 - 100 },
                  --左下
                  { x = 13069.0, y = 2126.0 - 100 },
                  { x = 13742.0, y = 1947.0 - 100 },
                  { x = 14704.375, y = 1810.0 - 100 },


              }
            },
            { name = '蒂卡蒂卡聚落-台子五',
              area = {
                  -- 左上
                  { x = 12640.0 + 100, y = 4385.0 },
                  { x = 12801.0 + 100, y = 4990.0 },
                  --正上
                  { x = 12554.0 + 100, y = 5149.0 + 100 },
                  { x = 12095.0 + 100, y = 5303.0 + 100 },
                  --正右
                  { x = 11815.0 - 100, y = 5204.0 + 100 },
                  --右下
                  { x = 11815.0 - 100, y = 5204.0 },
                  { x = 11540.0 - 100, y = 5006.328125 },
                  { x = 11889.0 - 100, y = 4745.0 },
                  { x = 12003.0 - 100, y = 4523.0 },
                  --正下
                  { x = 11985.0 - 100, y = 4550.0 - 100 },
                  --左下
                  { x = 12046.0, y = 4175.0 - 100 },
                  { x = 12383.0, y = 4268.0 - 100 },
                  --正左
                  { x = 12383.0 + 100, y = 4268.0 - 100 },

              }
            },
            { name = '蒂卡蒂卡聚落-岛F',
              area = {
                  --正左
                  { x = 11933.0 + 100, y = 11732.0 - 100 },
                  { x = 12127.0 + 100, y = 12562.0 - 100 },
                  { x = 12317.0 + 100, y = 12905.0 - 100 },
                  { x = 12671.0 + 100, y = 13973.0 - 100 },
                  --左上
                  { x = 12671.0 + 100, y = 13973.0 },
                  --右上
                  { x = 12611.0, y = 14074.0 + 100 },
                  --正右
                  { x = 12463.0 - 100, y = 14070.0 + 100 },
                  --右上
                  { x = 10816.0, y = 12818.0 + 100 },
                  --正右
                  { x = 10816.0 - 100, y = 12818.0 + 100 },
                  { x = 11078.0 - 100, y = 11827.0 + 100 },
                  --正下
                  { x = 11078.0 - 100, y = 11827.0 - 100 },
                  { x = 11121.0 - 100, y = 11662.0 - 100 },
                  --左下
                  { x = 11121.0, y = 11662.0 - 100 },
                  { x = 11933.0, y = 11732.0 - 100 },
              }
            },

            { name = '蒂卡蒂卡聚落-月岛',
              area = {
                  --正上
                  { x = 16083.0 + 200, y = 12390.0 + 200 },
                  { x = 15971.0 + 200, y = 12628.0 + 200 },
                  --左上
                  { x = 16082.0 + 20, y = 12920.0 },
                  { x = 16186.0 + 20, y = 13120.0 },
                  --正上
                  { x = 16143.0 + 20, y = 13173.0 + 20 },
                  --右上
                  { x = 16107.0, y = 13182.0 + 10 },
                  { x = 16058.0, y = 13195.0 + 10 },
                  { x = 16014.0, y = 13205.0 + 10 },
                  { x = 15953.0, y = 13204.0 + 10 },
                  { x = 15895.0, y = 13177.0 + 10 }, --false
                  { x = 15895.0, y = 13158.0 + 10 },
                  { x = 15827.0, y = 13155.0 + 200 },
                  { x = 15562.0, y = 13096.0 + 200 },
                  --正右
                  { x = 15426.0 - 200, y = 12866.0 + 200 },
                  { x = 15014.0 - 200, y = 12211.0 + 200 },
                  --正下
                  { x = 15014.0 - 200, y = 12211.0 - 200 },
                  --左下
                  { x = 15014.0, y = 12211.0 - 200 },
                  { x = 15232.0, y = 12027.0 - 200 },
                  { x = 15426.0, y = 11931.0 - 200 },
                  { x = 15995.0, y = 11952.0 - 200 },
                  --正左
                  { x = 15995.0 + 200, y = 11952.0 - 200 },
                  { x = 16161.0 + 200, y = 12183.0 - 200 },
                  { x = 16221.0 + 200, y = 12284.0 - 200 },
                  --正上
                  { x = 16221.0 + 200, y = 12284.0 + 200 },

              }
            },
            { name = '蒂卡蒂卡聚落-船',
              area = {
                  --正右
                  { x = 17148.0 - 20, y = 14703.0 + 20 },
                  { x = 17061.0 - 20, y = 14602.0 + 20 },
                  { x = 16930.0 - 20, y = 14477.0 + 20 },
                  --右下
                  { x = 16930.0 - 20, y = 14477.0 },
                  { x = 17053.0 - 20, y = 14179.0 },
                  --正下
                  { x = 17053.0 - 20, y = 14179.0 - 20 },
                  { x = 17174.0 - 20, y = 14071.0 - 20 },
                  { x = 17278.0 - 20, y = 13945.0 - 20 },
                  { x = 17396.0 - 20, y = 13832.0 - 20 },
                  { x = 18017.0 - 100, y = 13829.0 - 100 },
                  --左上
                  { x = 16245.0 + 100, y = 12414.817382812 },
                  { x = 16140.0 + 10, y = 13173.602539062 },
                  --正上
                  { x = 16140.0 + 10, y = 13173.0 + 10 },
                  --右上
                  { x = 16140.588867188, y = 13173.0 + 10 },
                  { x = 16088.0, y = 13187.0 + 10 },
                  { x = 16052.0, y = 13196.0 + 10 },
                  { x = 15983.0, y = 13208.0 + 10 },
                  { x = 15827.0, y = 13155.0 + 10 },

                  { x = 15827.0 - 200, y = 13155.0 + 200 },
                  { x = 17148.0 - 500, y = 14703.0 + 500 },

              }
            },
            { name = '蒂卡蒂卡聚落-月广场一',
              area = {
                  --右上
                  { x = -538.04382324219, y = -30566.0 + 100 },
                  { x = -869.0, y = -30442.0 + 100 },
                  --正上
                  { x = -1587.0 + 100, y = -30072.0 + 100 },
                  { x = -2015.0 + 100, y = -29738.0 },
                  --右上
                  { x = -2155.0, y = -29755.0 + 100 },
                  --正右
                  { x = -2155.0 - 500, y = -29755.0 + 500 },

                  --正下
                  { x = -2085.0 - 200, y = -30324.0 - 200 },
                  { x = -1457.0 - 200, y = -30738.0 - 200 },
                  { x = -1123.0 - 200, y = -30967.0 - 200 },
                  --左下
                  { x = -693.26324462891, y = -30924.0 - 100 },
                  --正左
                  { x = -693.0 + 50, y = -30924.0 - 50 },
                  { x = -532.0 + 50, y = -30595.0 - 50 },


              }
            },
            { name = '蒂卡蒂卡聚落-月广场',
              area = {
                  --左上
                  { x = 1355.0 + 100, y = -30926.0 },
                  { x = 1501.0 + 100, y = -30500.0 },
                  { x = 1358.0 + 100, y = -30158.0 },
                  --正上
                  { x = 1358.0 + 100, y = -30158.0 + 100 },
                  --右上
                  { x = 1358.0, y = -30158.0 + 100 },
                  { x = 1088.0, y = -30109.0 + 100 },
                  { x = 319.0, y = -30058.0 + 100 },
                  { x = -88.0, y = -30307.0 + 100 },
                  --正右
                  { x = -224.0 - 100, y = -30570.0 + 100 },
                  --正下
                  { x = -224.0 - 100, y = -30570.0 - 100 },
                  { x = -89.0 - 100, y = -30858.0 - 100 },
                  --左下
                  { x = 301.0, y = -31061.0 - 100 },
                  { x = 796.75183105469, y = -30894.0 - 100 },
                  { x = 1146.7561035156, y = -31007.0 - 100 },
                  { x = 1355.4436035156, y = -30925.0 - 100 },

              }
            },
        },

        ['妮亚村'] = {
            { name = '妮亚村-村子',
              area = {
                  --正上
                  { x = 7728.0 + 300, y = 467.0 + 300 },
                  { x = 7246.0 + 300, y = 685.0 + 300 },
                  --右上
                  { x = 7222.5024414062, y = 667.0 + 300 },
                  { x = 6391.1801757812, y = 868.0 + 300 },
                  { x = 5618.9975585938, y = 611.0 + 300 },
                  { x = 4649.0732421875, y = -162.0 + 300 },
                  { x = 3526.9030761719, y = -473.0 + 300 },
                  { x = 2318.9113769531, y = -458.0 + 300 },
                  --左上
                  { x = 340.0 + 200, y = 413.52713012695 },
                  { x = 683.0 + 100, y = 1065.4448242188 },
                  --------------------
                  --左上
                  { x = 721.0 + 10, y = 1167.0 },
                  { x = 695.0 + 10, y = 1205.0 },
                  { x = 677.0 + 10, y = 1228.0 },
                  { x = 659.0 + 10, y = 1275.0 },
                  { x = 674.0 + 10, y = 1330.0 },
                  --左下
                  { x = 683.0, y = 1360.0 - 10 },
                  { x = 711.0, y = 1393.0 - 10 },
                  { x = 738.0, y = 1429.0 - 10 },
                  { x = 779.0, y = 1456.0 - 10 },
                  { x = 796.0, y = 1463.0 - 10 },
                  --正左
                  { x = 796.0 + 10, y = 1463.0 - 10 },
                  --左上
                  { x = 796.0 + 50, y = 1463.0 },
                  { x = 639.0 + 300, y = 2469.796875 },
                  --正左
                  { x = 944.0 + 300, y = 3704.0 - 300 },
                  { x = 2048.0 + 300, y = 5113.0 - 300 },
                  { x = 2257.0 + 300, y = 5795.0 - 300 },
                  --左上
                  { x = 2257.0 + 300, y = 5795.7416992188 },
                  --正上
                  { x = 2256.0 + 1000, y = 5794.0 + 1000 },
                  { x = 2070.0 + 1000, y = 5991.0 + 1000 },
                  { x = 1586.0 + 1000, y = 6201.0 + 1000 },
                  { x = 1310.0 + 1000, y = 6172.0 + 1000 },
                  { x = -3224.0 + 1000, y = 7775.0 + 1000 },
                  { x = -3450.0 + 1000, y = 7933.0 + 1000 },
                  { x = -4496.0 + 1000, y = 8780.0 + 1000 },
                  { x = -6014.0 + 1000, y = 9104.0 + 1000 },
                  --右上
                  { x = -6015.197265625, y = 9104.0 + 1000 },
                  { x = -6431.9047851562, y = 9072.0 + 1000 },
                  { x = -7102.146484375, y = 9177.0 + 1000 },
                  { x = -7783.044921875, y = 9210.0 + 1000 },
                  { x = -14838.462890625, y = -36701.0 + 1000 },
                  { x = -9081.875, y = 8883.0 + 1000 },
                  { x = -10540.44140625, y = 9022.0 + 1000 },
                  { x = -11854.198242188, y = 8944.0 + 1000 },
                  { x = -15180.28515625, y = 6413.0 + 1000 },
                  { x = -16041.75390625, y = 6586.0 + 1000 },
                  { x = -17567.71875, y = 6243.0 + 1000 },
                  { x = -17821.19140625, y = 6141.0 + 1000 },
                  --正右
                  { x = -17821.0 - 1000, y = 6141.0 + 1000 },
                  --右下
                  { x = -17820.0 - 1000, y = 6140.6201171875 },
                  { x = -17930.0 - 1000, y = 5520.1889648438 },
                  { x = -18277.0 - 1000, y = 4885.4516601562 },
                  { x = -17924.0 - 1000, y = 3439.4992675781 },
                  { x = -16620.0 - 1000, y = 1168.1887207031 },
                  --正下
                  { x = -16619.0 - 1000, y = 1169.0 - 1000 },
                  { x = -16112.0 - 1000, y = 260.0 - 1000 },
                  { x = -15006.0 - 1000, y = -1324.0 - 1000 },
                  { x = -13497.0 - 1000, y = -2928.0 - 1000 },
                  { x = -12515.0 - 1000, y = -3928.0 - 1000 },
                  { x = -12086.0 - 1000, y = -5001.0 - 1000 },
                  { x = -10715.0 - 1000, y = -6697.0 - 1000 },
                  { x = -4609.0 - 1000, y = -11963.0 - 1000 },
                  --左下
                  { x = -4610.6625976562, y = -11963.0 - 1000 },
                  { x = -3606.9401855469, y = -12005.0 - 1000 },
                  { x = -3279.5549316406, y = -11531.0 - 1000 },
                  { x = 2917.6875, y = -8038.0 - 1000 },
                  { x = 5830.0849609375, y = -7412.0 - 1000 },
                  --正左
                  { x = 5829.0 + 1000, y = -7416.0 - 1000 },
                  { x = 6091.0 + 1000, y = -7360.0 - 1000 },
                  { x = 6494.0 + 1000, y = -6831.0 - 1000 },
                  { x = 6805.0 + 1000, y = -6471.0 - 1000 },
                  { x = 7488.0 + 1000, y = -2315.0 - 1000 },
                  { x = 7773.0 + 1000, y = 434.0 - 1000 },

              }
            },
            { name = '妮亚村-海滩',--z 626
              area = {
                  --左上
                  { x = 2950.0 + 20, y = 2988.0 - 10 },
                  { x = 2989.0 + 20, y = 3043.0 - 10 }, --false
                  { x = 2965.0 + 20, y = 3104.0 - 10 }, --false
                  { x = 2931.0 + 20, y = 3198.0 - 10 },
                  --正上
                  { x = 2931.0 + 300, y = 3198.0 + 300 },
                  { x = 2404.0 + 300, y = 3432.0 + 300 },
                  { x = 1942.0 + 300, y = 3479.0 + 300 },
                  --正右
                  { x = 1942.0 - 300, y = 3479.0 + 300 },
                  { x = 1679.0 - 300, y = 2972.0 + 300 },
                  { x = 1390.0 - 300, y = 1470.0 + 300 },
                  { x = 1378.0 - 300, y = 1104.0 + 300 },
                  --正下
                  { x = 1378.0 - 300, y = 1104.0 - 300 },
                  { x = 1799.0 - 300, y = 891.0 - 300 },
                  { x = 2017.0 - 300, y = 878.0 - 300 },
                  --正左
                  { x = 2017.0 + 300, y = 878.0 - 300 },
                  { x = 2566.0 + 300, y = 1338.0 - 300 },
                  { x = 2831.0 + 300, y = 1677.0 - 300 },
                  --左上
                  { x = 2832.0 + 300, y = 1630.6740722656 },
                  { x = 2765.0 + 300, y = 1942.8395996094 },
                  { x = 2588.0 + 300, y = 2221.5949707031 },
                  { x = 2506.0 + 300, y = 2565.8056640625 },
                  --左下
                  { x = 2613.0, y = 3039.0 - 300 },
                  { x = 2968.0, y = 2986.0 - 300 },
                  --正左
                  { x = 2968.0 + 10, y = 2986.0 - 10 },
                  { x = 2987.0+10, y = 3046.0-10, },
              },
              min_cz = 0,
              overlap = {
                  ['妮亚村-海滩楼梯'] = 627,
              }
            },
            { name = '妮亚村-海滩楼梯', --634
              area = {
                  --正左
                  { x = 1471.0+10, y = 1167.0-10 },
                  --左上
                  { x = 1552.0+10, y = 1284.3845214844 },
                  --正上
                  { x = 1502.0+10, y = 1415.0+10 },
                  { x = 991.0+10, y = 1415.0+10 },
                  --右上
                  { x = 852.18420410156, y = 1458.0+10 },
                  --正右
                  { x = 728.0-10, y = 1393.0+10 },
                  --右下
                  { x = 704.0-10, y = 1287.4118652344 },
                  --正下
                  { x = 744.0-10, y = 1172.0-10 },
                  { x = 1255.0-10, y = 1172.0-10 },
                  --左下
                  { x = 1376.9666748047, y = 1117.0-10 },
                  --z = 634
              },
              min_cz = 634,
            },
            { name = '妮亚村-船',
              area = {
                  --左下
                  { x = 3022.390625, y = 2169.0-500 },
                  { x = 3420.4753417969, y = 1812.0-500 },
                  { x = 3860.8649902344, y = 1691.0-500 },
                  { x = 4400.87109375, y = 1703.0-500 },
                  --正左
                  { x = 4871.0+500, y = 1841.0-500 },
                  --左上
                  { x = 5375.0+500, y = 2297.0 },
                  { x = 5822.0+500, y = 2957.8000488281 },
                  { x = 5875.0+10, y = 3764.0002441406 },

                  --正上
                  { x = 5732.0+5, y = 4263.0+5 },
                  { x = 5631.0+5, y = 4429.0+5 },
                  --右上
                  { x = 5333.865234375, y = 4883.0+10 },
                  { x = 4840.7211914062, y = 5107.0+500 },
                  --右下
                  { x = 4093.0-500, y = 4973.4716796875 },
                  { x = 3453.0-500, y = 4162.0478515625 },
                  --正下
                  { x = 3005.0-5, y = 3160.0-5 },
                  { x = 3003.0-5, y = 2964.0-5 },

              }
            },
            { name = '妮亚村-监狱',
              area = {
                  --左上
                  { x = 10146.0+300, y = 5351.5063476562 },
                  { x = 10122.0+300, y = 5705.4887695312 },
                  --正上
                  { x = 9949.0+300, y = 5860.0+300 },
                  { x = 9397.0+300, y = 6765.0+300 },
                  { x = 8758.0+300, y = 6988.0+300 },
                  --右上
                  { x = 8758.0, y = 6988.0+300 },
                  { x = 7599.0, y = 6873.0+300 },
                  --正右
                  { x = 7599.0-300, y = 6873.0+300 },
                  { x = 7354.0-300, y = 6471.0+300 },
                  { x = 7085.0-300, y = 6158.0+300 },
                  { x = 6552.0-300, y = 5323.0+300 },
                  { x = 6015.0-300, y = 4872.0+300 },
                  { x = 5644.0-50, y = 4409.0+50 },
                  --右下
                  { x = 5644.0-50, y = 4409.0 },
                  --正下
                  { x = 5644.0-2, y = 4409.0-2 },
                  { x = 5687.0+2, y = 4341.0+2 },--true
                  { x = 5703.0-2, y = 4312.0-2 },
                  --正左
                  { x = 5703.0+300, y = 4312.0-300 },
                  { x = 6567.0+300, y = 4630.0-300 },
                  { x = 8104.0+300, y = 4156.0-300 },
                  { x = 9149.0+300, y = 4252.0-300 },
                  { x = 10042.0+300, y = 5238.0-300 },
              }
            },
        },

        ['悠浅海路'] = {
            { name = '悠浅海路-中央广场',
              area = {
                  --正上
                  { x = 6157.0 + 300, y = 25638.0 + 300 },
                  { x = 6115.0 + 300, y = 25774.0 + 300 },
                  { x = 5906.0 + 300, y = 25925.0 + 300 },
                  --右上
                  { x = 5906.455078125, y = 25925.0 + 300 },
                  { x = 5685.5083007812, y = 25928.0 + 300 },
                  { x = 5333.0048828125, y = 25897.0 + 300 },
                  { x = 5054.3686523438, y = 25900.0 + 300 },
                  --正右
                  { x = 5054.0 - 300, y = 25900.0 + 300 },
                  { x = 3852.0 - 300, y = 24078.0 + 300 },
                  --右下
                  { x = 3890.0 - 300, y = 24087.810546875 },
                  { x = 3787.0 - 300, y = 23872.177734375 },
                  { x = 3214.0 - 300, y = 21306.427734375 },
                  { x = 2047.0 - 300, y = 16212.807617188 },
                  { x = 2057.0 - 300, y = 14307.94140625 },
                  --正下
                  { x = 2268.0 - 300, y = 13992.0 - 300 },
                  --左下
                  { x = 2272.2836914062, y = 13994.0 - 300 },
                  { x = 3778.0, y = 13301.0 - 300 },
                  { x = 3821.0, y = 13304.0 - 300 },
                  --正左
                  { x = 3821.0 + 300, y = 13304.0 - 300 },

                  --左上
                  { x = 3821.0 + 50, y = 13304.0 },
                  { x = 3818.0 + 50, y = 13438.0 },
                  { x = 3825.0 + 50, y = 13589.0 },
                  { x = 3823.0 + 50, y = 13799.2265625 },
                  { x = 4064.0 + 50, y = 14390.0 },
                  --左下
                  { x = 4632.2109375, y = 14298.0 - 300 },
                  { x = 5097.9985351562, y = 14344.0 - 300 },
                  { x = 5596.7924804688, y = 14064.0 - 300 },
                  { x = 6039.2900390625, y = 13895.0 - 300 },
                  { x = 8164.0, y = 14174.0 - 300 },
                  { x = 11420.588867188, y = 12610.0 - 300 },
                  { x = 11897.0, y = 12386.0 - 300 },
                  --正右
                  { x = 12153.0 - 300, y = 8928.0 + 300 },
                  { x = 11644.0 - 300, y = 7532.0 + 300 },
                  --右下
                  { x = 11502.0 - 300, y = 7485.0 },
                  --正下
                  { x = 11681.0 - 300, y = 7064.0 - 300 },
                  { x = 11744.0 - 300, y = 6804.0 - 300 },
                  { x = 11986.0 - 300, y = 6488.0 - 300 },
                  { x = 12139.0 - 300, y = 6328.0 - 300 },
                  { x = 12562.0 - 300, y = 5816.0 - 300 },
                  { x = 12758.0 - 300, y = 5487.0 - 300 },
                  { x = 12738.0 - 300, y = 5259.0 - 300 },
                  { x = 12769.0 - 300, y = 5013.0 - 300 },
                  { x = 13094.0 - 300, y = 4881.0 - 300 },
                  --左下
                  { x = 13088.038085938, y = 4896.0 - 300 },
                  --正左
                  { x = 13088.0 + 50, y = 4896.0 - 50 },
                  { x = 13109.0 + 50, y = 5087.0 - 50 },
                  --左上
                  { x = 13109.0 + 300, y = 5087.8037109375 },
                  --正下
                  { x = 14578.0 - 300, y = 6553.0 - 300 },

                  --右下
                  { x = 16401.0 - 300, y = 4846.0 },

                  --正下
                  { x = 16401.0 - 300, y = 4846.0 - 300 },
                  --左下
                  { x = 16424.0, y = 4829.0 - 50 },
                  { x = 16546.806640625, y = 4832.0 - 50 },
                  { x = 16727.0, y = 4852.0 - 50 },
                  --正左
                  { x = 16727.0 + 300, y = 4852.0 - 300 },
                  { x = 18516.0 + 300, y = 5747.0 - 300 },
                  --左上
                  { x = 18519.0 + 300, y = 5749.7924804688 },
                  { x = 18722.0 + 300, y = 6405.0 },
                  { x = 19343.0 + 300, y = 7749.66796875 },
                  { x = 19819.0 + 300, y = 8478.748046875 },
                  { x = 19827.0 + 300, y = 8637.8505859375 },
                  --正上
                  { x = 19824.0 + 300, y = 8640.0 + 300 },
                  { x = 18013.0 + 300, y = 10188.0 + 300 },
                  --右上
                  { x = 17895.0, y = 10316.0 + 300 },
                  { x = 17710.861328125, y = 10332.0 + 300 },
                  --左上
                  { x = 17294.0 + 300, y = 15341.495117188 },
                  { x = 18211.0 + 50, y = 17524.65234375 },
                  { x = 18336.0 + 50, y = 18026.734375 },
                  { x = 18408.0 + 50, y = 18448.611328125 },
                  { x = 18426.0 + 50, y = 18748.4921875 },
                  { x = 18434.0 + 50, y = 18887.0 },
                  { x = 17832.0 + 300, y = 19525.376953125 },
                  --正上
                  { x = 17832.0 + 300, y = 19525.0 + 300 },
                  { x = 16023.0 + 300, y = 22049.0 + 300 },
                  { x = 15292.0 + 300, y = 22876.0 + 300 },
                  { x = 14559.0 + 300, y = 23662.0 + 300 },
                  { x = 13730.0 + 300, y = 24366.0 + 300 },
                  { x = 12724.0 + 300, y = 24384.0 + 300 },


              }
            },
            { name = '悠浅海路-居民二楼',
              area = {

                  --左上
                  { x = 4550.0+50, y = 13512.0 },
                  { x = 4566.0+50, y = 13980.0 },
                  --右上
                  { x = 4566.0, y = 13980.0+50 },
                  { x = 4034.0, y = 13980.0+50 },
                  --右下
                  { x = 4034.0-50, y = 13980.0 },
                  { x = 4021.0-50, y = 13512.0 },
                  --左下
                  { x = 4021.0, y = 13512.0-50 },
                  { x = 4550.0, y = 13512.0-50 },

              }
            },
            { name = '悠浅海路-破船',
              area = {
                  --左上
                  { x = 19825.0+300, y = 18365.154296875 },
                  { x = 19517.0+300, y = 18932.55078125 },
                  --右上
                  { x = 19517.751953125, y = 18932.0+300 },
                  { x = 19371.849609375, y = 19017.0+300 },
                  { x = 19090.0, y = 18981.0+300 },
                  { x = 18611.0, y = 18878.0+300 },
                  --正右
                  { x = 18611.0-300, y = 18878.0+300 },
                  --右下
                  { x = 18611.0-50, y = 18878.0 },
                  { x = 18467.0-50, y = 18717.24609375 },
                  { x = 18466.0-50, y = 18556.197265625 },
                  { x = 18466.0-50, y = 18408.0 },
                  { x = 18603.0-50, y = 17323.0 },
                  { x = 18609.0-50, y = 17272.0 },
                  --左下
                  { x = 18609.0, y = 17272.0-50 },
                  { x = 18899.8671875, y = 17261.0-50 },
                  { x = 19489.060546875, y = 17438.0-50 },
                  { x = 19736.0, y = 17606.0-50 },
                  --左上
                  { x = 19736.0+300, y = 17606.0 },
              }
            },
            { name = '悠浅海路-灰色火山',
              area = {
                  --正上
                  { x = 16667.0+50, y = 4571.0+50 },
                  { x = 16564.0+50, y = 4694.0+50 },
                  --正右
                  { x = 16564.0-50, y = 4694.0+50 },
                  { x = 16482.0-50, y = 4641.0+50 },
                  { x = 16274.0-50, y = 4570.0+50 },
                  --右上
                  { x = 15713.0, y = 4481.0+50 },
                  { x = 15428.208984375, y = 4465.0+50 },
                  { x = 15005.0, y = 4440.0+50 },
                  { x = 13969.0, y = 4172.0+50 },
                  --正上
                  { x = 13321.0+50, y = 4852.0+50 },
                  --正右
                  { x = 13321.0-50, y = 4852.0+50 },
                  { x = 13243.0-50, y = 4845.0+50 },
                  { x = 13219.0-50, y = 4767.0+50 },
                  { x = 13207.0-50, y = 4643.0+50 },
                  { x = 13295.0-50, y = 4394.0+50 },
                  --正下
                  { x = 13295.0-50, y = 4394.0-50 },
                  { x = 13880.0-50, y = 3383.0-50 },
                  { x = 14822.0-50, y = 2877.0-50 },

                  --左下
                  { x = 14822.0, y = 2877.0-300 },
                  { x = 15519.0, y = 2643.0-300 },
                  --正左
                  { x = 16352.0+50, y = 3121.0-50 },
                  { x = 16538.0+50, y = 3608.0-50 },
                  { x = 16668.0+50, y = 4574.0-50 },
              }
            },
            { name = '悠浅海路-生命之林连接处',
              area = {
                  --左上
                  { x = 23672.0+50, y = 12455.0 },
                  { x = 23710.0+50, y = 12700.0 },
                  --正上
                  { x = 23710.0+300, y = 12700.0+300 },
                  { x = 23522.0+300, y = 12757.0+300 },
                  { x = 22628.0+300, y = 13250.0+300 },
                  { x = 22449.0+300, y = 13376.0+300 },
                  --正右
                  { x = 22449.0-300, y = 13376.0+300 },
                  { x = 22052.0-300, y = 13115.0+300 },
                  { x = 21897.0-300, y = 12564.0+300 },
                  { x = 20866.0-300, y = 11132.0+300 },
                  { x = 20653.0-300, y = 11039.0+300 },
                  --右下
                  { x = 20653.0-300, y = 11039.0 },
                  { x = 20728.0-300, y = 10883.0 },
                  { x = 20819.0-300, y = 10536.0 },
                  --正右
                  { x = 21230.0-300, y = 9421.0+300 },
                  { x = 20808.0-300, y = 8641.0+300 },
                  { x = 20760.0-300, y = 8533.0+300 },
                  --正下
                  { x = 20760.0-300, y = 8533.0-300 },
                  --左下
                  { x = 20760.0, y = 8533.0-300 },
                  { x = 20865.0, y = 8442.0-300 },
                  { x = 21734.0, y = 8578.0-300 },
                  { x = 22800.0, y = 8861.0-300 },
                  --正左
                  { x = 22800.0+300, y = 8861.0-300 },
                  { x = 22902.0+300, y = 9001.0 },--false
                  --左上
                  { x = 22800.0+300, y = 8861.0 },
                  { x = 22863.0+50, y = 9116.8681640625 },
                  { x = 22792.0+50, y = 9404.2353515625 },
                  { x = 22801.0+50, y = 10993.126953125 },
                  { x = 23024.0+50, y = 11072.19140625 },
                  { x = 23462.0+50, y = 12372.0 },
              }
            },
            { name = '悠浅海路-生命之林',
              area = {
                  --正上
                  { x = 27396.0+300, y = 10557.0+300 },
                  { x = 27169.0+300, y = 10880.0+300 },
                  { x = 26547.0+300, y = 11638.0+300 },
                  { x = 26507.0+300, y = 11869.0+300 },
                  { x = 25617.0+300, y = 13023.0+300 },
                  --右上
                  { x = 25271.0, y = 13060.0+300 },
                  --正右
                  { x = 25271.0-300, y = 13060.0+300 },
                  { x = 25051.0-300, y = 12804.0+300 },
                  { x = 24898.0-300, y = 12336.0+300 },
                  --右上
                  { x = 24020.974609375, y = 12332.0+300 },
                  --正右
                  { x = 24020.0-50, y = 12332.0+50 },
                  { x = 23896.0-50, y = 12306.0+50 },
                  { x = 23872.0-50, y = 12293.0+50 },
                  { x = 23880.0-50, y = 12053.0+50 },
                  { x = 23249.0-50, y = 11278.0+50 },
                  { x = 23180.0-50, y = 11092.0+50 },
                  { x = 23238.0-50, y = 10863.0+50 },
                  --正下
                  { x = 23238.0-300, y = 10863.0-300 },
                  { x = 23790.0-300, y = 9909.0-300 },
                  { x = 25181.0-300, y = 8926.0-300 },
                  --左下
                  { x = 25181.0, y = 8926.0-300 },
                  { x = 26022.0, y = 8825.0-300 },
                  { x = 26644.0, y = 8519.0-300 },
                  --左上
                  { x = 26672.0+300, y = 8547.0546875 },
                  { x = 27181.0+300, y = 8958.0 },
                  { x = 27308.0+300, y = 9398.4658203125 },
              }
            },
            { name = '悠浅海路-生命之林左下',
              area = {
                  --左上
                  { x = 23654.0+300, y = 6767.0908203125 },
                  { x = 23682.0+300, y = 7105.0 },
                  { x = 23568.0+300, y = 7774.412109375 },
                  { x = 22980.0+300, y = 8380.0 },
                  --正上
                  { x = 22980.0+50, y = 8380.0+50 },
                  { x = 22776.0+50, y = 8457.0+50 },
                  --右上
                  { x = 22695.654296875, y = 8296.0+300 },
                  --右下
                  { x = 22695.0-300, y = 8296.728515625 },
                  { x = 22471.0-300, y = 6984.728515625 },
                  { x = 22495.0-300, y = 6872.0 },
                  --正下
                  { x = 22495.0-300, y = 6872.0-300 },
                  { x = 23097.0-300, y = 6347.0-300 },
                  --左上
                  { x = 23097.0+300, y = 6347.0 },

              }
            },
        },

        ['大岩林'] = {
            {
                name  = '大岩林-西南上',
                area  = {
                    { x = 18428.0, y = 5579.0 },--起点
                    { x = 18100.0, y = 6205.0 },
                    { x = 15106.0, y = 8393.0 },
                    { x = 14315.0, y = 7900.0 },
                    { x = 13980.0, y = 6391.0 },
                    { x = 14174.0, y = 6259.0 },
                    { x = 14437.0, y = 6223.0 },
                    { x = 15482.0, y = 6187.0 },
                    { x = 15800.0, y = 6000.0 },
                    { x = 18028.0, y = 5179.0 },--闭点
                },
                min_cz = nil,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },--大岩林-西南上
            {
                name = '大岩林-西南中',
                area = {
                    { x = 14543.0, y = 6015.0 + 100 },
                    { x = 14221.0 - 300, y = 5941.0 },
                    { x = 14312.0, y = 5732.0 - 200 },
                    { x = 14656.0 + 300, y = 5872.0 },
                },
            },--大岩林-西南中
            {
                name = '大岩林-西南下-南中',
                area = {
                    { x = 14446.013671875 + 50, y = 5426.8818359375 },
                    { x = 14337.62890625, y = 5489.7666015625 },
                    { x = 12588.0 + 50 , y = 4804.0 },
                    { x = 13142.0 + 50 , y = 5995.0 },
                    { x = 13312.0 + 50 , y = 6995.3544921875 },
                    { x = 13325.0 + 500, y = 9106.0 + 500 },
                    { x = 10990.0, y = 10113.0 },-- 传送位置 高度 1535
                    { x = 10626.0, y = 11031.0 },
                    { x = 9653.9736328125, y = 12181.920898438 },
                    { x = 7475.0, y = 7740.0 },
                    { x = 7354.0 - 100, y = 7360.0 },
                    { x = 7463.0, y = 7247.0 - 50 },
                    { x = 8622.0, y = 7991.0 },
                    { x = 9082.0, y = 7651.0 },
                    { x = 8188.0, y = 6583.0 },
                    { x = 7412.0 - 200, y = 5523.0 },
                    { x = 7716.0 - 50, y = 3847.0 - 50 },
                    { x = 10647.0, y = 2027.0 },
                    { x = 11290.0, y = 1352.0 - 100 },
                    { x = 13875.0, y = 1065.0 - 500 },
                    { x = 14690.0, y = 1638.0 - 500 },
                    { x = 15735.0 + 500, y = 3532.0 + 500 },
                    { x = 14938.0 + 500, y = 4759.0 + 500 },
                },
            },--大岩林-西南下-南中
            {
                name = '大岩林-南下',
                area = {
                    { x = 7802.0, y = 3668.0 },--起点 传送位置
                    { x = 7631.0, y = 3797.0 },
                    { x = 6120.0 + 10, y = 5451.0 + 10},
                    { x = 5242.0, y = 6874.0 + 300 },
                    { x = 3402.0 - 300, y = 6596.0 + 300 },
                    { x = 2376.0 - 1000, y = 3947.0 },
                    { x = 3918.0 - 1000, y = 2929.0 },
                    { x = 5355.0, y = 2507.0 - 1000 },
                    { x = 6735.0, y = 2206.0 - 1000 },
                    { x = 7578.0 + 500, y = 2781.0 - 500 },
                    { x = 7802.0 + 500, y = 3668.0 - 500 },--起点 传送位置
                },
            },--大岩林-南下
            {
                name = '大岩林-北中',
                area = {
                    { x = 27289.0 - 30, y = 22422.0 - 30 },
                    { x = 28884.0, y = 22007.0 - 1000 },
                    { x = 30598.0 + 1000, y = 24684.0 - 1000 },
                    { x = 30241.0 + 100, y = 26231.0 + 100 },
                    { x = 30042.0 + 100, y = 27182.0 + 100 },
                    { x = 28975.0 + 1000, y = 29244.0 + 1000},
                    { x = 28497.0, y = 29584.0 + 3000 },
                    { x = 20267.0 - 1000, y = 28313.0 + 1000 },
                    { x = 18261.0 - 1000, y = 27168.0 + 1000 },
                    { x = 10328.0 - 3000, y = 16564.0 + 3000 },
                    { x = 10509.0 - 200, y = 12842.0 - 200 },
                    { x = 10640.0 - 200, y = 11716.0 - 200 },
                    { x = 10998.0 - 200, y = 10971.0 - 200 },
                    { x = 10929.0, y = 10326.0 },
                    { x = 11092.0, y = 10148.0 },
                    { x = 11489.0, y = 10202.0 - 100 },
                    { x = 14205.0, y = 10306.0 - 100 },
                    { x = 15916.0, y = 10149.0 - 200 },
                    { x = 17044.0, y = 9683.0  - 1500 },
                    { x = 18586.0 + 500, y = 10029.0 - 500 },
                    { x = 19936.0 + 500, y = 10350.0 - 500 },
                    { x = 21158.0 + 1000, y = 10447.0 - 1000 },
                    { x = 23428.0 + 5000, y = 12060.0 - 5000 },
                    { x = 24726.0 + 5000, y = 15116.0 - 5000 },
                    { x = 25340.0 + 1000, y = 17862.0 },
                    { x = 25551.0, y = 19287.0 },
                    { x = 25548.0, y = 19400.0 },--false
                    { x = 25528.0, y = 19521.0 },--false
                    { x = 25367.0, y = 20393.0 },
                    { x = 25527.0 + 500, y = 20933.0 },
                },
            },--大岩林-北中
        },

        ['沉默巨人之森'] = {--当前地图名:沉默巨人之森
            -- 岩石之乡-下 > 岩石之乡
            {
                name = '岩石之乡-下',
                area = {
                    { x = 6369.0 + 300, y = 1063.0 },
                    { x = 5972.6655273438 + 100, y = 1235.7308349609 + 100 },
                    { x = 5463.0, y = 1358.0 },
                    { x = 5111.0, y = 1415.0 },
                    { x = 4681.0, y = 1479.0 + 50 },
                    { x = 4381.0, y = 1465.0 + 20 },
                    { x = 4279.0, y = 1448.0 + 20 },
                    { x = 4167.0, y = 1360.0 + 20},
                    { x = 3425.0 - 500, y = 912.0 + 500 },
                    { x = 606.0 - 500, y = -2143.0 + 500 },
                    { x = -76.0 - 500, y = -3053.0 + 500 },
                    { x = -222.0 - 2000, y = -3457.0 },
                    { x = 430.0, y = -3869.0 - 5000 },
                    { x = 1846.5450439453 + 1000, y = -3586.0344238281 - 1000 },
                    { x = 2719.0 + 1000, y = -3451.0 - 1000 },
                    { x = 3818.0 + 1000, y = -3223.0 - 1000 },
                    { x = 4509.0 + 3000, y = -2666.0 },
                    { x = 5501.255859375 + 1000, y = -1061.9488525391 - 1000 },
                },
            },
            {
                name = '岩石之乡',
                area = {
                    { x = 5272.0, y = 2105.0 - 250 },
                    { x = 5929.2749023438 - 100, y = 1897.0104980469 - 100 },
                    { x = 6754.53515625 - 200, y = 1731.6262207031 - 200 },
                    { x = 7267.0 + 500, y = 1931.0 - 500 },
                    { x = 7910.0 + 1000, y = 2940.0 - 1000 },
                    { x = 8602.0 + 1000, y = 4965.0 - 1000 },
                    { x = 8854.3154296875, y = 7544.0537109375 },
                    { x = 8777.0810546875, y = 7549.0 }, --传送吊区域
                    { x = 8764.0, y = 7687.0 },--false 无区域
                    { x = 8767.0, y = 7673.0 },
                    { x = 8767.0, y = 7676.0 },--false 无区域
                    { x = 8747.33203125, y = 7698.9057617188 },--false 无区域
                    { x = 8746.0, y = 7700.0 },
                    { x = 8688.0, y = 7773.0 },
                    { x = 8626.0, y = 7853.0 },--false 无区域
                    { x = 8602.0, y = 7858.0 },
                    { x = 8406.0 - 100, y = 7685.0 + 100 },
                    { x = 5212.3935546875 - 200, y = 6737.3935546875 + 200 },
                    { x = 4835.3579101562 - 200, y = 6348.5263671875 + 200 },
                    { x = 3581.2963867188 - 50, y = 5338.9262695312 + 50 },
                    { x = 3507.0 - 50, y = 5272.0 + 50 },
                    { x = 3135.3229980469 - 100, y = 4316.6459960938 + 100},
                    { x = 2255.0, y = 4162.0 + 500 },
                    { x = 1135.0, y = 4936.0 + 200 },
                    { x = 97.818092346191, y = 4480.10546875 + 200 },
                    { x = -229.0, y = 4687.0 + 100 },
                    { x = -379.0, y = 4710.0 },
                    { x = -529.0 - 1000, y = 4195.0 },
                    { x = -181.0 - 1000, y = 3606.0 - 1000 },
                    { x = 1113.8498535156, y = 2493.0061035156 - 1000 },
                    { x = 2296.0, y = 2233.0 - 500 },
                    { x = 4010.0 - 100, y = 1574.0 - 100 },
                    { x = 4081.0 + 5, y = 1575.0 - 5 },
                    { x = 4210.0 + 5, y = 1676.0 - 5 },
                    { x = 4239.822265625 + 10, y = 1747.1938476562 },
                },
            },
            {
                name = '岩石之乡-升降-中间',
                area = {
                    { x = 9100.755859375 + 200, y = 7912.4077148438 },--false 无区域A----
                    { x = 8905.98046875, y = 8157.412109375 },--false 无区域
                    { x = 8796.7861328125, y = 8067.8178710938 },--false 无区域B----
                    { x = 8757.1328125, y = 8035.41015625 },--false 无区域
                    { x = 8720.2568359375, y = 8005.0302734375 },--false 无区域
                    { x = 8717.916015625, y = 8003.0517578125 },--false 无区域
                    { x = 8690.203125, y = 7980.3486328125 },--false 无区域
                    { x = 8682.6552734375, y = 7974.1733398438 },--false 无区域
                    { x = 8636.7900390625, y = 7936.5131835938 },--false 无区域
                    { x = 8633.734375, y = 7933.9794921875 },--false 无区域
                    { x = 8616.69140625, y = 7872.4643554688 },--false 无区域C------
                    { x = 8679.9990234375, y = 7786.109375 },--false 无区域
                    { x = 8691.73046875, y = 7775.1728515625 },--false 无区域
                    { x = 8736.5751953125, y = 7717.1889648438 },--false 无区域
                    { x = 8792.302734375, y = 7649.287109375 },--false 无区域
                    { x = 8809.8837890625, y = 7631.3916015625 },--false 无区域
                    { x = 8805.640625 + 20 , y = 7633.076171875 - 20 },--true 无区域D----
                },
            },
            {
                name = '岩石之乡-中间',
                area = {
                    { x = 14033.0, y = 15232.0 },
                    { x = 14037.0, y = 15392.0 },
                    { x = 14019.0, y = 15388.0 },--false 无区域
                    { x = 13955.0, y = 15558.0 },--false 无区域
                    { x = 13910.05078125, y = 15680.94921875 },--false 无区域
                    { x = 13873.0, y = 15734.0 },--false 无区域
                    { x = 13732.0, y = 15965.0 },--false 无区域
                    { x = 13742.0, y = 16430.0 + 500 },--false 无区域
                    { x = 12962.0, y = 17087.0 + 500 },--false 无区域
                    { x = 12474.0, y = 17410.0 + 500 },--false 无区域
                    { x = 10291.0 - 3000, y = 17162.0 + 3000 },--false 无区域
                    { x = 8226.0 - 3000, y = 16436.0 + 3000 },--false 无区域
                    { x = 7403.0 - 500, y = 15680.0 - 500 },--false 无区域
                    { x = 7524.0 - 1000, y = 15213.0 },--false 无区域
                    { x = 7332.0 - 1000, y = 14639.0 + 1000 },--false 无区域
                    { x = 6890.0 - 500, y = 13062.0 - 500 },--false 无区域
                    { x = 6793.0 - 500, y = 11811.0 + 500 },--false 无区域
                    { x = 5911.0, y = 11336.0 },--false 无区域
                    { x = 5911.0, y = 11177.0 },--false 无区域
                    { x = 5911.0, y = 11025.0 },--false 无区域
                    { x = 6216.0, y = 10793.0 - 300 },--false 无区域
                    { x = 7791.0 - 500, y = 9632.0 - 500 },--false 无区域
                    { x = 7779.0, y = 8815.0 },--false 无区域
                    { x = 8053.0, y = 8521.0 },--false 无区域
                    { x = 8455.0 - 100, y = 8153.0 - 100 },--false 无区域
                    { x = 8625.0, y = 7936.0 },--false 无区域
                    { x = 8766.0, y = 8045.0 },--false 无区域
                    { x = 8847.0, y = 8116.0 },--false 无区域
                    { x = 8833.0 + 100, y = 8406.0 + 100 },--false 无区域
                    { x = 9260.0 + 100, y = 9644.0 + 100 },--false 无区域
                },
                min_cz = -1450
            },
            {
                name = '岩石之乡-中间-跳跃1',
                area = {
                    { x = 7626.0 + 50, y = 9020.0 + 50 },
                    { x = 7594.0, y = 9086.0 },--true 岩石之乡-中间
                    { x = 7397.0 - 100, y = 9022.0 + 100 },--false 无区域
                    { x = 7440.0, y = 8929.0 },--false 无区域
                    { x = 7577.0, y = 8776.0 },--false 无区域
                    { x = 7702.0 + 100, y = 8767.0 - 100 },--false 无区域
                },
                min_cz = -1750
            },
            {
                name = '岩石之乡-中间-跳跃2',
                area = {
                    { x = 7761.0 + 30, y = 8544.0 + 30 },--true 无区域
                    { x = 7499.0, y = 8780.0 + 30 },--true 无区域
                    { x = 7415.0 - 30, y = 8864.0 + 30 },--false 无区域
                    { x = 7412.0 - 30, y = 8819.0 - 30 },--true 无区域
                    { x = 7420.0 - 30, y = 8599.0 - 30 },--true 无区域
                    { x = 7510.0 - 30, y = 8407.0 - 30 },--false 无区域
                    { x = 7669.0 + 100, y = 8315.0 - 100 },--false 无区域
                    { x = 7726.0 + 100, y = 8387.0 },--false 无区域
                    { x = 7768.0 + 50, y = 8517.0 },--true 无区域
                    { x = 7714.0, y = 8567.0 + 50 },--true 无区域
                },
                min_cz = -2157
            },
            {
                name = '托托克之臂',
                area = {
                    { x = 7315.0 + 20, y = 8664.0 + 20 },--true 无区域
                    { x = 7335.0 + 20, y = 8788.0 + 20 },--false 无区域
                    { x = 7323.0 + 20, y = 8670.0 + 20 },--false 无区域
                    { x = 7285.0 + 20, y = 9044.0 + 20 },--false 无区域
                    { x = 7237.0 + 20, y = 9121.0 + 20 },--false 无区域
                    { x = 7220.0, y = 9151.0 },--false 无区域
                    { x = 7015.0, y = 9688.0 },--false 岩石之乡-中间
                    { x = 6683.0, y = 9924.0 },--false 岩石之乡-中间
                    { x = 5799.9575195312, y = 9541.841796875 },--false 无区域
                    { x = 5567.0, y = 11058.0 },--false 无区域
                    { x = 5564.0, y = 11297.0 },--false 无区域
                    { x = 5648.0, y = 11590.0 },--false 无区域
                    { x = 6035.0, y = 11970.0 },--false 无区域
                    { x = 6230.0, y = 12314.0 },--false 无区域
                    { x = 6304.8461914062, y = 13061.733398438 },--false 无区域
                    { x = 5966.0, y = 13465.0 },--false 无区域
                    { x = 5781.0, y = 13618.0 },--false 无区域
                    { x = 4706.0, y = 13901.0 },--false 无区域
                    { x = 3520.0 - 3000, y = 14111.0 + 3000 },--false 无区域
                    { x = -2962.0 - 1000, y = 11133.0 + 1000 },--false 无区域
                    { x = -3616.9304199219 - 1000, y = 7779.4086914062 - 1000 },--false 无区域
                    { x = -2437.0 - 1000, y = 6754.0 - 1000 },--false 无区域
                    { x = -172.0, y = 5093.0 },--false 无区域
                    { x = 1067.0, y = 5614.0 },--false 无区域
                    { x = 2582.4875488281 + 500, y = 6428.587890625 - 500 },--false 无区域
                    { x = 5764.0 + 300, y = 7409.0 - 300 },--false 无区域
                    { x = 7272.0 + 300, y = 7989.0 - 300 },--false 无区域
                },
                min_cz = -2533
            },
            {
                name = '托托克之首-升降-中间2',
                area = {
                    { x = 14315.896484375, y = 15679.317382812 },--false 无区域
                    { x = 14178.700195312, y = 15953.939453125 },--false 无区域
                    { x = 13864.514648438, y = 15799.590820312 },--false 无区域
                    { x = 14003.032226562, y = 15522.241210938 },--false 无区域
                },
            },
            {
                name = '托托克之首-下',
                area = {
                    { x = 18454.0, y = 17675.0 },--false 无区域
                    { x = 18555.0, y = 17975.0 },--false 无区域
                    { x = 18526.43359375, y = 18179.123046875 },--false 无区域
                    { x = 17947.087890625, y = 18492.73828125 },--false 无区域
                    { x = 17664.0, y = 18608.0 },--false 无区域
                    { x = 14654.0, y = 18508.0 },--false 无区域
                    { x = 14779.0 + 500, y = 19966.0 - 500 },--false 无区域
                    { x = 15229.0, y = 20473.0 },--false 无区域
                    { x = 15314.0 + 50, y = 20592.0 },--false 无区域
                    { x = 15222.0 + 50, y = 20806.0 + 50 },--false 无区域
                    { x = 14968.0 - 2000, y = 20813.0 + 2000 },--false 无区域
                    { x = 14150.0 - 2000, y = 20514.0 + 2000 },--false 无区域
                    { x = 13565.0 - 2000, y = 19121.0 },--false 无区域
                    { x = 13795.0 - 500, y = 18110.0 - 500 },--false 无区域
                    { x = 14291.0 - 300, y = 16440.0 },--false 无区域
                    { x = 14247.0 - 100, y = 16061.0 },--false 无区域
                    { x = 14209.0, y = 15973.0 },--false 无区域
                    { x = 14335.0, y = 15702.0 },--false 无区域
                    { x = 14371.0, y = 15626.0 },--false 无区域
                    { x = 14660.0 + 1000, y = 15520.0 - 1000},--false 无区域
                    { x = 15856.0 + 1000, y = 15440.0 - 1000},--false 无区域
                    { x = 17473.0 + 1000, y = 16142.0 - 1000 },--false 无区域
                    { x = 17951.0 + 1000, y = 17086.0 },--false 无区域
                },
            },
            {
                name = '托托克之首-上',
                area = {
                    { x = 26845.0 + 10, y = 17366.0 + 10 },--false 无区域 --左上角传送节点
                    { x = 26856.0 + 10, y = 17507.0 + 10 },--false 无区域
                    { x = 26841.0 + 10, y = 17623.0 + 10 },--false 无区域
                    { x = 26718.0 + 50, y = 17840.0 + 50 },--false 无区域
                    { x = 25995.0 + 500, y = 18418.0 + 500 },--false 无区域
                    { x = 23859.0 + 1000, y = 22335.0 + 1000 },--false 无区域
                    { x = 23284.0 + 1000, y = 25159.0 + 1000 },--false 无区域
                    { x = 22481.462890625, y = 27088.765625 },--false 无区域
                    { x = 20185.0 - 1000, y = 26645.0 + 1000 },--false 无区域
                    { x = 14726.0 - 5000, y = 23747.0 + 5000 },--false 无区域
                    { x = 15313.0 - 50, y = 21153.0 - 50 },--false 无区域
                    { x = 15313.0 - 10, y = 20856.0 - 10 },--false 无区域
                    { x = 15364.0 - 10, y = 20702.0 - 10 },--false 无区域
                    { x = 15425.0 - 10, y = 20596.0 - 10 },--false 无区域
                    { x = 15957.0 - 300, y = 19956.0 - 300 },--false 无区域
                    { x = 16186.0 - 300, y = 19575.0 - 300 },--false 无区域
                    { x = 16517.0 + 500, y = 19599.0 - 500 },--false 无区域
                    { x = 18849.0 + 400, y = 19764.0 - 400 },--false 无区域
                    { x = 18903.0, y = 18232.876953125 },--false 无区域 -- 升降机
                    { x = 18903.0, y = 17961.0 },--false 无区域
                    { x = 19308.0, y = 17888.0 - 300 },--false 无区域
                    { x = 21526.0 + 300, y = 17519.0 - 300 },--false 无区域
                    { x = 22889.0 - 200, y = 16974.0 - 200 },--false 无区域
                    { x = 24169.0, y = 16753.0 - 300 },--false 无区域
                    { x = 26542.0 + 100, y = 17362.0 - 100 },--false 无区域
                },
            },
            {
                name = '托托克之肩',
                area = {
                    { x = 27297.0 + 1000, y = 14409.0 - 1000 },--false 无区域
                    { x = 27131.0 + 500, y = 15404.0 - 500 },--false 无区域
                    { x = 27485.0 + 500, y = 17298.0 },--false 无区域
                    { x = 27070.0, y = 17534.0 + 100 },--false 无区域
                    { x = 26942.0 - 10, y = 17620.0 + 10 },--false 无区域
                    { x = 26926.0 - 10, y = 17570.0 + 10 },--false 无区域
                    { x = 26954.0 - 10, y = 17454.0 - 10 },--false 无区域
                    { x = 26695.0 - 50, y = 16812.0 + 50},--false 无区域
                    { x = 25219.0 - 100, y = 16081.0 + 100 },--false 无区域
                    { x = 24773.0 - 100, y = 16086.0 + 100 },--false 无区域
                    { x = 24154.0 - 300, y = 15519.0 + 300 },--false 无区域
                    { x = 21754.0 + 200, y = 15718.0 },--false 无区域
                    { x = 22099.0 + 50, y = 16353.0 },--false 无区域
                    { x = 22178.0, y = 16813.0 },--false 无区域
                    { x = 22046.0, y = 16892.0 },--false 无区域
                    { x = 20659.6640625, y = 15701.151367188 },--false 无区域
                    { x = 20627.0 - 1000, y = 15310.0 - 1000 },--false 无区域
                    { x = 20743.0 - 1000, y = 13546.0 - 1000 },--false 无区域
                    { x = 22108.0 - 1000, y = 12464.0 - 1000 },--false 无区域
                    { x = 23724.0 - 1000, y = 12146.0 - 1000 },--false 无区域
                    { x = 24410.0 + 2000, y = 12261.0 - 2000 },--false 无区域
                },
                min_cz = 918
            },
            {
                name = '托托克之肩-中区',
                area = {
                    { x = 23836.0 + 130, y = 13296.0 },--false 岩石之乡-托托克之肩
                    { x = 23860.0 + 50, y = 13359.0 + 50 },--true 岩石之乡-托托克之肩
                    { x = 23849.0 + 50, y = 13330.0 },--true 岩石之乡-托托克之肩
                    { x = 23844.0 + 30, y = 13487.0 + 30 },--true 岩石之乡-托托克之肩
                    { x = 23619.0 - 20, y = 13517.0 + 20 },--false 岩石之乡-托托克之肩
                    { x = 23570.0 - 50, y = 13345.0 - 50 },--false 岩石之乡-托托克之肩
                },
                min_cz = 650
            },
            {
                name = '岩石之乡-中间3',
                area = {
                    { x = 9471.0 + 100, y = 14428.21875 },--false 岩石之乡-中间
                    { x = 9471.0 , y = 14428.0 + 100 },--false 岩石之乡-中间
                    { x = 9244.0, y = 14344.0 },--false 岩石之乡-中间
                    { x = 9200.0 - 100, y = 14231.0 },--false 岩石之乡-中间
                    { x = 9357.0, y = 14188.0 - 200 },--false 岩石之乡-中间
                },
                min_cz = -1735
            },
        },

        ['音之森'] = {
            {
                name  = '音之森-左上1',
                area  = {
                    { x = -5142.0 + 1500, y = 14645.0 }, --1
                    { x = -5194.0 + 1000, y = 15228.0 + 1000},--false 无区域
                    { x = -5282.0 - 500, y = 15143.0 + 500 },--true 无区域 2
                    { x = -5493.12109375 - 100, y = 15189.751953125 + 100 },--false 无区域 3
                    { x = -5499.0 - 10, y = 14789.0 - 10 },--false 音之森-左上2
                    { x = -5448.0, y = 14593.0 - 20 },--false 无区域
                },
                min_cz = 3520,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
            {
                name  = '音之森-左上2',
                area  = {
                    { x = -5565.0 + 100, y = 14708.0 },-- 1
                    { x = -5604.0, y = 15034.0 + 150 },--2
                    { x = -5926.0 - 50, y = 15109.0 + 50 },--true 无区域
                    { x = -6043.5014648438 - 100, y = 15206.994140625 + 100 },--3
                    { x = -6102.0 - 10, y = 15050.0 - 10 },--true 无区域
                    { x = -6104.0 - 10, y = 14853.0 - 10 },--false 无区域
                    { x = -6127.0 - 10, y = 14725.0 - 10 },--false 无区域
                    { x = -6079.0 - 10, y = 14581.0 - 10 },--false 无区域
                    { x = -6007.333984375 - 30, y = 14531.334960938 - 30 },--4
                    { x = -5680.0 + 100, y = 14506.0  - 100 },--false 无区域
                },
                min_cz = 3010,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
            {
                name = '音之森-全图',
                area = {
                    { x = -6128.310546875 + 30, y = 14538.794921875 },--false 无区域
                    { x = -6206.0 + 10, y = 14887.0 + 10 },--false 无区域
                    { x = -6212.0 + 10, y = 15097.0 + 10 },--false 无区域
                    { x = -6600.0 + 500, y = 16143.0 + 500 },--false 无区域
                    { x = -8154.0, y = 16751.0 },--false 无区域
                    { x = -14618.0, y = 18974.0 + 1000 },--false 无区域
                    { x = -17183.0, y = 19545.0 },--false 无区域
                    { x = -19355.41796875 - 5000, y = 17656.029296875 + 5000 },--false 无区域
                    { x = -20488.443359375 - 5000, y = 7499.9990234375 - 5000 },--false 无区域
                    { x = -17284.0 - 1000, y = -1205.0 - 1000 },--false 无区域
                    { x = -12520.240234375 + 3000, y = -1403.0 - 3000 },--false 无区域
                    { x = -11255.793945312 + 3000, y = -1323.0 + 3000 },--false 无区域
                    { x = -6020.0 + 1000, y = 1404.0 - 1000 },--false 无区域
                    { x = -4896.0 + 1000, y = 2062.0 + 1000 },--false 无区域
                },
                min_cz = 2480,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
        },

        ['薄暮之雾'] = {
            {
                name = '全图',
                area = {
                    { x = 20965.0 + 500 + 15000, y = 24396.0 + 500 - 15000},
                    { x = 20965.0 + 500 - 15000, y = 24396.0 + 500 + 15000},
                    { x = 5299.0 - 2000 - 15000, y = 6302.0 - 2000 + 15000 },
                    { x = 5299.0 - 2000 + 15000, y = 6302.0 - 2000 - 15000 },
                },
                min_cz  = 1,-- 指定了当前区的Z坐标[存在重叠区域时使用] 当前区域只与一个区域重叠 非多个
                overlap = {
                    ['阿郎'] = 1280, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['云峡-上'] = 1280,
                },
            },
            {
                name = '阿郎',
                area = {
                    { x = 24464.0 + 500, y = 17128.0 },--false 薄暮之雾-全图
                    { x = 24032.0, y = 18068.0 + 1000 },--false 薄暮之雾-全图
                    { x = 23425.0 - 500, y = 17596.0 + 500 },--false 薄暮之雾-全图
                    { x = 22801.0 - 80, y = 17194.0 },--false 薄暮之雾-全图
                    { x = 22821.0 - 10, y = 16936.0 - 10 },--false 薄暮之雾-全图
                    { x = 22883.0 - 20, y = 16853.0 - 20 },--false 薄暮之雾-全图
                    { x = 22982.0, y = 16697.0 - 30 },--false 薄暮之雾-全图
                    { x = 24153.0 + 200, y = 16731.0 - 200 },--false 薄暮之雾-全图
                },
                min_cz = 1780,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
            {
                name = '云峡-上',
                area = {
                    { x = 16193.0 + 50, y = 13274.0 },--true 薄暮之雾-全图
                    { x = 16217.0 + 10, y = 13411.0 + 10 },--false 薄暮之雾-全图
                    { x = 15907.0 + 0, y = 14050.0 + 200 },--false 薄暮之雾-全图
                    { x = 15533.0 - 200, y = 14245.0 + 200},--false 薄暮之雾-全图
                    { x = 15210.0 - 100, y = 14179.0 + 100 },--false 薄暮之雾-全图
                    { x = 14965.0 - 100, y = 13234.0 - 100 },--false 薄暮之雾-全图
                    { x = 15370.0 + 100, y = 13006.0 - 100 },--false 薄暮之雾-全图
                    { x = 15992.0 + 50, y = 13143.0 - 50 },--false 薄暮之雾-全图
                    { x = 16189.0 + 50, y = 13262.0 - 50 },--false 薄暮之雾-全图
                },
                min_cz = 1020,-- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
        },

        ['贫瘠通道'] = {
            {
                name = '卢芬港',
                area = {
                    { x = -16649.0 + 1500, y = 2222.0 - 1500 },--false 无区域
                    { x = -16751.0 + 1000, y = 2983.0 + 1000 },--false 无区域
                    { x = -18319.0 + 1000, y = 5303.0 + 1000 },--false 无区域
                    { x = -20992.0 + 200, y = 9216.0 + 200 },--false 无区域
                    { x = -21321.0 + 100, y = 9516.0 + 100 },--false 无区域
                    { x = -21392.0, y = 9476.0 },--false 无区域
                    { x = -21513.0, y = 9608.0 },--false 无区域-- 升降机
                    { x = -21671.96875, y = 9608.0 },--false 无区域
                    { x = -21741.0, y = 9608.0 },--false 无区域
                    { x = -22854.0 - 400, y = 9164.0 + 400 },--false 无区域
                    { x = -26185.0 - 500, y = 9596.0 + 500 },--false 无区域
                    { x = -28317.0 - 1000, y = 9596.0 + 1000 },--false 无区域
                    { x = -31180.0 - 1000, y = 6951.0 },--false 无区域
                    { x = -30804.0 - 1000, y = 5214.0 - 1000 },--false 无区域
                    { x = -29085.0, y = 3808.0 - 1000 },--false 无区域.
                    { x = -20811.0 + 2000, y = 1508.0 - 2000 },--false 无区域
                    { x = -19005.0 + 2000, y = 1412.0 - 2000 },--false 无区域
                },
                min_cz  = 700,-- 指定了当前区的Z坐标[存在重叠区域时使用] 当前区域只与一个区域重叠 非多个
                overlap = {},
            },
            {
                name = '卢芬港-升降机',
                area = {
                    { x = -21375.630859375 + 10, y = 10082.344726562 + 10 },--true 无区域
                    { x = -21441.630859375 + 5 , y = 10129.344726562 + 5 },--true 无区域

                    { x = -21822.630859375 - 5, y = 10145.344726562 + 5 },--false 无区域
                    { x = -21888.630859375 - 20, y = 10062.344726562 + 20 },--false 无区域

                    { x = -21881.630859375 - 20, y = 9687.3447265625 - 20},--false 无区域
                    { x = -21818.630859375 - 5, y = 9642.3447265625 - 5 },--false 无区域

                    { x = -21442.630859375 - 5, y = 9627.3447265625 - 5 },--false 无区域
                    { x = -21371.630859375 + 10, y = 9698.3447265625  },--false 无区域
                },
                overlap = {},
            },
            {
                name = '研究营地',
                area = {
                    { x = -9022.0 + 500, y = 12179.0 - 500 },--false 无区域
                    { x = -9079.9931640625, y = 12395.713867188 },--false 无区域
                    { x = -9174.0, y = 12489.0 },--false 无区域
                    { x = -9633.0, y = 12547.0 },--false 无区域
                    { x = -9644.0, y = 12775.0 },--false 无区域
                    { x = -9635.0, y = 13004.0 },--false 无区域
                    { x = -9659.0, y = 13211.0 },--false 无区域
                    { x = -8866.0, y = 13340.0 },--false 无区域
                    { x = -9159.0 + 1000, y = 14363.0 + 1000 },--false 无区域
                    { x = -7412.0 + 1000, y = 16069.0 - 1000 },--false 无区域
                    { x = -4844.0 + 2000, y = 20256.0 },--false 无区域
                    { x = -4516.0 + 1000, y = 22155.0 + 1000 },--false 无区域
                    { x = -4544.0 + 1000, y = 24722.0 + 1000 },--false 无区域
                    { x = -4665.0, y = 26010.36328125 },--false 无区域
                    { x = -5590.9106445312, y = 26108.0 },--false 无区域
                    { x = -5988.0, y = 26108.0 },--false 无区域
                    { x = -6165.0, y = 26024.0 },--false 无区域  升降机
                    { x = -6393.0, y = 26024.0 },--false 无区域
                    { x = -6597.0, y = 26032.0 },--false 无区域
                    { x = -6597.0, y = 26384.0 },--false 无区域
                    { x = -6645.0 + 0, y = 26480.0 + 200 },--false 无区域
                    { x = -6897.0 - 1000, y = 26408.0 + 1000 },--false 无区域
                    { x = -13788.0 + 500, y = 27134.0 + 500 },--false 无区域
                    { x = -16834.0 - 1000, y = 26247.0 + 1000 },--false 无区域
                    { x = -16908.0 - 500, y = 24328.0 - 500 },--false 无区域
                    { x = -17587.0  - 500, y = 19520.0 + 500 },--false 无区域
                    { x = -22140.0 + 500, y = 15648.0 + 500 },--false 无区域
                    { x = -22859.0 + 500, y = 17623.0 + 500 },--false 无区域
                    { x = -26535.0 + 110, y = 21863.0 + 110 },--false 无区域
                    { x = -23761.0 - 500, y = 22566.0 - 500 },--false 无区域
                    { x = -22365.0 + 200, y = 23254.0 - 200 },--false 无区域
                    { x = -21693.0, y = 23648.0 },--false 无区域-- 升降机
                    { x = -21477.0, y = 23753.0 },--false 无区域
                    { x = -21477.0, y = 23939.0 },--false 无区域
                    { x = -21814.0 - 200, y = 24020.0 + 200 },--false 无区域
                    { x = -23361.0 + 1000, y = 25621.0 + 1000 },--false 无区域
                    { x = -27107.0, y = 27548.0 + 2000 },--false 无区域
                    { x = -28024.0 - 1000, y = 26144.0 + 1000 },--false 无区域
                    { x = -27638.0 - 1000, y = 23993.0 },--false 无区域
                    { x = -28973.0 - 1000, y = 18496.0 },--false 无区域
                    { x = -29185.0 - 1000, y = 17476.0 - 1000 },--false 无区域
                    { x = -23999.0 - 500, y = 10034.0 },--false 无区域
                    { x = -23601.0 + 500, y = 10128.0 - 500 },--false 无区域
                    { x = -21825.0 - 100, y = 10304.0 - 100 },--false 无区域
                    { x = -21720.0, y = 10160.0 },--false 无区域--升降机
                    { x = -21534.0, y = 10160.0 },--false 无区域
                    { x = -21501.0 + 100, y = 10304.0 - 100 },--false 无区域
                    { x = -20282.0 - 300, y = 10153.0 - 300 },--false 无区域
                    { x = -18274.0, y = 8031.0 - 500 },--false 无区域
                    { x = -17600.0 + 500, y = 8273.0 - 500 },--false 无区域
                    { x = -14129.0 + 2000, y = 6907.0 - 2000 },--false 无区域
                },
                overlap = {
                    ['东北-升降机'] = 1955
                },
            },
            {
                name = '营地-升降机',
                area = {
                    { x = -20937.0 + 10, y = 24035.0 + 10},--false 无区域.
                    { x = -21001.0 + 10, y = 24103.0 + 10 },--false 无区域
                    { x = -21378.0 - 10, y = 24095.0 + 10 },--false 无区域
                    { x = -21439.0 - 10, y = 24037.0 + 10 },--false 无区域
                    { x = -21451.0 - 10, y = 23648.0 - 10 },--false 无区域
                    { x = -21397.0 - 10, y = 23594.0 - 10 },--false 无区域
                    { x = -21008.0 + 10, y = 23586.0 - 10 },--false 无区域
                    { x = -21008.0 + 10, y = 23586.0 + 10 },--false 无区域
                    { x = -20952.0 + 15, y = 23648.0 + 15 },--false 无区域
                },
            },
            {
                name = '营地-右上',
                area = {
                    { x = -19166.0 + 500, y = 23408.0 + 500 },--false 无区域
                    { x = -19166.0 + 1000, y = 23408.0 - 1000 },--false 无区域
                    { x = -20151.0 + 500, y = 24310.0 + 500 },--false 无区域
                    { x = -20151.0 - 300, y = 24310.0 + 300 },--false 无区域
                    { x = -20913.0 - 30, y = 23960.0 + 30 },--false 无区域 升降机
                    { x = -20913.0 - 5, y = 23732.0 - 5 },--false 无区域
                    { x = -20889.0, y = 23546.0 },--false 无区域
                    { x = -21033.0, y = 23495.0 },--false 无区域
                    { x = -21267.0 - 300, y = 23123.0 + 300 },--false 无区域
                    { x = -21267.0 - 500, y = 23123.0 - 500 },--false 无区域
                    { x = -23396.0 - 500, y = 20692.0 + 500 },--false 无区域
                    { x = -23396.0 - 500, y = 20692.0 - 500 },--false 无区域
                    { x = -21250.0 - 300, y = 18571.0 - 300 },--false 无区域
                    { x = -21250.0 + 500, y = 18571.0 - 500 },--false 无区域
                    { x = -19498.0 + 500, y = 22092.0 - 500 },--false 无区域
                },
            },
            {
                name = '哨所-升降机',
                area = {
                    { x = -9185.771484375 + 10, y = 12625.818359375 - 10 },--false 无区域
                    { x = -9119.771484375 + 10, y = 12700.818359375 },--false 无区域
                    { x = -9104.771484375, y = 13076.818359375 },--false 无区域
                    { x = -9166.771484375, y = 13138.818359375 + 10 },--false 无区域
                    { x = -9557.771484375 - 10, y = 13136.818359375 + 10 },--false 无区域
                    { x = -9608.771484375 - 5, y = 13065.818359375 + 5 },--false 无区域
                    { x = -9615.771484375 - 5, y = 12686.818359375 - 5 },--false 无区域
                    { x = -9547.771484375 - 20, y = 12637.818359375 - 20 },--false 无区域
                },
            },
            {
                name = '西北区域',
                area = {
                    { x = -7389.0 - 1000, y = 9268.0 - 1000 },--false 无区域
                    { x = -7389.0 + 1000, y = 9268.0 - 1000 },--false 无区域
                    { x = -3103.0 + 1000, y = 11103.0 - 1000 },--false 无区域
                    { x = -2307.0 + 1000, y = 12365.0 - 1000 },--false 无区域
                    { x = -2307.0 + 1000, y = 12365.0 + 1000 },--false 无区域
                    { x = -3610.0, y = 13546.0 + 1000 },--false 无区域
                    { x = -4479.0, y = 14030.0 + 1000 },--false 无区域
                    { x = -7938.0, y = 13409.0 + 500 },--false 无区域
                    { x = -8841.0 - 300, y = 13063.0 + 300 },--false 无区域
                    { x = -9069.0 - 50, y = 12987.0 + 50 },--false 无区域
                    { x = -9069.0 - 5, y = 12987.0 - 5 },--false 无区域
                    { x = -9069.0 - 5, y = 12895.0 - 5 },--false 无区域
                    { x = -9069.0 - 10, y = 12788.0 + 10 },--false 无区域
                    { x = -9069.0 - 5, y = 12788.0 - 5 },--false 无区域
                    { x = -8949.0 - 50, y = 12703.0 - 50 },--false 无区域
                    { x = -8001.0 - 200, y = 11228.0 - 200 },--false 无区域
                    { x = -7411.0 - 200, y = 10240.0 - 200 },--false 无区域
                },
                min_cz = 2600
            },
            {
                name = '东北-升降机',
                area = {
                    { x = -6042.4716796875 + 10, y = 26492.412109375 + 10 },--false 无区域
                    { x = -6116.4716796875 + 5, y = 26544.412109375 + 5 },--false 无区域
                    { x = -6493.4716796875 - 5, y = 26559.412109375 + 5 },--false 无区域
                    { x = -6559.4716796875 - 5, y = 26493.412109375 + 5 },--false 无区域
                    { x = -6553.4716796875 - 5, y = 26102.412109375 - 5 },--false 无区域
                    { x = -6495.4716796875 - 5, y = 26056.412109375 - 5 },--false 无区域
                    { x = -6118.4716796875 + 20, y = 26041.412109375 - 20 },--false 研究营地
                    { x = -6052.4716796875 + 20, y = 26108.412109375 - 20 },--false 无区域
                    { x = -6052.4716796875 + 10, y = 26108.412109375 + 10 },--false 无区域
                },
                overlap = {
                    ['研究营地'] = 1990
                },
            },
            {
                name = '东北区',
                area = {
                    { x = -4744.0 + 500, y = 26772.0 },--false 无区域
                    { x = -4744.0 + 1000, y = 26772.0 + 1000 },--false 无区域
                    { x = -4876.0 + 500, y = 28525.0 + 500 },--false 无区域
                    { x = -5448.0 + 1000, y = 29435.0 + 1000 },--false 无区域
                    { x = -5448.0, y = 29435.0 + 1000 },--false 无区域
                    { x = -5985.0, y = 29421.0 + 1000 },--false 无区域
                    { x = -6524.0, y = 28421.0 + 1000 },--false 无区域.
                    { x = -6702.0 - 500, y = 26828.0 + 500 },--false 无区域
                    { x = -6702.0 - 100, y = 26828.0 - 100 },--false 无区域
                    { x = -6561.0 - 50, y = 26712.0 - 50 },--false 无区域
                    { x = -6393.0 - 30, y = 26588.0 },--false 无区域
                    { x = -6393.0 - 10, y = 26588.0 - 10 },--false 无区域
                    { x = -6201.0 + 20, y = 26588.0 - 20 },--false 无区域
                    { x = -5805.0 - 50, y = 26708.0 - 50 },--false 无区域
                    { x = -5517.0 - 50, y = 26712.0 - 50 },--false 无区域
                    { x = -5349.0 - 50, y = 26588.0 - 50 },--false 无区域
                    { x = -5349.0 + 20, y = 26588.0 - 20 },--false 无区域
                    { x = -5169.0 - 10, y = 26588.0 - 10 },--false 无区域
                    { x = -5169.0 + 10, y = 26588.0 + 10 },--false 无区域
                },
                overlap = {

                },
            },
        },

        ['分裂之地'] = {
            {
                name = '斯特恩入口',
                area = {
                    { x = 4775.0, y = 9649.0 },--false 无区域 --轨道
                    { x = 4775.0, y = 9813.0 },--false 无区域
                    { x = 4631.0, y = 9925.0 },--false 无区域
                    { x = 4254.92578125, y = 10141.515625 },--false 无区域
                    { x = 4610.0, y = 10152.0 },--false 无区域
                    { x = 4599.0, y = 10613.0 },--false 无区域
                    { x = 4232.0 - 100, y = 10709.0 + 100 },--false 无区域
                    { x = 1729.0 - 500, y = 10129.0 + 500 },--false 无区域
                    { x = 1487.0 - 500, y = 9652.0 + 500 },--false 无区域
                    { x = 1487.0 - 1000, y = 9652.0 },--false 无区域
                    { x = 1503.0 - 1000, y = 8487.0 + 1000 },--false 无区域
                    { x = 1503.0 - 1000, y = 8487.0 - 1000 },--false 无区域
                    { x = 1503.0, y = 8487.0 - 1000 },--false 无区域
                    { x = 4154.0 + 1000, y = 8276.0 - 1000 },--false 无区域
                    { x = 4154.0 + 50, y = 8276.0 + 50 },--false 无区域
                    { x = 4631.0 + 30, y = 8419.0 + 20 },--false 无区域
                    { x = 4775.0, y = 8529.0 },--false 无区域
                    { x = 4775.0, y = 8677.0 },--false 无区域
                },
            },
            {
                name = '单轨1',
                area = {
                    { x = 8183.0317382812 + 50, y = 9479.353515625 - 50 },--false 无区域
                    { x = 8236.0205078125, y = 9545.353515625 },--false 无区域

                    { x = 8246.99609375, y = 9932.357421875 },--false 无区域
                    { x = 8187.0083007812 + 20, y = 9996.357421875 + 20 },--false 无区域

                    { x = 4862.994140625 - 30, y = 9991.353515625 + 30 },--false 无区域
                    { x = 4817.0034179688 - 10, y = 9924.353515625 + 10 },--false 无区域
                    { x = 4817.0034179688 - 5, y = 9924.353515625 - 5 },--false 无区域

                    { x = 4801.0009765625, y = 9545.357421875 },--false 无区域
                    { x = 4866.9916992188 - 20, y = 9479.357421875 - 20 },--false 无区域
                    { x = 4866.9916992188 + 20, y = 9479.357421875 - 20 },--false 无区域
                },
            },
            {
                name = '主区',
                area = {
                    { x = 24933.0 - 50, y = 12200.0 - 50 },--false 无区域
                    { x = 24933.0 + 50, y = 12200.0 - 50 },--false 无区域
                    { x = 25660.0 - 50, y = 12427.0 - 50 },--false 无区域
                    { x = 25660.0 + 50, y = 12427.0 - 50 },--false 无区域
                    { x = 26475.0 - 200, y = 12181.0 - 200 },--false 无区域
                    { x = 26475.0 + 200, y = 12181.0 - 200 },--false 无区域
                    { x = 27296.0 - 50, y = 11718.0 - 50 },--false 无区域
                    { x = 27296.0 + 100, y = 11718.0 - 100 },--false 无区域
                    { x = 29126.0 + 1000, y = 13457.0 - 1000 },--false 无区域.
                    { x = 29126.0 + 1500, y = 13457.0 + 1500 },--false 无区域
                    { x = 29897.0 + 1000, y = 25624.0 - 1000 },--false 无区域
                    { x = 29897.0 + 500, y = 25624.0 + 500 },--false 无区域
                    { x = 28782.0 + 1000, y = 28641.0 - 1000 },--false 无区域
                    { x = 28782.0 + 1000, y = 28641.0 + 1000 },--false 无区域
                    { x = 28782.0, y = 28641.0 + 1000 },--false 无区域
                    { x = 11043.0 + 1000, y = 29158.0 + 1000 },--false 无区域
                    { x = 11043.0 - 1000, y = 29158.0 + 1000 },--false 无区域
                    { x = 1730.0 + 1000, y = 29745.0 + 1000 },--false 无区域
                    { x = 1730.0 - 200, y = 29745.0 + 200 },--false 无区域
                    { x = 1730.0 - 1000, y = 29745.0 - 1000 },--false 无区域
                    { x = 1998.0 - 10000, y = 27746.0 - 10000 },--false 无区域
                    { x = 10953.0 - 500, y = 13050.0 + 500 },--false 无区域
                    { x = 9062.0 + 100, y = 11060.0 + 100 },--false 无区域
                    { x = 9062.0 - 100, y = 11060.0 + 100 },--false 无区域
                    { x = 8066.0 - 100, y = 10885.0 + 100 },--false 无区域
                    { x = 8067.0, y = 9985.0 },--false 单轨1
                    { x = 8151.0, y = 9985.0 },--false 单轨1
                    { x = 8275.0, y = 9877.0 },--false 无区域
                    { x = 8275.0, y = 8433.0 },--false 无区域
                    { x = 8020.1748046875, y = 7941.1005859375 },--false 无区域
                    { x = 8067.0 - 500, y = 7425.0 - 500 },--false 无区域
                    { x = 10394.0 - 1000, y = 3449.0 - 1000 },--false 无区域
                    { x = 10394.0 + 1000, y = 3449.0 - 1000 },--false 无区域
                    { x = 12425.0 + 1000, y = 3030.0 - 1000 },--false 无区域
                    { x = 12537.0, y = 3411.0 },--false 无区域
                    { x = 12598.0, y = 3841.0 },--false 无区域
                    { x = 12647.0, y = 3841.0 },--false 无区域
                    { x = 12647.0, y = 4195.2807617188 },--false 无区域
                    { x = 12040.0 + 100, y = 4197.0 + 100},--false 无区域
                    { x = 12259.0 - 30, y = 5489.0 - 30 },--false 无区域
                    { x = 12596.0, y = 5489.0 },--false 无区域
                    { x = 12584.0, y = 5772.0 },--false 无区域
                    { x = 12551.0, y = 5950.0 },--false 无区域
                    { x = 12633.0, y = 6033.0 },--false 无区域
                    { x = 13463.0, y = 6931.0 },--false 无区域
                    { x = 13125.0, y = 7285.0 },--false 无区域
                    { x = 13062.0, y = 7317.0 },--false 无区域
                    { x = 13205.0, y = 7456.0 },--false 无区域
                    { x = 13421.3671875, y = 7669.1020507812 },--false 无区域
                    { x = 13384.0, y = 7937.0 },--false 无区域
                    { x = 13449.279296875, y = 7993.04296875 },--false 无区域
                    { x = 14247.0, y = 8798.0 },--false 无区域
                    { x = 15275.0 + 50, y = 9303.0 - 50 },--false 无区域
                    { x = 16443.0 + 200, y = 9654.0 - 200 },--false 无区域
                    { x = 20352.0 + 500, y = 12228.0 - 500 },--false 无区域
                    { x = 21535.0 + 300, y = 12718.0 - 300 },--false 无区域
                    { x = 23175.0 + 300, y = 13005.0 - 300 },--false 无区域
                },
            },
            {
                name = '升降机',--0xFE71B
                area = {
                    { x = 13813.349609375 + 10, y = 7344.1450195312 + 10 },--false 无区域
                    { x = 13814.056640625 + 10, y = 7431.1186523438 + 10},--false 无区域
                    { x = 13546.0625 + 10, y = 7699.1127929688 + 10 },--false 无区域
                    { x = 13460.50390625 + 10, y = 7688.5053710938 + 10 },--false 无区域
                    { x = 13460.50390625 - 5, y = 7688.5053710938 + 5 },--false 无区域
                    { x = 13179.78125 - 5, y = 7423.3413085938 + 5 },--false 无区域
                    { x = 13184.025390625 - 10, y = 7330.0029296875 - 10 },--false 无区域
                    { x = 13448.482421875 - 10, y = 7065.5444335938 - 10 },--false 无区域
                    { x = 13448.482421875 + 20, y = 7065.5444335938 - 20 },--false 无区域---
                    { x = 13548.890625 + 5, y = 7086.7573242188 - 5 },--false 无区域
                },
            },
            {
                name = '法力中继站-左',
                area = {
                    { x = 17079.0, y = 5761.0 },--true 无区域
                    { x = 17079.0, y = 5925.0 },--false 无区域
                    { x = 16919.0 + 50, y = 6019.0 + 50 },--false 无区域
                    { x = 16563.0 + 50, y = 6005.0 + 50 },--false 无区域
                    { x = 16489.0 + 100, y = 7235.0 + 100 },--false 无区域
                    { x = 16051.0 + 100, y = 7748.0 + 100 },--false 无区域
                    { x = 16051.0 - 100, y = 7748.0 + 100 },--false 无区域
                    { x = 14684.0 + 100, y = 7983.0 + 100 },--false 无区域
                    { x = 14684.0 - 100, y = 7983.0 + 100 },--false 无区域
                    { x = 13912.0 - 50, y = 7193.0 + 50 },--false 无区域
                    { x = 13745.0 - 10, y = 7236.0 + 10 },--false 无区域
                    { x = 13644.0 - 10, y = 7135.0 + 10 },--false 无区域
                    { x = 13536.0 - 20, y = 6862.0 + 20 },--false 无区域
                    { x = 12724.0 - 10, y = 6047.0 + 10 },--false 无区域
                    { x = 12739.0, y = 5167.0 },--false 无区域
                    { x = 12483.0, y = 5109.0 },--false 无区域
                    { x = 12468.0 - 10, y = 4659.0 - 10 },--false 无区域
                    { x = 12727.0 - 10, y = 4360.0 - 10 },--false 无区域
                    { x = 12739.0 - 10, y = 4132.0 - 10 },--false 无区域
                    { x = 12990.0 - 500, y = 4177.0 + 500 },--false 无区域
                    { x = 16551.0 - 500, y = 3848.0 + 500 },--false 无区域
                    { x = 16551.0 + 100, y = 3848.0 + 100 },--false 无区域
                    { x = 16735.0 + 10, y = 4730.0 + 10 },--false 无区域
                    { x = 16727.0 + 10, y = 5511.0 + 10 },--false 无区域
                    { x = 16919.0 + 30, y = 5649.0 },--false 无区域
                },
            },
            {
                name = '单轨2', --0xFE71C
                area = {
                    { x = 20529.6875 + 5, y = 6030.935546875 + 5 },--false 无区域
                    { x = 20468.748046875 + 10, y = 6098.935546875 + 10 },--false 无区域
                    { x = 20468.748046875 - 30, y = 6098.935546875 + 30 },

                    { x = 17154.275390625 - 30, y = 6086.9379882812 + 30 },--false 无区域
                    { x = 17108.23828125 - 5, y = 6024.9428710938 + 5 },--false 无区域

                    { x = 17095.20703125 - 5, y = 5640.9331054688 - 5 },--false 无区域
                    { x = 17158.291015625 - 30, y = 5577.9291992188 - 30 },--false 无区域

                    { x = 20464.673828125 + 20, y = 5581.955078125 - 20 },--false 无区域
                    { x = 20517.689453125 + 5 , y = 5651.935546875 },--false 无区域
                },
            },
            {
                name = '动力控制站', --0xFE71C
                area = {
                    { x = 25269.0 + 1000, y = 4309.0 - 1000 },--false 无区域
                    { x = 25269.0 + 1000, y = 4309.0 + 1000 },--false 无区域
                    { x = 29418.0 + 500, y = 7143.0 - 500 },--false 无区域
                    { x = 29418.0 + 500, y = 7143.0 + 500 },--false 无区域
                    { x = 29271.0 + 1000, y = 8469.0 + 1000 },--false 无区域
                    { x = 29271.0 - 1000, y = 8469.0 + 1000 },--false 无区域
                    { x = 26907.0 - 100, y = 8699.0 + 100 },--false 无区域
                    { x = 25634.0 + 500, y = 10257.0 + 500 },--false 无区域
                    { x = 25557.2109375, y = 12039.297851562 },--false 无区域
                    { x = 25263.0, y = 12006.0 },--false 无区域
                    { x = 24764.0, y = 11716.0 },--false 无区域
                    { x = 24373.197265625, y = 11821.459960938 },--false 无区域
                    { x = 23091.0, y = 12091.0 },--false 无区域
                    { x = 22185.916015625, y = 11691.638671875 },--false 无区域
                    { x = 22105.0, y = 11621.0 },--false 无区域
                    { x = 22083.0 - 500, y = 10093.0 + 500 },--false 无区域
                    { x = 22083.0 - 500, y = 10093.0 - 500 },--false 无区域
                    { x = 21555.0, y = 6339.0 },--false 无区域
                    { x = 20611.0, y = 6037.0 },--false 无区域
                    { x = 20547.0, y = 5973.0 },--false 无区域
                    { x = 20547.0, y = 5649.0 },--false 无区域
                    { x = 20707.0 - 100, y = 5233.0 - 100 },--false 无区域
                    { x = 20678.0 - 300, y = 3722.0 + 300 },--false 无区域
                    { x = 20678.0 - 300, y = 3722.0 - 300 },--false 无区域
                    { x = 21503.0 - 200, y = 3446.0 - 200 },--false 无区域
                    { x = 21503.0 + 500, y = 3446.0 - 500 },--false 无区域
                    { x = 24274.0 - 200, y = 3662.0 - 200 },--false 无区域
                    { x = 24274.0 + 500, y = 3662.0 - 500 },--false 无区域
                    { x = 24857.0 + 200, y = 3651.0 - 200 },--false 无区域
                },
            },
        },

        ['清风丘陵'] = {
            {
                name = '清风丘陵半圆',
                area = {
                    { x = 3001.0 + 50, y = 3544 + 50, z = 1023.9996337891 },
                    { x = 2630 + 50, y = 4714 + 50, z = 1023.9998779297 },
                    { x = 2167 + 100, y = 5870 + 100, z = 1023.9997558594 },
                    { x = 3448.0 + 300, y = 7861.0 - 200, z = 1022.4017333984 },
                    { x = 3268.0 + 200, y = 8337.0, z = 1023.9998779297 },
                    { x = 3273 + 100, y = 9122 + 100, z = 1022.9998779297 },
                    { x = 2799.0+ 100, y = 9464.0 },--true 清风丘陵半圆
                    { x = 2825.0+ 100, y = 9917.2470703125 },--true 清风丘陵半圆
                    { x = 3207.0+100, y = 10315.0-100 },--true 清风丘陵半圆
                    { x = 3597.0 + 200, y = 10291.0, z = 1023.9997558594 },
                    { x = 4045.0 + 200, y = 10841.0, z = 1037.0441894531 },
                    { x = 3947.0, y = 10946.0 + 200, z = 1032.583984375 },
                    { x = 3226.0, y = 10664.0, z = 1023.9997558594 },
                    { x = 1771.0 + 200, y = 11354.0 + 200, z = 1022.9996337891 },
                    { x = 1333.0, y = 11410.0 + 200, z = 1022.9996337891 },
                    { x = 925.0 - 500, y = 11374.0 + 500, z = 1023.9996337891 },
                    { x = 793.0 - 500, y = 10525.0, z = 1023.9997558594 },
                    { x = 1376.0 - 1000, y = 7700.0 - 1000, z = 789.34899902344 },
                    { x = 1137.0 - 1000, y = 4308.0 - 1000, z = 1023.6149902344 },
                    { x = 2464.0 - 1000, y = 2860.0 - 1000, z = 1023.9997558594 },
                    { x = 2831.0, y = 2812.0 - 300, z = 1023.9996337891 },
                    { x = 3090.0 + 200, y = 2922.0 - 200, z = 1016.1015625 },
                    { x = 3032.0 + 200, y = 3242.4143066406, z = 1026.1608886719 },
                },
            },
            {
                name = '清风丘陵小左',
                area = {
                    { x = 3952.0 + 200, y = 5797.0 + 200, z = 2059.7360839844 },
                    { x = 3522.0, y = 5811.0 + 200, z = 2047.9997558594 },
                    { x = 3078.0 - 200, y = 5413.0 + 200, z = 2047.9997558594 },
                    { x = 2797.0 - 200, y = 4866.044921875, z = 2047.7331542969 },
                    { x = 3117.0 - 200, y = 4395.0 - 200, z = 2046.2956542969 },
                    { x = 3522.0, y = 4440.0 - 200, z = 2047.9997558594 },
                    { x = 3683.0 + 200, y = 4826.0 - 200, z = 2047.9997558594 },
                    { x = 3956.0 + 200, y = 5416.0, z = 2047.9997558594 },
                },

            },

            {
                name = '清风丘陵小右',
                area = {
                    { x = 4109.0 + 200, y = 9568.0 + 200, z = 1535.9997558594 },
                    { x = 3641.0 + 200, y = 9843.0 + 200, z = 1535.9997558594 },
                    { x = 3406.0, y = 9882.0 + 200, z = 1535.9997558594 },
                    { x = 3272.0 - 200, y = 9653.0 + 200, z = 1536.2298583984 },
                    { x = 3115.0 - 200, y = 9558.0, z = 1536.2298583984 },
                    { x = 3390.0 - 200, y = 9145.0 - 200, z = 1534.2655029297 },
                    { x = 3649.0 - 200, y = 8936.0 - 200, z = 1535.9998779297 },
                    { x = 3813.0 + 200, y = 8793.0 - 200, z = 1530.5802001953 },
                    { x = 4218.0 + 200, y = 9260.0 - 200, z = 1535.6437988281 },
                    { x = 4271.0 + 200, y = 9384.0, z = 1532.8935546875 },
                },
                min_cz = 1525,
            },
            {
                name = '清风丘陵圆环',
                area = {
                    { x = 7161.0 + 300, y = 10157.0 + 300, z = 1535.9998779297 },
                    { x = 6729.0, y = 10694.0 + 300, z = 1537.4683837891 },
                    { x = 5806.0 - 300, y = 10067.0 + 300, z = 1535.9997558594 },
                    { x = 5400.0 - 300, y = 9462.0, z = 1534.8936767578 },
                    { x = 5345.0 - 300, y = 9045.0, z = 1536.8934326172 },
                    { x = 5600.0 - 300, y = 8410.0 - 300, z = 1534.5541992188 },
                    { x = 5679.0 - 300, y = 7638.0 - 300 }, --false 无区域
                    { x = 6247.8872070312, y = 7391.0 - 300, z = 1535.9996337891 },
                    { x = 7322.0 + 300, y = 8185.0 - 300, z = 1536.0 },
                    { x = 7426.0 + 300, y = 9069.9169921875, z = 1535.9998779297 },
                }
            },
            {
                name = '清风丘陵大板块',
                area = {
                    { x = 25813.0 + 800, y = 9532.2490234375, z = 141.81582641602 },
                    { x = 25392.0 + 800, y = 16382.799804688, z = 136.93992614746 },
                    { x = 25507.0 + 800, y = 19827.224609375, z = -86.788955688477 },
                    { x = 24489.0 + 800, y = 22524.0 + 800, z = 38.350967407227 },
                    { x = 21662.0, y = 25103.0 + 800, z = 393.79675292969 },
                    { x = 19104.0, y = 25523.0 + 800, z = -104.39808654785 },
                    { x = 15917.0, y = 24416.0 + 800, z = -120.71073913574 },
                    { x = 12643.0, y = 24398.0 + 800, z = 127.0143737793 },
                    { x = 6484.0 - 800, y = 24478.0 + 800, z = 135.29522705078 },
                    { x = 5395.0 - 800, y = 23751.646484375, z = 134.76840209961 },
                    { x = 5646.0 - 800, y = 20620.0, z = -1.4498901367188 },
                    { x = 5116.0 - 800, y = 17660.0, z = -9.918212890625e-05 },
                    { x = 5732.0 - 800, y = 12649.0 - 800, z = 517.73431396484 },
                    { x = 8461.0 - 800, y = 12970.0 - 800, z = 510.99987792969 },
                    { x = 8163.0 - 800, y = 12087.0 - 800, z = 510.63885498047 },
                    { x = 8965.0 - 800, y = 11181.0 - 800, z = 509.81878662109 },
                    { x = 9454.0 - 800, y = 9711.9931640625, z = 767.99981689453 },
                    { x = 9418.0 - 800, y = 8742.599609375, z = 766.99981689453 },
                    { x = 8577.0 - 800, y = 5976.0 + 800, z = 1023.9998779297 },
                    { x = 6180.0 - 800, y = 5156.0 + 800, z = 1023.7875976562 },
                    { x = 5407.0 - 800, y = 3889.0 + 800, z = 1024.6846923828 },
                    { x = 3713.0 - 300, y = 2727.0 + 300, z = 1021.8175048828 },
                    { x = 3764.0 - 300, y = 2541.0, z = 1021.8225097656 },
                    { x = 4868.0 - 300, y = 1713.0 - 300, z = 1023.9997558594 },
                    { x = 5491.87109375, y = 1557.9196777344 - 300, z = 1021.7545166016 },
                    { x = 6376.0 + 800, y = 1764.0 - 800, z = 1023.9997558594 },
                    { x = 10098.0 + 800, y = 3179.0 - 800, z = 1047.9398193359 },
                    { x = 22446.0 + 800, y = 5601.0 - 800, z = 137.31729125977 },
                    { x = 23411.0 + 800, y = 6392.0 - 800, z = 135.3274230957 },
                }
            }
        },

        ['丽泽瀑布'] = {
            {
                name = '丽泽瀑布大',
                area = {
                    { x = 23014.0+800, y = 21166.0+800, z = 1547.3935546875 },
                    { x = 22007.0, y = 21788.0+5000, z = 1548.9541015625 },
                    { x = 11639.541992188, y = 24748.0+5000, z = 2574.2260742188 },
                    { x = 3314.0-500, y = 24381.0+500, z = 2446.2495117188 },
                    { x = 2137.0-100, y = 22406.85546875, z = 2179.9995117188 },
                    { x = 2112.0 - 50, y = 21988.0 - 50, z = 2181.0344238281 },
                    { x = 2412.0 - 200, y = 19306.0, z = 1794.3796386719 },
                    { x = 1775.0-200, y = 18604.865234375, z = 1795.9996337891 },
                    { x = 892.0 - 50, y = 18184.0+50, z = 1795.9996337891 },
                    { x = 716.0 - 300, y = 17766.0 - 300, z = 1788.2847900391 },
                    { x = -1948.0- 3000, y = 12673.0+3000, z = 383.99993896484 },
                    { x = -2223.0 - 3000, y = 7170.0, z = 516.15051269531 },
                    { x = -379.0- 6000, y = -66.0-6000, z = 647.38989257812 },
                    { x = 7041.5229492188, y = -3437.0- 9000, z = 1288.6180419922 },
                    { x = 24421.0+ 9000, y = 480.0-9000, z = 286.15670776367 },
                    { x = 25794.0+9999, y = 3144.099609375, z = 160.39047241211 },
                    { x = 25685.0+9999, y = 7382.064453125, z = 390.37326049805 },
                    { x = 23040.0+9999, y = 19351.0, z = 1414.4741210938 },
                }
            },
            {
                name = '丽泽瀑布小',
                area = {
                    { x = 1677.0+100, y = 22171.0+100, z = 2179.9992675781 },
                    { x = -301.0, y = 22784.0 + 800, z = 2175.9995117188 },
                    { x = -2299.0 - 1000 , y = 23196.0 + 1000, z = 2310.9372558594 },
                    { x = -2459.0- 1000, y = 21742.611328125, z = 2175.9997558594 },
                    { x = -2703.0 - 1000, y = 21022.0, z = 2176.0 },
                    { x = -2324.0 - 1000, y = 20019.0 - 1000, z = 2176.0 },
                    { x = -1083.0, y = 18706.0 - 500, z = 2175.9997558594 },
                    { x = 579.0400390625 + 100, y = 18589.0078125 - 100, z = 2177.7094726562 },
                    { x = 586.46295166016 + 300, y = 20069.22265625 + 300, z = 1798.9604492188 },
                    { x = 1019.0, y = 20914.0, z = 2185.1494140625 },
                    { x = 1019.0 + 300, y = 20914.0 + 300, z = 2185.1494140625 },
                    { x = 1777.7277832031 + 50, y = 21910.0 + 50, z = 2181.9995117188 },
                }
            },

        },

        ['涅贝霍恩'] = {
            {
                name = '涅贝霍恩正下方',
                area = {
                    { x = -24201.0 + 1000, y = 2245.0 },-- 起点
                    { x = -25225.0, y = 2422.0 },
                    { x = -25755.0, y = 3777.0 },
                    { x = -25353.0 + 5, y = 4690.0 },
                    { x = -24873.0, y = 5713.0 },
                    { x = -24873.0, y = 5861.0 },
                    { x = -30104.0 - 2000, y = 7543.0 + 2000 },
                    { x = -31375.0 - 2000, y = 5217.0 - 2000 },
                    { x = -28385.0 - 4000, y = 564.0 - 4000 },
                    { x = -26228.0 + 2000, y = -185.0 - 2000 },
                    { x = -24293.0 + 2000, y = 934.0 - 2000 },
                },
                min_cz = nil,
            },
            {
                name = '涅贝霍恩大部分',
                area = {
                    { x = -24834.0 - 10, y = 2519.0 - 10 },-- 起点
                    { x = -24505.0, y = 2499.0 - 5 },
                    { x = -12330.0 + 1000, y = 1243.0 - 1000 },
                    { x = 86.0 + 2000, y = 6725.0 - 2000 },
                    { x = 711.0 + 2000, y = 9605.0 + 2000 },
                    { x = -241.0 + 2000, y = 27595.0 + 2000 },
                    { x = -2104.0 - 1000, y = 29192.0 + 1000 },
                    { x = -15955.0 - 3000, y = 28387.0 + 3000 },
                    { x = -27428.0 - 2000, y = 26712.0 + 2000 },
                    { x = -28455.0 - 2000, y = 25500.0 },
                    { x = -28910.0 - 2000, y = 23326.0 - 2000 },
                    { x = -30461.0 - 3000, y = 14497.0 - 3000 },
                    { x = -30461.0 - 2000, y = 14497.0 - 2000 },
                    { x = -25149.0 - 50, y = 6786.0 - 50 },
                    { x = -24695.0 - 10, y = 6293.0 - 10 },
                    { x = -24529.0 - 5, y = 5939.0 },
                    { x = -24539.0 - 5, y = 5545.0 },
                    { x = -24903.0 - 10, y = 4917.0 + 10 },
                    { x = -25251.0 - 15, y = 4801.0 },
                    { x = -25334.0 - 10, y = 4524.0 },
                    { x = -25387.0 - 5, y = 3552.0 },
                    { x = -25091.0 - 30, y = 3035.0 - 30 },-- 终点
                },
                min_cz = 2857,
            },
            {
                name = '涅贝霍恩中间',
                area = {
                    { x = -15957.0 + 500, y = 18149.0 + 500 },-- 起点
                    { x = -17037.0 - 1000, y = 18632.0 + 1000 },
                    { x = -18493.0 - 5, y = 17877.0 },
                    { x = -18493.0 - 5, y = 17713.0 },
                    { x = -16717.0, y = 17281.0 - 500 },
                    { x = -16098.0 + 500, y = 17456.0 - 500 },-- 终点
                },
                min_cz = 6404,
            },
            {
                name = '涅贝霍恩中间升降机',
                area = {
                    { x = -18565.171875, y = 18054.296875 + 5 },-- 起点
                    { x = -18934.712890625, y = 18054.296875 + 5 },
                    { x = -18983.712890625 - 5, y = 18015.296875 + 5 },

                    { x = -18995.712890625 - 5, y = 17989.296875 },
                    { x = -19006.712890625 - 5, y = 17604.296875 },
                    { x = -18972.712890625 - 5, y = 17565.296875 - 5 },

                    { x = -18936.712890625, y = 17537.296875 - 5 },
                    { x = -18572.712890625, y = 17537.296875 - 5 },
                    { x = -18531.712890625 + 5, y = 17565.296875 - 5 },

                    { x = -18508.712890625 + 5, y = 17588.296875 },
                    { x = -18497.712890625 + 5, y = 17993.296875 },-- 终点
                    { x = -18525.712890625 + 5, y = 18021.296875 + 5 },
                },
                min_cz = 3059,
            },
        },

        ['佩斯纳尔高原'] = {
            {
                name = '佩斯纳尔高原大部分',
                area = {
                    { x = 25651.0 + 1000, y = 2539.0 },-- 起点
                    { x = 29545.0 + 3000, y = 12044.0 },
                    { x = 27608.0 + 1000, y = 15501.0 + 1000 },

                    { x = 26152.0, y = 16643.0 + 5 },
                    { x = 25943.0 - 5, y = 16685.0 + 5 },
                    { x = 25787.0 - 5, y = 16667.0 + 5 },
                    { x = 25526.0, y = 16367.0 + 5 },
                    { x = 25128.0 + 5, y = 16494.0 + 5 },
                    { x = 25121.0 + 100, y = 16917.0 },
                    { x = 24894.0, y = 17081.0 + 20 },
                    { x = 23721.0 - 2000, y = 16925.0 + 2000 },

                    { x = 23009.0 + 100, y = 21287.0 - 100 },
                    { x = 23371.0 - 10, y = 22301.0 },
                    { x = 23008.0 + 15, y = 23274.0 + 100 },

                    { x = 18791.0 + 2000, y = 26451.0 },
                    { x = 15979.0 - 2000, y = 26280.0 + 2000 },
                    { x = 11607.0 - 3000, y = 25285.0 + 3000 },
                    { x = 4100.0 - 3000, y = 22170.0 + 3000 },
                    { x = 1529.0 - 2000, y = 21335.0 },
                    { x = -518.0 - 2000, y = 6415.0 },
                    { x = -178.0 - 2000, y = 2682.0 - 2000 },
                    { x = 1343.0, y = 485.0 - 2000 },
                    { x = 2234.0 + 1000, y = 256.0 - 1000 },
                    { x = 10861.0, y = -586.0 - 2000 },
                    { x = 15202.0, y = -1225.0 - 2000 },
                    { x = 21728.0 + 2000, y = -1659.0 - 2000 },
                },
                min_cz = 3970,
            },
            {
                name = '佩斯纳尔高原最上方',
                area = {
                    { x = 24869.0 + 10, y = 17894.0 },-- 起点
                    { x = 24859.0, y = 18655.0 },
                    { x = 24808.0 + 5, y = 19159.0 },
                    { x = 25187.0 + 100, y = 19463.0 - 100 },
                    { x = 27213.0 + 1000, y = 22113.0 },
                    { x = 27000.0 + 3000, y = 24794.0 + 3000 },
                    { x = 25522.0, y = 24686.0 + 3000 },
                    { x = 24220.0 - 500, y = 23875.0 + 500 },
                    { x = 23371.0, y = 22301.0 },
                    { x = 23581.0 - 10, y = 19201.0 + 10 },
                    { x = 23759.0 - 200, y = 18765.0 - 200 },
                    { x = 24315.0 - 200, y = 17945.0 - 200 },
                    { x = 24756.0, y = 17789.0 - 100 },-- 终点
                },
            },
            {
                name = '佩斯纳尔高原上小',
                area = {
                    { x = 26173.0 + 100 , y = 16748.0, z = 4489.0 },
                    { x = 26472.0 + 100, y = 17570.0, z = 4491.0 },
                    { x = 26048+200, y = 18248+200, z = 4488.0 },
                    { x = 25681.0, y = 18984+200, z = 4487.0 },
                    { x = 25320-100, y = 19007+100, z = 4487.0 },
                    { x = 24900-100, y = 18992+100, z = 4481.0 },
                    { x = 24945-100, y = 18401.0, z = 4486.0 },
                    { x = 25009-100, y = 17744-100, z = 4485.0 },
                    { x = 25051-100, y = 17275-100, z = 4489.0 },
                    { x = 25565.0, y = 16681-100, z = 4489.0 },
                },
            },
            {
                name = '佩斯纳尔高原中小',
                area = {
                    { x = 12476.0+200, y = 9390.0+200, z = 3466.0703125 },
                    { x = 12332.0+200, y = 9533.0+200, z = 3467.1877441406 },
                    { x = 12209.0+200, y = 9800.0+200, z = 3468.55078125 },
                    { x = 12082.0+200, y = 9779.0+200, z = 3467.6508789062 },
                    { x = 11845.0+200, y = 9813.0+200, z = 3469.6616210938 },
                    { x = 11638.0+200, y = 10003.0+200, z = 3471.4855957031 },
                    { x = 11598.0+200, y = 10219.0+200, z = 3470.8203125 },
                    { x = 11390.0+200, y = 10249.0+200, z = 3469.9296875 },
                    { x = 11242.0+200, y = 10602.0+200, z = 3468.8078613281 },
                    { x = 11099.0+200, y = 10880.0+200, z = 3473.1940917969 },
                    { x = 11157.0+200, y = 11182.0+200, z = 3470.3408203125 },
                    { x = 11058.0+200, y = 11425.0+200, z = 3467.802734375 },
                    { x = 10893.0+200, y = 11672.0+200, z = 3467.5581054688 },
                    { x = 11181.0+200, y = 12241.0+200, z = 3464.9995117188 },

                    { x = 10831.0+200, y = 12625.1953125, z = 3464.9995117188 },
                    { x = 10745.0+200, y = 12893.458007812, z = 3464.3344726562 },
                    { x = 10751.0+200, y = 13146.561523438, z = 3464.7097167969 },
                    { x = 10735.0+200, y = 13416.1015625, z = 3464.6813964844 },
                    { x = 10723.0+200, y = 13845.744140625, z = 3462.9997558594 },
                    { x = 10934.0+200, y = 14347.54296875, z = 3479.2749023438 },
                    { x = 10887.0+200, y = 14738.119140625, z = 3463.9997558594 },
                    { x = 10591.0+200, y = 15078.525390625, z = 3464.9995117188 },

                    { x = 10466.0+200, y = 15513.0+200, z = 3466.2431640625 },
                    { x = 10327.315429688, y = 15609.0+200, z = 3464.1938476562 },
                    { x = 10045.0-200, y = 15190.0+200, z = 3462.75 },
                    { x = 10009.0-200, y = 14889.0, z = 3479.7736816406 },
                    { x = 10140.-200, y = 14322.-200, z = 3462.7114257812 },

                    { x = 10096.0- 200, y = 13266.0- 200, z = 3461.4748535156 },
                    { x = 10493.0- 200, y = 12163.0- 200, z = 3462.5153808594 },
                    { x = 10577.0- 200, y = 11286.0- 200, z = 3468.9211425781 },
                    { x = 10816.0- 200, y = 10310.0- 200, z = 3468.8820800781 },
                    { x = 11223.0- 200, y = 9969.0- 200, z = 3469.9677734375 },
                    { x = 11860.0- 200, y = 9437.0- 200, z = 3471.0903320312 },

                    { x = 12193.0, y = 9174.0 - 200, z = 3470.4523925781 },
                    { x = 12384.0+ 200, y = 9222.0- 200, z = 3465.3354492188 },
                    { x = 12466.0+200, y = 9346.154296875, z = 3465.6586914062 },
                },
                min_cz = 3460,
            },
        },

        ['巴兰卡山脉'] = {
            {
                name = '巴兰卡山脉-左边',
                area = {
                    { x = 30914.0 + 3000, y = 13631.0 + 3000 }, --false 无区域
                    { x = 26516.0 + 3000, y = 21065.0 + 3000 }, --false 无区域
                    { x = 24990.0 + 3000, y = 28769.0 + 3000 }, --false 无区域
                    { x = 19299.0 + 3000, y = 28043.0 + 3000 }, --false 无区域
                    { x = 16840.0 + 3000, y = 27437.0 + 3000 }, --false 无区域
                    { x = 16687.0 - 3000, y = 27416.0 + 3000 }, --false 无区域
                    { x = 15805.0 - 1000, y = 26379.0 }, --false 无区域
                    { x = 14609.0 - 1000, y = 20544.904296875 }, --false 无区域
                    { x = 17461.0 - 500, y = 17419.0 - 500 }, --false 无区域
                    { x = 23533.0 - 500, y = 12026.252929688 }, --false 无区域
                    { x = 19564.0 - 100, y = 10246.0 + 100 }, --false 无区域
                    { x = 19588.0 - 10, y = 10233.0 - 10 }, --false 无区域
                    { x = 19623.0 - 10, y = 10216.0 - 10 }, --false 无区域
                    { x = 19647.0 - 10, y = 10193.0 - 10 }, --false 无区域
                    { x = 19655.0 - 10, y = 10169.0 - 10 }, --false 无区域
                    { x = 19670.0 - 10, y = 10152.0 - 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 10123.0 - 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 10100.0 - 10 }, --false 无区域
                    { x = 19693.0 - 5, y = 10076.0 - 5 }, --false 无区域
                    { x = 19693.0 - 10, y = 10061.0 }, --false 无区域
                    { x = 19695.0 - 5, y = 10031.0 + 5 }, --false 无区域
                    { x = 19693.0 - 10, y = 10008.0 + 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 9984.0 + 10 }, --false 无区域
                    { x = 19660.0 - 10, y = 9935.0 + 10 }, --false 无区域
                    { x = 19652.0 - 10, y = 9916.0 + 10 }, --false 无区域
                    { x = 19639.0 - 10, y = 9889.0 + 10 }, --false 无区域
                    { x = 19599.0 - 10, y = 9868.0 + 10 }, --false 无区域
                    { x = 19569.0 - 10, y = 9857.0 + 10 }, --false 无区域
                    { x = 19549.0 - 30, y = 9849.0 + 10 }, --true 无区域
                    { x = 19594.0 - 200, y = 9790.0 - 200 }, --false 无区域
                    { x = 21771.0 - 300, y = 6758.0 - 300 }, --false 无区域
                    { x = 23808.802734375, y = 5302.0 - 1500 }, --false 无区域
                    { x = 31214.0 + 5000, y = 5345.8657226562 }, --false 无区域
                    { x = 32292.0 + 5000, y = 9453.923828125 }, --false 无区域
                },
            },

            {
                name = '巴兰卡山脉-右边',
                area = {
                    { x = 15244.0 + 500, y = 17085.0 + 500 }, --false 无区域
                    { x = 9131.0 + 500, y = 21723.0 + 500 }, --false 无区域
                    { x = 7614.0 + 3000, y = 27938.0 + 3000 }, --false 无区域
                    { x = 6173, y = 27854.0 + 8000 }, --false 无区域
                    { x = 4250.0 + 5000, y = 20493.205078125 }, --false 无区域
                    { x = 2258.0 + 5000, y = 7847.728515625 }, --false 无区域
                    { x = 2187.0 - 5000, y = 2004.0 - 5000 }, --false 无区域
                    { x = 7678.0 + 5000, y = 1357.0 - 5000 }, --false 无区域
                    { x = 21818.0 + 3000, y = 2380.9775390625 }, --false 无区域
                    { x = 20975.0 + 300, y = 3801.1843261719 + 300 }, --false 无区域
                    { x = 20033.0 + 300, y = 6824.0 + 300 }, --false 无区域
                    { x = 18401.142578125 + 500, y = 9112.591796875 + 500 }, --false 无区域
                    { x = 18273.900390625 + 500, y = 10826.82421875 + 500 }, --false 无区域
                    { x = 18704.220703125 + 500, y = 12016.216796875 + 500 }, --false 无区域
                    { x = 19014.650390625 + 500, y = 13450.55859375 + 500 }, --false 无区域
                },
                min_cz = 1.0

            },
            {
                name = '巴兰卡山脉-平移机',
                area = {
                    { x = 16301.0 + 100, y = 10311.0 }, --false 无区域
                    { x = 16351.0 + 10, y = 10253.0 - 10 }, --false 无区域
                    { x = 16331.0 + 10, y = 10242.0 - 10 }, --false 无区域
                    { x = 16316.0 + 10, y = 10234.0 - 10 }, --false 无区域
                    { x = 16289.0 + 10, y = 10221.0 - 10 }, --false 无区域
                    { x = 16276.0 + 10, y = 10214.0 - 10 }, --false 无区域
                    { x = 16258.0 + 10, y = 10198.0 - 10 }, --false 无区域
                    { x = 16242.0 + 10, y = 10182.0 - 10 }, --false 无区域
                    { x = 16232.0 + 10, y = 10172.0 - 10 }, --false 无区域
                    { x = 16216.0 + 10, y = 10156.0 - 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10133.0 - 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10103.0 - 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10071.0 - 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10051.0 - 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10034.0 + 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 10009.0 + 10 }, --false 无区域
                    { x = 16209.0 + 10, y = 9978.0 + 10 }, --false 无区域
                    { x = 16220.0 + 10, y = 9944.0 + 10 }, --false 无区域
                    { x = 16242.0 + 10, y = 9917.0 + 10 }, --false 无区域
                    { x = 16246.0 + 10, y = 9912.0 + 10 }, --false 无区域
                    { x = 16266.0 + 10, y = 9887.0 + 10 }, --false 无区域
                    { x = 16304.0 + 10, y = 9860.0 - 10 }, --false 无区域
                    { x = 19594.0 - 200, y = 9790.0 - 200 }, --false 无区域
                    { x = 19549.0 - 30, y = 9849.0 + 10 }, --true 无区域
                    { x = 19569.0 - 10, y = 9857.0 + 10 }, --false 无区域
                    { x = 19599.0 - 10, y = 9868.0 + 10 }, --false 无区域
                    { x = 19639.0 - 10, y = 9889.0 + 10 }, --false 无区域
                    { x = 19652.0 - 10, y = 9916.0 + 10 }, --false 无区域
                    { x = 19660.0 - 10, y = 9935.0 + 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 9984.0 + 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 10008.0 + 10 }, --false 无区域
                    { x = 19695.0 - 5, y = 10031.0 + 5 }, --false 无区域
                    { x = 19693.0 - 10, y = 10061.0 }, --false 无区域
                    { x = 19693.0 - 5, y = 10076.0 - 5 }, --false 无区域
                    { x = 19693.0 - 10, y = 10100.0 - 10 }, --false 无区域
                    { x = 19693.0 - 10, y = 10123.0 - 10 }, --false 无区域
                    { x = 19670.0 - 10, y = 10152.0 - 10 }, --false 无区域
                    { x = 19655.0 - 10, y = 10169.0 - 10 }, --false 无区域
                    { x = 19647.0 - 10, y = 10193.0 - 10 }, --false 无区域
                    { x = 19623.0 - 10, y = 10216.0 - 10 }, --false 无区域
                    { x = 19588.0 - 10, y = 10233.0 - 10 }, --false 无区域
                    { x = 19564.0 - 100, y = 10246.0 + 100 }, --false 无区域
                },
                min_cz = 700

            }


        },

        ['丰饶森林'] = {
            {
                name = '丰饶森林-门口',
                area = {
                    -- 上
                    { x = 4507.0 + 300, y = 1838.0 + 300 },
                    { x = 4298.0 + 300, y = 2051.0 + 300 },
                    { x = 4071.0 + 300, y = 2233.0 + 300 },
                    -- 右上
                    { x = 3843.4970703125, y = 2164.0 + 300 },
                    -- 右
                    { x = 3843.0 - 100, y = 2164.0 + 100 },
                    { x = 3484.0 - 10, y = 2100.0 - 10 },

                    { x = 3381.0 + 5, y = 1917.0 - 5 },
                    { x = 3426.0 + 5, y = 1957.0 - 5 },
                    { x = 3460.0 + 5, y = 2000.0 - 5 },
                    { x = 3469.0 + 5, y = 2027.0 - 5 },
                    { x = 3462.0 + 5, y = 2054.0 - 5 },
                    { x = 3455.0 + 5, y = 2083.0 - 5 },
                    { x = 3439.0 + 5, y = 2111.0 - 5 },
                    { x = 3420.0 + 5, y = 2127.0 - 5 },

                    -- 下

                    { x = 4093.0 - 300, y = 910.0 - 300 },
                    { x = 4241.0 - 300, y = 854.0 - 300 },
                    { x = 4479.0 - 300, y = 815.0 - 300 },
                    -- 下左
                    { x = 4646.0, y = 801.0 - 300 },
                    -- 左
                    { x = 4646.0 + 300, y = 801.0 - 300 },
                    --左上
                    { x = 4646.0 + 1000, y = 801.0 },
                    { x = 4310.0 + 1000, y = 1384.0 },
                    { x = 4503.0 + 1000, y = 1850.0 },
                }
            },
            {
                name = '丰饶森林-副本门口',
                area = {
                    { x = 27031.0 + 800, y = 27592.0 + 800 },
                    { x = 27031.0, y = 27592.0 + 800 },
                    { x = 25842.0 - 800, y = 26932.0 + 800 },
                    { x = 25842.0 - 800, y = 26932.0 },
                    { x = 25881.0 - 800, y = 26585.0 - 800 },
                    { x = 25881.0, y = 26585.0 - 800 },

                    { x = 26526.0 + 800, y = 26938.0 - 800 },
                    { x = 26526.0 + 800, y = 26938.0 },
                },
                min_cz = 1200, -- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
            {
                name = '丰饶森林-大板块',
                area = {

                    --上
                    { x = 25820.0 + 300, y = 4444.0 + 300 },
                    { x = 24513.0 + 300, y = 8878.0 + 300 },
                    { x = 24612.0 + 300, y = 11089.0 + 300 },
                    { x = 24485.0 + 300, y = 11881.0 + 300 },

                    --右上 （小）
                    { x = 24485.0, y = 11881.0 + 50 },
                    { x = 24368.0, y = 11958.0 + 50 },
                    { x = 24206.0, y = 11967.0 + 50 },
                    { x = 24024.0, y = 11878.0 + 50 },
                    --    右
                    { x = 24024.0 - 300, y = 11878.0 + 300 },

                    --上
                    { x = 22954.0 + 300, y = 12418.0 },
                    { x = 20034.0 + 300, y = 16086.0 },
                    { x = 22954.0 + 300, y = 12418.0 },
                    { x = 20034.0 + 300, y = 16086.0 },

                    --正左
                    { x = 25309.0 + 300, y = 19872.0 - 300 },
                    --左上（小）
                    { x = 25309.0 + 50, y = 19872.0 },

                    --正上
                    { x = 25327.0 + 30, y = 20141.0 + 30 },
                    { x = 25211.0 + 30, y = 20323.0 + 30 },
                    { x = 25015.0 + 30, y = 20377.0 + 30 },

                    -- 右上
                    { x = 25015.0, y = 20377.0 + 300 },

                    -- 正上
                    { x = 20995.0 + 300, y = 23865.0 + 300 },
                    --右上（大）
                    { x = 20995.0, y = 23865.0 + 3000 },
                    --正右
                    { x = 17498.0 - 300, y = 23935.0 + 300 },
                    -- 正上
                    { x = 7666.0 + 300, y = 22375.0 + 300 },
                    --右上
                    { x = 7666.0, y = 22375.0 + 300 },
                    -- 正上
                    { x = 3096.0 + 300, y = 23368.0 + 300 },
                    -- 右上
                    { x = 3096.0, y = 23368.0 + 300 },
                    -- 右
                    { x = 3096.0, y = 23368.0 },
                    --右下
                    { x = 3096.0 - 300, y = 23368.0 },
                    --正右
                    { x = 3172.0 - 300, y = 16637.0 + 300 },
                    { x = 2994.0 - 300, y = 9509.0 + 300 },
                    { x = 1534.0 - 300, y = 5832.0 + 300 },
                    { x = 1790.0 - 300, y = 1534.0 + 300 },
                    --  右下
                    { x = 2038.0 - 300, y = 1121.0 },
                    --   正下
                    { x = 2038.0 - 300, y = 1121.0 - 300 },
                    --   左下
                    { x = 2038.0, y = 1121.0 - 300 },
                    { x = 2347.0, y = 867.0 - 300 },
                    { x = 2658.0, y = 954.0 - 300 },
                    { x = 3439.0, y = 1025.0 - 300 },
                    --   左上
                    { x = 3468.0 + 30, y = 1219.0 },
                    { x = 2868.0 + 30, y = 1545.0 },
                    { x = 2898.0 + 30, y = 1941.0 },
                    --   左下
                    { x = 3121.0, y = 2251.0 - 100 },
                    --   微微左下

                    { x = 3174.0 + 10, y = 2158.0 - 10 }, --true 无区域
                    { x = 3229.0 + 10, y = 2155.0 - 10 }, --false 无区域
                    { x = 3300.0 + 10, y = 2151.0 - 10 }, --true 无区域
                    { x = 3359.0, y = 2147.0 - 10 }, --true 无区域
                    { x = 3371.0, y = 2146.0 - 10 }, --false 无区域
                    { x = 3430.0, y = 2206.0 - 10 }, --false 无区域
                    { x = 3391.0, y = 2152.0 - 10 }, --false 无区域
                    { x = 3381.0, y = 2146.0 - 10 }, --false 无区域
                    { x = 3398.0 + 10, y = 2145.0 - 10 }, --false 无区域
                    { x = 3398.0 + 10, y = 2145.0 }, --false 无区域
                    { x = 3500.0 + 100, y = 2366.1682128906 }, --true 无区域
                    --  正上
                    { x = 3441.0 + 100, y = 2221.0 + 100 },
                    { x = 3399.0 + 100, y = 2473.0 + 100 },
                    --   左上
                    { x = 3005.0 + 300, y = 4154.0 },

                    --   正下
                    { x = 6062.0 - 300, y = 2622.0 - 300 },
                    --  左下
                    { x = 6062.0, y = 2622.0 - 300 },
                    { x = 11121.0, y = 1178.0 - 300 },
                    { x = 24649.0, y = 3030.0 - 300 },

                    --    正左
                    { x = 24649.0 + 300, y = 3030.0 - 300 },
                    --    左上
                    { x = 25788.0 + 300, y = 4181.0 },


                },
                min_cz = 1, -- 指定了当前区的Z坐标[存在重叠区域时使用]
            },
            {
                name = '丰饶森林-升降机',
                area = {

                    --    --    上
                    { x = 3405.0 + 10, y = 2146.0 + 10 },
                    { x = 3356.0 + 10, y = 2158.0 + 10 },
                    { x = 3321.0 + 10, y = 2172.0 + 10 },
                    { x = 3294.0 + 10, y = 2181.0 + 10 },
                    { x = 3300.0 + 10, y = 2187.0 + 10 },
                    { x = 3248.0 + 10, y = 2142.0 + 10 },
                    { x = 3232.0 + 10, y = 2127.0 + 10 },

                    --  右
                    { x = 3214.0 - 5, y = 2112.0 + 5 },
                    { x = 3186.0 - 5, y = 2088.0 + 5 },
                    { x = 3156.0 - 5, y = 2062.0 + 5 },
                    { x = 3127.0 - 5, y = 2036.0 + 5 },
                    { x = 3127.0 - 5, y = 2018.0 + 5 },
                    { x = 3114.0 - 5, y = 1984.0 + 5 },
                    { x = 3121.0 - 5, y = 1960.0 + 5 },
                    { x = 3130.0 - 5, y = 1948.0 + 5 },
                    { x = 3141.0 - 5, y = 1932.0 + 5 },
                    { x = 3152.0 - 5, y = 1917.0 + 5 },
                    { x = 3165.0 - 5, y = 1900.0 + 5 },

                    --  下
                    { x = 3207.0 - 10, y = 1897.0 - 10 },
                    { x = 3228.0 - 10, y = 1855.0 - 10 },
                    { x = 3278.0 - 10, y = 1832.0 - 10 },
                    { x = 3311.0 - 10, y = 1854.0 - 10 },
                    { x = 3318.0 - 10, y = 1859.0 - 10 },
                    { x = 3320.0 - 10, y = 1861.0 - 10 },
                    { x = 3353.0 - 10, y = 1892.0 - 10 },
                    -- 左
                    { x = 3381.0 + 5, y = 1917.0 - 5 },
                    { x = 3426.0 + 5, y = 1957.0 - 5 },
                    { x = 3460.0 + 5, y = 2000.0 - 5 },
                    { x = 3469.0 + 5, y = 2027.0 - 5 },
                    { x = 3462.0 + 5, y = 2054.0 - 5 },
                    { x = 3455.0 + 5, y = 2083.0 - 5 },
                    { x = 3439.0 + 5, y = 2111.0 - 5 },
                    { x = 3420.0 + 5, y = 2127.0 - 5 },
                },
                min_cz = 200, -- 指定了当前区的Z坐标[存在重叠区域时使用]

                overlap = {
                    ['丰饶森林-大板块'] = 200,
                    ['丰饶森林-门口'] = 1,
                }

            },
            {
                name = '丰饶森林-副本小路',
                area = {
                    -- 上
                    { x = 26476.0 + 300, y = 20402.0 + 300 },
                    { x = 26390.0 + 300, y = 20532.0 + 300 },
                    { x = 26301.0 + 300, y = 20691.0 + 300 },
                    { x = 25975.0 + 300, y = 21126.0 + 300 },
                    { x = 25728.0 + 300, y = 21366.0 + 300 },
                    { x = 25498.0 + 300, y = 21866.0 + 300 },
                    { x = 25331.0 + 300, y = 22147.0 + 300 },
                    { x = 25223.0 + 300, y = 22564.0 + 300 },
                    { x = 25325.0 + 300, y = 23109.0 + 300 },
                    { x = 25379.0 + 300, y = 23658.0 + 300 },
                    { x = 25262.0 + 300, y = 24015.0 + 300 },
                    { x = 25204.0 + 300, y = 24345.0 + 300 },
                    { x = 25245.0 + 300, y = 24646.0 + 300 },
                    { x = 25221.0 + 300, y = 24892.0 + 300 },
                    { x = 25333.0 + 300, y = 25122.0 + 300 },
                    { x = 25216.0 + 300, y = 25185.0 + 300 },
                    { x = 24601.0 + 300, y = 25005.0 + 300 },
                    { x = 24256.0 + 300, y = 25083.0 + 300 },
                    { x = 24183.0, y = 24971.0 + 300 },
                    { x = 24183.0 - 300, y = 24971.0 + 300 },
                    { x = 24183.0 - 300, y = 24971.0 },
                    { x = 24013.0 - 300, y = 24711.0 },
                    { x = 24013.0 - 300, y = 24711.0 - 300 },
                    { x = 24167.0 - 300, y = 24591.0 - 300 },
                    { x = 24307.0 - 300, y = 24482.0 - 300 },
                    { x = 24462.0 - 300, y = 24282.0 - 300 },
                    { x = 24558.0 - 300, y = 24097.0 - 300 },
                    { x = 24696.0 - 300, y = 23873.0 - 300 },
                    { x = 24797.0 - 300, y = 23574.0 - 300 },
                    { x = 24846.0 - 300, y = 23250.0 - 300 },
                    { x = 24825.0 - 300, y = 23013.0 - 300 },
                    { x = 24847.0 - 300, y = 22743.0 - 300 },
                    { x = 24911.0 - 300, y = 22397.0 - 300 },
                    { x = 25159.0 - 300, y = 22088.0 - 300 },
                    { x = 25261.0 - 300, y = 21695.0 - 300 },
                    { x = 25321.0 - 300, y = 21432.0 - 300 },
                    { x = 25302.0 - 300, y = 21041.0 - 300 },
                    { x = 25308.0 - 300, y = 20787.0 - 300 },
                    { x = 25214.0 - 20, y = 20435.0 - 20 },
                    { x = 25305.0 - 20, y = 20305.0 - 20 },
                    { x = 25377.0 - 20, y = 20201.0 - 20 },
                    { x = 25674.0 - 50, y = 20268.0 - 50 },
                    { x = 25868.0 - 50, y = 20218.0 - 50 },
                    { x = 25912.0 - 50, y = 20187.0 - 50 },
                    { x = 26051.0 - 100, y = 20090.0 - 100 },
                    { x = 26328.0 - 100, y = 20062.0 - 100 },
                    { x = 26331.0, y = 20061.0 - 50 },
                    { x = 26417.0, y = 20220.0 - 50 },
                    { x = 26417.0 + 50, y = 20220.0 - 50 },
                }
            },
            {
                name = '丰饶森林-山林路',
                area = {
                    --左  和   --左上
                    { x = 24496.0 + 300, y = 12186.0 - 300 },
                    { x = 24496.0 + 300, y = 12186.224609375 },
                    --左上
                    { x = 24556.0 + 300, y = 12292.0 },
                    { x = 24537.0 + 300, y = 12682.0 },
                    { x = 24624.0 + 300, y = 12941.0 },
                    { x = 24769.0 + 300, y = 13278.0 },
                    { x = 24754.0 + 300, y = 13614.0 },
                    { x = 24674.0 + 300, y = 14023.0 },
                    { x = 24626.0 + 300, y = 14380.0 },
                    { x = 24798.0 + 300, y = 14727.0 },
                    { x = 25048.0 + 300, y = 15181.0 },
                    { x = 25062.0 + 300, y = 15552.0 },
                    { x = 25166.0 + 300, y = 15903.0 },
                    { x = 25163.0 + 300, y = 16264.0 },
                    { x = 25206.0 + 300, y = 16605.0 },
                    { x = 25328.0 + 300, y = 17034.0 },
                    { x = 25457.0 + 300, y = 17373.0 },
                    { x = 25637.0 + 300, y = 17783.0 },
                    { x = 25986.0 + 300, y = 18112.0 },
                    { x = 26522.0 + 300, y = 18480.0 },
                    { x = 26744.0 + 300, y = 18914.0 },
                    { x = 27023.0 + 300, y = 19244.0 },
                    { x = 27016.0 + 300, y = 19595.0 },
                    { x = 27109.0 + 300, y = 19795.0 },
                    --上
                    { x = 27109.0 + 100, y = 19795.0 + 100 },
                    -- 上 + 上右
                    { x = 26646.0 + 100, y = 20162.0 + 100 },
                    { x = 26646.0, y = 20162.0 + 100 },
                    --右
                    { x = 26492.0 - 50, y = 20217.0 + 50 }, --false 无区域
                    { x = 26478.0 - 50, y = 20065.0 + 50 },
                    { x = 26320.0 - 50, y = 19509.0 + 50 },
                    { x = 26115.0 - 50, y = 18933.0 + 50 },
                    { x = 26000.0 - 50, y = 18677.0 + 50 },
                    { x = 25756.0 - 300, y = 18449.0 + 300 },
                    { x = 25622.0 - 300, y = 18237.0 + 300 },
                    { x = 25497.0 - 300, y = 18059.0 + 300 },
                    { x = 25200.0 - 300, y = 17804.0 + 300 },
                    { x = 24864.0 - 300, y = 17216.0 + 300 },
                    { x = 24562.0 - 300, y = 16977.0 + 300 },
                    { x = 24033.0 - 300, y = 16558.0 + 300 },
                    { x = 23767.0 - 300, y = 16286.0 + 300 },
                    --右下
                    { x = 23767.0 - 300, y = 16286.0 },
                    { x = 24456.0 - 300, y = 14570.0 },
                    { x = 24460.0 - 300, y = 14008.0 },
                    { x = 24340.0 - 300, y = 13411.0 },
                    { x = 24259.0 - 300, y = 12864.0 },
                    { x = 24128.0 - 300, y = 12250.0 },

                    -- 下
                    { x = 24128.0 - 100, y = 12250.0 - 100 },
                    { x = 24252.0 - 100, y = 12174.0 - 100 },
                    { x = 24390.0 - 100, y = 12161.0 - 100 },
                }
            },
        },

        ['赤红沙漠'] = {
            {
                name = '赤红沙漠中',
                area = {
                    { x = 9723.0 + 500, y = 11032.0 + 500 },-- 起点
                    { x = 6812.0, y = 12540.0 + 5 },
                    { x = 6735.0 - 5, y = 12561.0 + 5 },
                    { x = 6611.0 - 5, y = 12524.0 + 5 },
                    { x = 6468.0 - 5, y = 12393.0 },
                    { x = 6475.0 - 10, y = 12303.0 },

                    { x = 7934.0 - 500, y = 9251.0 - 500 },
                    { x = 11041.0, y = 7870.0 - 20 },
                    { x = 11195.0 + 5, y = 7847.0 - 5 },
                    { x = 11277.0 + 10, y = 7918.0 - 10 },
                    { x = 11250.0 + 20, y = 8053.0 },-- 终点
                },
                min_cz = nil,
            },
            {
                name = '赤红沙漠上',
                area = {
                    -- 正上
                    { x = 15966.0+500, y = 9348.0+500 },-- 终点
                    { x = 14153.0+500, y = 11983.0+500 },-- 终点
                    { x = 13127.0+500, y = 14210.0+500 },-- 终点
                    { x = 11610.0+500, y = 14840.0+500 },-- 终点
                    { x = 10380.0+500, y = 14942.0+500 },-- 终点
                    --右上
                    { x = 9962.0, y = 14645.0+500 },-- 终点
                    --正右
                    { x = 9962.0-100, y = 14645.0+100 },-- 终点
                    { x = 9337.0-100, y = 14492.0+100 },-- 终点
                    --右下
                    { x = 9401.0-50, y = 14435.0 },-- 终点
                    { x = 9420.0-50, y = 14357.0 },-- 终点
                    { x = 9413.0-50, y = 14301.0 },-- 终点
                    { x = 9331.0-50, y = 14236.0 },-- 终点
                    { x = 9338.0-50, y = 14161.0 },-- 终点
                    { x = 9347.0-50, y = 14130.0 },-- 终点
                    { x = 9456.0-50, y = 14036.0 },-- 终点
                    { x = 9414.0-50, y = 13954.0 },-- 终点
                    --正下
                    { x = 9400.0-50, y = 13900.0-50 },-- 终点
                    { x = 9686.0-300, y = 13852.0-300 },-- 终点
                    { x = 10002.0-300, y = 13183.0-300 },-- 终点
                    { x = 10804.0-300, y = 12087.0-300 },-- 终点

                    --正右
                    { x = 13165.-300, y = 8035.0+300 },-- 终点

                    --右下
                    { x = 12881.0-50, y = 7801.0 },-- 终点
                    { x = 12895.0-50, y = 7743.0 },-- 终点
                    { x = 12917.0-50, y = 7672.0 },-- 终点
                    { x = 12900.0-50, y = 7584.0 },-- 终点
                    { x = 12924.0-50, y = 7563.0 },-- 终点
                    { x = 12988.0-50, y = 7507.0 },-- 终点
                    { x = 13009.0-50, y = 7419.0 },-- 终点
                    { x = 13011.0-50, y = 7393.0 },-- 终点
                    { x = 13034.0-50, y = 7307.0 },-- 终点
                    { x = 13062.0-50, y = 7207.0 },-- 终点

                    --左下
                    { x = 13236.0, y = 7286.0-100 },-- 终点
                    { x = 13701.0, y = 7067.0-100 },-- 终点
                    { x = 14057.0, y = 7035.0-100 },-- 终点
                    --大点
                    { x = 14665.0, y = 7141.0-1000 },-- 终点

                    --正左
                    { x = 16240.0+1000, y = 7869.0-1000 },-- 终点

                    --左上
                    { x = 16240.0+1000, y = 7869.0,}-- 终点
                },
                min_cz = 519,
            },
            {
                name = '赤红沙漠左',
                area = {
                    --正上
                    { x = 12899.0+50, y = 6810.0+50 },-- 终点
                    { x = 12937.0+50, y = 6921.0+50 },-- 终点
                    { x = 12935.0+50, y = 7029.0+50 },-- 终点
                    { x = 12914.0+50, y = 7141.0+50 },-- 终点
                    { x = 12926.0+50, y = 7219.0+50 },-- 终点
                    { x = 12907.0+50, y = 7296.0+50 },-- 终点
                    { x = 12870.0+50, y = 7392.0+50 },-- 终点
                    { x = 12822.0+50, y = 7488.0+50 },-- 终点
                    { x = 12769.0+50, y = 7542.0+50 },-- 终点
                    { x = 12632.0+50, y = 7691.0+50 },-- 终点
                    { x = 12616.0+50, y = 7807.0+50 },-- 终点
                    { x = 12595.0+50, y = 7835.0+50 },-- 终点
                    { x = 11762.0+50, y = 8043.0+50 },-- 终点
                    -- 上右
                    { x = 11334.0, y = 8190.0+50 },-- 终点
                    -- 正右
                    { x = 11334.0-50, y = 8190.0+50 },-- 终点
                    -- 右下
                    { x = 11334.0-50, y = 8190.0 },-- 终点
                    { x = 11346.0-50, y = 8134.0 },-- 终点
                    { x = 11354.0-50, y = 8090.0 },-- 终点
                    { x = 11352.0-50, y = 8056.0 },-- 终点
                    { x = 11371.0-50, y = 8018.0 },-- 终点
                    { x = 11406.0-50, y = 7965.0 },-- 终点
                    { x = 11406.0-50, y = 7893.0 },-- 终点
                    --    正右（小）
                    { x = 11290.0-50, y = 7825.0+50 },-- 终点
                    { x = 11243.0-50, y = 7768.0+50 },-- 终点
                    { x = 11203.0-50, y = 7741.0+50 },-- 终点
                    { x = 11151.0-50, y = 7600.0+50 },-- 终点
                    { x = 11125.0-50, y = 7517.0+50 },-- 终点
                    { x = 11127.0-50, y = 7417.0+50 },-- 终点
                    { x = 11118.0-50, y = 7346.0+50 },-- 终点
                    { x = 11107.0-50, y = 7245.0+50 },-- 终点
                    { x = 11080.0-50, y = 7161.0+50 },-- 终点
                    --
                    --   正右（大）
                    { x = 8644.0-500, y = 3677.0+500 },-- 终点
                    --  右下
                    { x = 8644.0-500, y = 3677.0 },-- 终点
                    --  下
                    { x = 8644.0-500, y = 3677.0-500 },-- 终点
                    -- 左下
                    { x = 11214.0, y = 2607.0-500 },-- 终点
                    --    左
                    { x = 11214.0+500, y = 2607.0-500 },-- 终点
                    --  左上
                    { x = 12930.0+50, y = 6837.0 },-- 终点
                },
                min_cz = nil,
            },
            {
                name = '赤红沙漠下',
                area = {
                    -- 正上
                    { x = 3703.0+200, y = 13315.0+200 },-- 终点
                    { x = 3652.0+200, y = 13397.0+200 },-- 终点
                    { x = 3517.0+200, y = 13459.0+200 },-- 终点
                    { x = 3412.0+200, y = 13534.0+200 },-- 终点
                    -- 右上
                    { x = 2893.0, y = 13418.0+300 },-- 终点
                    -- 正右
                    { x = 2893.0-300, y = 13418.0+300 },-- 终点
                    { x = 2373.0-300, y = 12356.0+300 },-- 终点
                    { x = 1968.0-300, y = 11310.0+300 },-- 终点
                    --右下
                    { x = 1644.0-2000, y = 10595.657226562 },-- 终点
                    --正下
                    { x = 1810.0-3000, y = 9693.0-3000 },-- 终点
                    { x = 4315.0-3000, y = 6078.0-3000 },-- 终点
                    -- 左下
                    { x = 5725.7065429688, y = 5481.0-500 },-- 终点
                    --正左
                    { x = 6815.0+500, y = 5632.0-500 },-- 终点
                    -- 左上
                    { x = 7305.0+500, y = 8446.0 },-- 终点
                    --    正上
                    { x = 7211.0+500, y = 8556.0+500 },-- 终点
                    { x = 4143.0+500, y = 11343.0+500 },-- 终点
                    --  左上
                    { x = 3675.0+50, y = 12944.0 },-- 终点
                    { x = 3691.0+50, y = 13057.0 },-- 终点
                    { x = 3721.0+50, y = 13149.0 },-- 终点
                    { x = 3714.0+50, y = 13216.0 },-- 终点
                    { x = 3706.0+50, y = 13243.662109375 },-- 终点
                },
                min_cz = nil,
            },
            {
                name = '赤红沙漠右',
                area = {
                    { x = 4253.0, y = 12474.0 - 50 },-- 起点
                    { x = 5447.0 + 50, y = 12360.0 - 50 },
                    { x = 6441.0, y = 12498.0 - 20 },
                    { x = 6466.0 + 5, y = 12482.0 - 5 },
                    { x = 6548.0 + 5, y = 12555.0 - 5 },
                    { x = 6558.0 + 10, y = 12573.0 - 10 },
                    { x = 6886.0 + 10, y = 12649.0 - 10 },

                    { x = 8973.0 + 20, y = 13598.0 - 20 },
                    { x = 9319.0 + 5, y = 14004.0 },
                    { x = 9268.0 + 5, y = 14254.0 },
                    { x = 9314.0 + 10, y = 14571.0 + 10 },

                    { x = 8899.0 + 500, y = 15293.0 + 500 },
                    { x = 6916.0 + 500, y = 17008.0 + 500 },
                    { x = 5551.0 - 500, y = 16482.0 + 500 },

                    { x = 4008.0 - 20, y = 13423.0 },
                    { x = 3806.0 - 5, y = 13271.0 },
                    { x = 3797.0 - 5, y = 13118.0 },
                    { x = 3801.0 - 10, y = 12925.0 - 10 },-- 终点
                },
                min_cz = 0,
            },
        },

        ['应许之地'] = {
            { name = '应许之地-遗忘的老路',
              area = {
                  --右上
                  { x = 26850.0, y = 19556.0 + 300 },
                  { x = 26098.0, y = 19632.0 + 300 },
                  { x = 25322.0, y = 19708.0 + 300 },
                  { x = 23343.0, y = 19238.0 + 300 },
                  --正上
                  { x = 20156.0 + 300, y = 19369.0 + 300 },
                  { x = 18847.0 + 300, y = 20101.0 + 300 },
                  --右上
                  { x = 18662.0, y = 19972.0 + 300 },
                  { x = 18368.0, y = 19790.0 + 300 },
                  { x = 17780.0, y = 20011.0 + 300 },
                  { x = 17343.0, y = 20294.0 + 300 },
                  { x = 16987.0, y = 20635.0 + 300 },
                  { x = 16944.0, y = 20627.0 + 300 },
                  --正右
                  { x = 16944.0 - 300, y = 20627.0 + 300 },
                  --右下
                  { x = 16942.0 - 300, y = 20626.28515625 },
                  { x = 16952.0 - 300, y = 20479.4296875 },
                  { x = 16767.0 - 300, y = 20338.0 },
                  { x = 16774.0 - 300, y = 20231.251953125 },
                  { x = 16729.0 - 300, y = 19644.5 },
                  --左下
                  { x = 16761.1328125, y = 19566.0 - 300 },
                  { x = 16856.0, y = 19507.0 - 300 },
                  { x = 17190.0, y = 19238.0 - 300 },
                  --正左
                  { x = 17190.0 + 300, y = 19238.0 - 300 },
                  --正右
                  { x = 18247.0 - 300, y = 17652.0 + 300 },
                  --右下
                  { x = 18247.0 - 300, y = 17652.0 },
                  { x = 18283.0 - 300, y = 17354.47265625 },
                  { x = 18252.0 - 300, y = 17201.0 },
                  { x = 18198.0 - 300, y = 17132.068359375 },
                  { x = 18183.0 - 300, y = 17086.0 },
                  --左下
                  { x = 18183.0, y = 17086.0 - 300 },
                  --正右
                  { x = 16604.0 - 300, y = 9713.0 + 300 },
                  { x = 16466.0 - 300, y = 9476.0 + 300 },
                  --右下
                  { x = 16466.0 - 100, y = 9476.0 },
                  { x = 16494.0 - 100, y = 9355.5927734375 },
                  { x = 16710.0 - 100, y = 8836.9658203125 },
                  { x = 16895.0 - 100, y = 8402.4287109375 },
                  { x = 16965.0 - 100, y = 7735.4204101562 },
                  { x = 17065.0 - 100, y = 7581.7016601562 },
                  { x = 17087.0 - 100, y = 7372.9443359375 },
                  { x = 17322.0 - 100, y = 7109.0034179688 },
                  { x = 17171.0 - 100, y = 6342.0 },
                  { x = 17434.0 - 100, y = 5868.6083984375 },
                  --正右
                  { x = 17713.0 - 300, y = 4120.0 + 300 },
                  { x = 17419.0 - 100, y = 3377.0 + 100 },
                  --正下
                  { x = 17419.0 - 10, y = 3377.0 - 10 },
                  { x = 17565.0 - 10, y = 3198.0 - 10 },
                  { x = 17781.0 - 10, y = 2982.0 - 10 },
                  { x = 18099.0 - 10, y = 2492.0 - 10 },
                  { x = 18098.0 - 10, y = 2353.0 - 10 },
                  { x = 18197.0 - 10, y = 2101.0 - 10 },
                  { x = 18317.0 - 10, y = 1998.0 - 10 },
                  { x = 18712.0 - 10, y = 1205.0 - 10 },
                  --左下
                  { x = 18727.0, y = 1217.0 - 50 },
                  { x = 19454.0, y = 845.0 - 50 },
                  { x = 21109.0, y = 772.0 - 50 },
                  { x = 21856.0, y = 1117.0 - 300 },
                  --正左
                  { x = 22048.0 + 300, y = 1332.0 - 300 },
                  --左上
                  { x = 22244.0 + 300, y = 1908.0 },
                  --正左
                  { x = 25593.0 + 300, y = 3851.0 - 300 },
                  --左上
                  { x = 25590.0 + 300, y = 3849.3049316406 },
                  { x = 25588.0 + 300, y = 4474.7602539062 },
                  { x = 25441.0 + 300, y = 8471.6748046875 },
                  { x = 27595.0 + 300, y = 16303.768554688 },
                  { x = 26975.0 + 300, y = 19380.990234375 },
                  --正上
                  { x = 26975.0 + 300, y = 19380.0 + 300 },


              }
            },
            { name = '应许之地-熔岩绝壁连接',
              area = {
                  --正上
                  { x = 16768.0 + 100, y = 7782.0 + 100 },
                  --右上
                  { x = 16768.26953125, y = 7782.0 + 100 },
                  { x = 16247.654296875, y = 7945.0 + 100 },
                  --正右
                  { x = 16247.0 - 100, y = 7945.0 + 100 },
                  --右下
                  { x = 16247.0 - 20, y = 7945.4692382812 },
                  { x = 16285.0 - 20, y = 7778.0 },
                  { x = 16184.0 - 20, y = 7675.0 },
                  { x = 16236.0 - 20, y = 7457.0 },
                  { x = 16260.0 - 20, y = 7387.0 },
                  { x = 16313.0 - 20, y = 7232.0 },
                  { x = 16358.0 - 20, y = 7103.0 },
                  { x = 16407.0 - 20, y = 6958.0 },
                  --正下
                  { x = 16407.0 - 50, y = 6958.0 - 50 }, --
                  --左下
                  { x = 16407.0, y = 6958.0 - 100 },
                  { x = 16540.0, y = 6963.0 - 100 },
                  { x = 16674.0, y = 7159.0 - 100 },
                  { x = 16895.234375, y = 7334.0 - 100 },
                  --正左
                  { x = 16895.0 + 100, y = 7334.0 - 100 },
                  --左上
                  { x = 16895.0 + 100, y = 7334.6171875 },
                  { x = 16936.0 + 100, y = 7489.353515625 },
                  { x = 16935.0 + 100, y = 7591.8549804688 },
                  { x = 16800.0 + 100, y = 7632.9580078125 },
              }
            },
            { name = '应许之地-熔岩绝壁',
              area = {
                  --右上
                  { x = 16040.095703125, y = 8018.0 + 100 },
                  { x = 15886.0, y = 8019.0 + 100 },
                  { x = 15576.346679688, y = 8277.0 + 100 },
                  { x = 14946.268554688, y = 8085.0 + 100 },
                  { x = 14376.446289062, y = 7897.0 + 100 },
                  --正右
                  { x = 14376.0 - 100, y = 7897.0 + 100 },
                  --右下
                  { x = 14379.0 - 100, y = 7886.0 },
                  { x = 14338.0 - 100, y = 7235.0 },
                  { x = 14269.0 - 100, y = 6392.0 },
                  { x = 14034.0 - 100, y = 6054.6801757812 },
                  { x = 13980.0 - 100, y = 5583.0 },
                  { x = 14334.0 - 100, y = 4442.0 },
                  { x = 13820.0 - 100, y = 2311.0 },
                  { x = 13732.0 - 100, y = 1999.0 },
                  --正下
                  { x = 13732.0 - 100, y = 1999.0 - 100 },
                  --左下
                  { x = 13817.999023438, y = 2064.0 - 100 },
                  { x = 14649.0, y = 1471.0 - 100 },
                  { x = 15269.0, y = 1122.0 - 100 },
                  { x = 16030.01171875, y = 862.0 - 100 },
                  { x = 17564.0, y = 808.0 - 100 },
                  --正左
                  { x = 17564.0 + 100, y = 808.0 - 100 },
                  --左上
                  { x = 17564.0 + 100, y = 808.0 },
                  { x = 17734.0 + 100, y = 1070.0 },
                  { x = 17828.0 + 100, y = 1339.4913330078 },
                  { x = 18219.0 + 100, y = 1978.0 },
                  --正上
                  { x = 18210.0 + 10, y = 2031.0 + 10 },
                  { x = 18137.0 + 10, y = 2180.0 + 10 },
                  { x = 18069.0 + 10, y = 2345.0 + 10 },
                  { x = 18000.0 + 10, y = 2425.0 + 10 },
                  { x = 17748.0 + 10, y = 2592.0 + 10 },
                  { x = 17269.0 + 100, y = 2927.0 + 100 },
                  { x = 17147.0 + 100, y = 3233.0 + 100 },


              }
            },
            { name = '应许之地-广场',
              area = {
                  --正上
                  { x = 17347.0 + 300, y = 17698.0 + 300 },
                  { x = 15805.0 + 300, y = 18756.0 + 300 },
                  --右上
                  { x = 15805.0, y = 18756.0 + 300 },
                  { x = 14236.0, y = 18180.0 + 300 },
                  --正右
                  { x = 14236.0 - 300, y = 18180.0 + 300 },
                  --右下
                  { x = 14236.0 - 50, y = 18180.0 },
                  { x = 14232.0 - 50, y = 17934.052734375 },
                  { x = 14226.0 - 50, y = 17633.0 },
                  { x = 14221.0 - 50, y = 17381.052734375 },
                  --正右
                  { x = 13932.0 - 50, y = 17070.0 + 50 },
                  --右下
                  { x = 13932.0 - 50, y = 17070.734375 },
                  { x = 13835.0 - 50, y = 16931.0 },
                  { x = 13832.0 - 50, y = 16867.8203125 },
                  { x = 13828.0 - 50, y = 16785.681640625 },
                  { x = 13823.0 - 50, y = 16670.0 },
                  { x = 13921.0 - 50, y = 16492.0 },
                  --正下
                  { x = 13921.0 - 50, y = 16492.0 - 50 },
                  { x = 14092.0 - 50, y = 16382.0 - 50 },
                  --左下
                  { x = 14092.170898438, y = 16382.0 - 50 },
                  { x = 14233.0, y = 16377.0 - 50 },
                  { x = 14502.68359375, y = 16369.0 - 50 },
                  { x = 14766.670898438, y = 16382.0 - 50 },
                  { x = 15042.745117188, y = 16374.0 - 50 },
                  { x = 15397.0, y = 16382.0 - 50 },
                  { x = 17292.0, y = 17134.0 - 300 },
                  --正左
                  { x = 17292.0 + 300, y = 17134.0 - 300 },
                  --左上

                  { x = 17347.0 + 300, y = 17698.0 },

              }
            },
            { name = '应许之地-安息之地',
              area = {
                  --正上
                  { x = 13952.0 + 300, y = 17898.0 + 300 },
                  { x = 13338.0 + 300, y = 18354.0 + 300 },
                  { x = 11743.0 + 300, y = 19876.0 + 300 },
                  { x = 11475.0 + 300, y = 20146.0 + 300 },
                  { x = 9821.0 + 300, y = 20938.0 + 300 },
                  --右上
                  { x = 9821.56640625, y = 20938.0 + 100 },
                  { x = 9706.4541015625, y = 20895.0 + 100 },
                  { x = 9530.3134765625, y = 20844.0 + 100 },
                  { x = 9482.0, y = 20838.0 + 100 },
                  --正右
                  { x = 9482.0 - 300, y = 20838.0 + 300 },
                  --正左
                  { x = 8495.0 + 300, y = 21087.0 - 300 },
                  --左上
                  { x = 8696.0 + 300, y = 21479.0625 },
                  --右上
                  { x = 8521.259765625, y = 21627.0 + 300 },
                  --正右
                  { x = 8157.0 - 300, y = 21410.0 + 300 },
                  --右上
                  { x = 6745.0122070312, y = 20712.0 + 300 },
                  { x = 4252.0, y = 20258.0 + 300 },
                  --正右
                  { x = 4252.0 - 300, y = 20258.0 + 300 },
                  --右下
                  { x = 4252.0 - 10000, y = 20258.0 },
                  { x = 735.0 - 10000, y = 6326.6645507812 },
                  { x = 46.0 - 10000, y = 3651.4069824219 },
                  { x = 278.0 - 10000, y = 2595.0014648438 },
                  { x = 889.0 - 10000, y = -12.330755233765 },
                  --正下
                  { x = 889.0 - 300, y = -12.0 - 300 },
                  --左下
                  { x = 1234.3427734375, y = 69.0 - 300 },
                  { x = 8969.779296875, y = -628.0 - 300 },
                  --正左
                  { x = 9329.0 + 300, y = -382.0 - 300 },
                  --左上
                  { x = 9538.0 + 300, y = 79.702156066895 },
                  { x = 10063.0 + 300, y = 2541.5593261719 },
                  { x = 10090.0 + 300, y = 4282.5498046875 },
                  { x = 9877.0 + 300, y = 8982.40234375 },
                  --正左
                  { x = 15603.0 + 300, y = 13998.0 - 300 },
                  { x = 15661.0 + 300, y = 14154.0 - 300 },
                  --左上
                  { x = 15632.0 + 300, y = 14649.970703125 },
                  { x = 15637.0 + 300, y = 14807.897460938 },
                  { x = 15646.0 + 300, y = 15078.669921875 },
                  { x = 15658.0 + 300, y = 15443.615234375 },
                  { x = 15616.0 + 300, y = 15634.583007812 },
                  --正上
                  { x = 15616.0 + 300, y = 15634.0 + 100 },
                  { x = 15412.0 + 300, y = 15773.0 + 100 },
                  { x = 15204.0 + 300, y = 16178.0 + 100 },
                  --右上
                  { x = 15204.0, y = 16178.0 + 100 },
                  { x = 15016.219726562, y = 16188.0 + 100 },
                  { x = 14762.0, y = 16178.0 + 100 },
                  { x = 14384.2109375, y = 16160.0 + 100 },
                  { x = 14188.0, y = 16178.0 + 100 },
                  { x = 14007.0, y = 16130.0 + 100 },
                  { x = 13788.883789062, y = 16010.0 + 100 },
                  --正上
                  { x = 13664.0 + 50, y = 16149.0 + 50 },
                  --左上
                  { x = 13584.0 + 50, y = 16293.112304688 },
                  { x = 13744.0 + 50, y = 16670.0 },
                  { x = 13744.0 + 50, y = 16839.79296875 },
                  { x = 13712.0 + 50, y = 16962.0 },
                  --正左
                  { x = 13709.0 + 100, y = 17449.0 - 100 },
                  { x = 13804.0 + 100, y = 17550.0 - 100 },
                  { x = 13855.0 + 100, y = 17610.0 - 100 },
                  { x = 13930.0 + 100, y = 17821.0 - 100 },
                  { x = 13952.0 + 100, y = 17898.0 - 100 },
                  --左上
                  { x = 13952.0 + 100, y = 17898.0 },

              }
            },
            { name = '应许之地-陆下人浮雕连接一',
              area = {
                  --正上
                  { x = 10186.0 + 10, y = 22200.0 + 10 },
                  { x = 10124.0 + 10, y = 22363.0 + 10 },
                  { x = 10115.0 + 10, y = 22392.0 + 10 },
                  { x = 9954.0 + 10, y = 22386.0 + 10 },
                  { x = 9750.0 + 10, y = 22415.0 + 10 },
                  { x = 9570.0 + 10, y = 22582.0 + 10 },
                  --正右
                  { x = 9570.0 - 100, y = 22582.0 + 100 },
                  --右下
                  { x = 9570.0 - 100, y = 22582.0 },
                  { x = 9481.0 - 100, y = 22401.982421875 },
                  { x = 9458.0 - 100, y = 22157.25 },
                  { x = 9524.0 - 100, y = 21716.681640625 },
                  { x = 9483.0 - 100, y = 21377.56640625 },
                  { x = 9515.0 - 100, y = 21210.0 },
                  --左下
                  { x = 9515.0, y = 21210.0 - 100 },
                  { x = 9580.0, y = 21188.0 - 100 },
                  { x = 9651.0, y = 21166.0 - 100 },
                  { x = 9721.0, y = 21145.0 - 100 },
                  { x = 9782.0, y = 21169.0 - 100 },
                  { x = 9859.0, y = 21194.0 - 100 },
                  --正左
                  { x = 9859.0 + 100, y = 21194.0 - 100 },
                  { x = 10157.0 + 100, y = 21704.0 - 100 },
                  --左上
                  { x = 10157.0 + 100, y = 21704.0 },
                  { x = 10148.0 + 100, y = 21879.0 },
                  { x = 10144.0 + 100, y = 22062.0 },
                  { x = 10186.0 + 100, y = 22200.0 },


              }
            },
            { name = '应许之地-陆下人浮雕连接二',
              area = {
                  --正上
                  { x = 11406.0 + 50, y = 23278.0 + 50 },
                  { x = 11332.0 + 50, y = 23373.0 + 50 },
                  { x = 11309.0 + 50, y = 23489.0 + 50 },
                  { x = 11211.0 + 50, y = 23558.0 + 50 },
                  { x = 11128.0 + 50, y = 23581.0 + 50 },
                  { x = 10912.0 + 50, y = 23560.0 + 50 },
                  { x = 10873.0 + 50, y = 23566.0 + 50 },
                  --正右
                  { x = 10873.0 - 50, y = 23566.0 + 50 },
                  { x = 10621.0 - 50, y = 23362.0 + 50 },
                  { x = 10214.0 - 50, y = 23266.0 + 50 },
                  { x = 10009.0 - 50, y = 22805.0 + 50 },
                  --正下
                  { x = 10008.0 - 50, y = 22801.0 - 50 },
                  { x = 10024.0 - 50, y = 22741.0 - 50 },
                  { x = 10067.0 - 50, y = 22616.0 - 50 },
                  { x = 10124.0 - 50, y = 22541.0 - 50 },
                  { x = 10151.0 - 50, y = 22476.0 - 50 },
                  { x = 10168.0 - 50, y = 22436.0 - 50 },
                  { x = 10201.0 - 50, y = 22391.0 - 50 },
                  { x = 10222.0 - 50, y = 22312.0 - 50 },
                  { x = 10213.0 - 50, y = 22270.0 - 50 },
                  { x = 10659.0 - 50, y = 22419.0 - 50 },
                  --正左
                  { x = 10659.0 + 50, y = 22419.0 - 50 },
                  { x = 10860.0 + 50, y = 22522.0 - 50 },
                  { x = 11092.0 + 50, y = 22652.0 - 50 },

              }
            },
            { name = '应许之地-陆下人浮雕',
              area = {
                  --正上
                  { x = 17744.0 + 300, y = 26719.0 + 300 },
                  --右上
                  { x = 17744.861328125, y = 26719.0 + 300 },
                  { x = 17735.9609375, y = 26702.0 + 300 },
                  { x = 16940.9921875, y = 26738.0 + 300 },
                  { x = 13182.537109375, y = 26963.0 + 300 },
                  { x = 10278.596679688, y = 27030.0 + 300 },
                  { x = 9300.6337890625, y = 26082.0 + 300 },
                  --正右
                  { x = 9300.0 - 300, y = 26082.0 + 300 },
                  --正下
                  { x = 9274.0 - 300, y = 25703.0 - 300 },
                  { x = 10073.0 - 300, y = 25277.0 - 300 },
                  { x = 10558.0 - 300, y = 24818.0 - 300 },
                  { x = 10763.0 - 300, y = 23878.0 - 300 },
                  --左下
                  { x = 10763.0, y = 23878.0 - 50 },
                  { x = 10799.399414062, y = 23868.0 - 50 },
                  { x = 10897.0, y = 23842.0 - 50 },
                  { x = 11026.0, y = 23798.0 - 50 },
                  { x = 11175.0, y = 23764.0 - 50 },
                  --正下
                  { x = 11305.0 - 50, y = 23666.0 - 50 },
                  { x = 11357.0 - 50, y = 23614.0 - 50 },
                  { x = 11406.0 - 50, y = 23587.0 - 50 },
                  { x = 11455.0 - 50, y = 23548.0 - 50 },
                  { x = 11551.0 - 50, y = 23486.0 - 50 },
                  --正左
                  { x = 11551.0 + 300, y = 23486.0 - 300 },
                  { x = 13025.0 + 300, y = 24583.0 - 300 },

                  --左下
                  { x = 16976.0, y = 22084.0 - 300 },
                  { x = 17052.0, y = 22092.0 - 300 },
                  { x = 17120.0, y = 22091.0 - 300 },
                  --左上
                  { x = 17120.0 + 300, y = 22091.0 },
                  { x = 17511.0 + 300, y = 23582.0 },
                  { x = 17654.0 + 300, y = 24272.4921875 },
                  { x = 18083.0 + 300, y = 25641.970703125 },
                  { x = 18070.0 + 300, y = 26459.0 },
                  --正上
                  { x = 18070.0 + 300, y = 26459.0 + 300 },


              }
            },
        },

        ['未竟庭院'] = {
            {
                name = '未竟庭院-二楼',
                area = {
                    --右下
                    { x = -24143.0 - 10, y = 13128.0 },
                    { x = -24224.0 - 10, y = 13106.848632812 },
                    { x = -24252.0 - 10, y = 13069.0 },
                    { x = -24266.0 - 10, y = 13033.0 },
                    { x = -24295.0 - 10, y = 13005.0 },
                    { x = -24325.0 - 10, y = 12958.0 },
                    { x = -24363.0 - 10, y = 12920.0 },
                    { x = -24385.0 - 10, y = 12878.0 },
                    { x = -24417.0 - 10, y = 12839.0 },
                    { x = -24359.0 - 300, y = 12595.485351562 }, --大点
                    --正下
                    { x = -24247.0 - 300, y = 11899.0 - 300 },
                    { x = -22627.0 - 300, y = 7166.0 - 300 },
                    --左下
                    { x = -21326.0, y = 6993.0 - 300 },
                    --正左
                    { x = -21326.0 + 300, y = 6993.0 - 300 },
                    --左上
                    { x = -21326.0 + 300, y = 6993.0 },
                    { x = -21190.0 + 300, y = 8245.0 },
                    --正上
                    { x = -21190.0 + 300, y = 8245.0 + 300 },
                    { x = -22685.0 + 300, y = 12808.0 + 300 },
                    { x = -23173.0 + 300, y = 13258.0 + 300 },
                    --右上
                    { x = -23780.0, y = 13239.0 + 300 },


                },
                min_cz = 1800,
                overlap = {
                    ['未竟庭院-二楼'] = 1800, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['未竟庭院-大右'] = 1800,
                },

            },
            {
                name = '未竟庭院-小正上',
                area = {

                    --正上
                    { x = -3133.0 + 300, y = 21765.0 + 300 },
                    -- 右上
                    { x = -4403.0, y = 21636.0 + 300 },
                    { x = -5060.0, y = 21484.0 + 300 },
                    --正右
                    { x = -5529.0 - 300, y = 20853.0 + 300 },
                    --右下
                    { x = -5529.0 - 300, y = 20853.0 },
                    --正下
                    { x = -5528.0 - 50, y = 20677.0 - 50 },
                    { x = -4812.0 - 50, y = 19711.0 - 50 },
                    { x = -4778.0 - 50, y = 19653.0 - 50 },
                    { x = -4722.0 - 50, y = 19630.0 - 50 },
                    { x = -3816.0 - 50, y = 19017.0 - 50 },
                    --左下
                    { x = -3713.0, y = 18960.0 - 50 },
                    { x = -3614.0, y = 19057.0 - 50 },
                    --正左
                    { x = -3423.0 + 50, y = 19280.0 - 50 },
                    --左下
                    { x = -3166.0, y = 19329.0 - 300 },
                    --正下
                    { x = -2925.0 - 300, y = 19201.0 - 300 },
                    --正左
                    { x = -2925.0 + 300, y = 19201.0 - 300 },
                    { x = -2820.0 + 300, y = 19437.0 - 300 },
                    --左上
                    { x = -2977.0 + 300, y = 21240.0 },
                    { x = -3133.0 + 300, y = 21765.0 },


                }
            },
            {
                name = '未竟庭院-小正左',
                area = {
                    --正上
                    { x = -3318.0 + 50, y = 18924.0 + 50 },
                    { x = -3455.0 + 50, y = 19026.0 + 50 },
                    --正右
                    { x = -3455.0 - 50, y = 19026.0 + 50 },
                    { x = -3502.0 - 50, y = 18981.0 + 50 },
                    { x = -3537.0 - 50, y = 18945.0 + 50 },
                    { x = -3607.0 - 50, y = 18876.0 + 50 },
                    { x = -3675.0 - 50, y = 18809.0 + 50 },
                    { x = -3722.0 - 50, y = 18765.0 + 50 },
                    { x = -3729.0 - 50, y = 18740.0 + 50 },
                    --右下
                    { x = -3729.0 - 50, y = 18740.0 },
                    --正下
                    { x = -3729.0 - 50, y = 18740.0 - 50 },
                    --正右
                    { x = -4225.0 - 50, y = 18097.0 + 50 },
                    { x = -4519.0 - 50, y = 17935.0 + 50 },
                    --右上
                    { x = -4522.0, y = 17935.0 + 50 },
                    { x = -4535.0, y = 17886.0 + 50 },
                    { x = -4542.0, y = 17867.0 + 50 },
                    { x = -4550.0, y = 17815.0 + 50 },
                    { x = -4555.0, y = 17784.0 + 50 },
                    { x = -4560.0, y = 17714.0 + 50 },
                    { x = -4564.0, y = 17650.0 + 50 },
                    { x = -4570.0, y = 17581.0 + 50 },
                    --正右
                    { x = -4570.0 - 50, y = 17581.0 + 50 },
                    --右下
                    { x = -4570.0 - 50, y = 17581.0 },
                    { x = -4576.0 - 50, y = 17508.0 },
                    { x = -4569.0 - 50, y = 17443.0 },
                    { x = -4548.0 - 50, y = 17393.0 },
                    { x = -4535.0 - 50, y = 17346.0 },
                    { x = -4576.0 - 50, y = 17266.0 },
                    { x = -4605.0 - 50, y = 17203.0 },
                    { x = -4592.0 - 50, y = 17141.0 },
                    --正下
                    { x = -4592.0 - 50, y = 17141.0 - 50 },
                    { x = -3722.0 - 50, y = 16509.0 - 50 },
                    --左下
                    { x = -3722.0, y = 16509.0 - 300 },
                    --正左
                    { x = -3057.0 + 50, y = 16302.0 - 50 },
                    { x = -2783.0 + 50, y = 16905.0 - 50 },
                    { x = -2664.0 + 50, y = 17102.0 - 50 },
                    --左上
                    { x = -2664.0 + 50, y = 17102.0 },
                    { x = -3061.0 + 50, y = 18350.0 },

                }
            },
            {
                name = '未竟庭院-连接',
                area = {
                    --正左
                    { x = -6747.0 + 50, y = 12194.0 - 50 },
                    --左上
                    { x = -6658.0 + 50, y = 12283.0 },
                    { x = -6664.0 + 50, y = 12300.483398438 },
                    { x = -6683.0 + 50, y = 12365.0 },
                    { x = -6762.0 + 50, y = 12503.27734375 },
                    { x = -6795.0 + 50, y = 12844.0 },

                    --正左
                    { x = -6565.0 + 50, y = 13216.0 - 50 },
                    { x = -5846.0 + 50, y = 13751.0 - 50 },
                    { x = -4885.0 + 50, y = 14632.0 - 50 },
                    { x = -4469.0 + 50, y = 15051.0 - 50 },
                    { x = -4271.0 + 50, y = 16111.0 - 50 },
                    --左上
                    { x = -4294.0 + 50, y = 16179.0 },
                    { x = -4369.0 + 50, y = 16418.0 },
                    { x = -4473.0 + 50, y = 16727.337890625 },
                    { x = -4657.0 + 50, y = 16992.05859375 },
                    { x = -4654.0 + 50, y = 17267.0 },
                    { x = -4749.0 + 50, y = 17424.65234375 },
                    { x = -4803.0 + 50, y = 17558.59375 },
                    { x = -4691.0 + 50, y = 17772.271484375 },
                    { x = -4679.0 + 50, y = 17958.0 },
                    { x = -4707.0 + 50, y = 18218.0 },
                    { x = -4614.0 + 50, y = 18481.0 },
                    --正上
                    { x = -4614.0 + 50, y = 18481.0 + 50 },
                    { x = -4778.0 + 50, y = 18707.0 + 50 },
                    { x = -4940.0 + 50, y = 18880.0 + 50 },

                    --左上
                    { x = -4855.0 + 50, y = 19435.76171875 },
                    --正上
                    { x = -4902.0 + 50, y = 19487.0 + 50 },
                    --右上
                    { x = -5004.0, y = 19510.0 + 50 },
                    --正上
                    { x = -5716.0 + 50, y = 19621.0 + 50 },
                    --正左
                    { x = -6533.0 + 50, y = 20424.0 - 50 },
                    --左上
                    { x = -6533.0 + 50, y = 20424.8125 },
                    { x = -6518.0 + 50, y = 20600.494140625 },
                    { x = -6731.0 + 50, y = 21018.0 },
                    { x = -6846.0 + 50, y = 21536.060546875 },
                    --正上
                    { x = -6846.0 + 50, y = 21536.0 + 50 },
                    --右上
                    { x = -6846.1831054688, y = 21536.0 + 50 },
                    { x = -7555.0, y = 21725.0 + 50 },
                    { x = -8398.185546875, y = 21441.0 + 50 },
                    { x = -9251.029296875, y = 21472.0 + 50 },
                    { x = -10408.880859375, y = 21669.0 + 50 },
                    --正右
                    { x = -10987.0 - 50, y = 21091.0 + 50 },
                    { x = -11828.0 - 50, y = 19523.0 + 50 },
                    --右下
                    { x = -11828.0 - 50, y = 19523.91015625 },
                    { x = -11837.0 - 50, y = 19418.0 },
                    { x = -11843.0 - 50, y = 19298.0 },
                    { x = -11847.0 - 50, y = 19120.48828125 },
                    { x = -11847.0 - 50, y = 19063.75 },
                    { x = -11847.0 - 50, y = 18971.0 },
                    { x = -11847.0 - 50, y = 18900.0 },
                    --正下
                    { x = -11847.0 - 50, y = 18900.0 - 50 },
                    { x = -11448.0 - 50, y = 16499.0 - 50 },
                    { x = -11367.0 - 50, y = 16054.0 - 50 },
                    { x = -10873.0 - 50, y = 15466.0 - 50 },
                    { x = -10195.0 - 50, y = 15296.0 - 50 },
                    --左下
                    { x = -10115.194335938, y = 15228.0 - 50 },
                    { x = -8148.0, y = 15593.0 - 50 },
                    --正左
                    { x = -7922.0 + 50, y = 15704.0 - 50 },
                    --左上
                    { x = -7922.0 + 50, y = 15704.0 },
                    { x = -7927.0 + 50, y = 15709.584960938 },
                    { x = -7759.0 + 50, y = 16350.0 },
                    { x = -7823.0 + 50, y = 16813.91015625 },
                    { x = -7800.0 + 50, y = 17016.27734375 },
                    --正上
                    { x = -7932.0 + 50, y = 17295.0 + 50 },
                    --正左
                    { x = -7282.0 + 50, y = 18288.0 - 50 },
                    { x = -7145.0 + 50, y = 18727.0 - 50 },
                    --左下
                    { x = -6968.9965820312, y = 18756.0 - 50 },
                    { x = -6824.9951171875, y = 18746.0 - 50 },
                    { x = -6654.8935546875, y = 18738.0 - 50 },
                    { x = -6401.2573242188, y = 18774.0 - 50 },
                    { x = -6076.0, y = 18861.0 - 50 },
                    { x = -5674.4594726562, y = 18711.0 - 50 },
                    --右下
                    { x = -5465.0 - 50, y = 18230.0 },
                    { x = -5173.0 - 50, y = 17840.853515625 },
                    { x = -5098.0 - 50, y = 17639.546875 },
                    { x = -5040.0 - 50, y = 17381.755859375 },
                    --正右
                    { x = -5040.0 - 50, y = 17381.0 + 50 },
                    --右下
                    { x = -5040.0 - 50, y = 17381.755859375 },
                    { x = -5278.0 - 50, y = 17136.962890625 },
                    { x = -5292.0 - 50, y = 17082.7109375 },
                    { x = -5291.0 - 50, y = 17041.0 },
                    { x = -5260.0 - 50, y = 16985.69140625 },
                    { x = -5269.0 - 50, y = 16064.0 },
                    { x = -5412.0 - 50, y = 15699.9296875 },
                    --右上
                    { x = -5727.7534179688, y = 15234.0 + 50 },
                    { x = -5961.69921875, y = 15191.0 + 50 },
                    { x = -6199.3247070312, y = 15287.0 + 50 },
                    { x = -6398.0234375, y = 15306.0 + 50 },
                    --正右
                    { x = -6398.0 - 50, y = 15306.0 + 50 },
                    { x = -6507.0 - 50, y = 15152.0 + 50 },
                    { x = -6735.0 - 50, y = 14976.0 + 50 },
                    { x = -7317.0 - 50, y = 13870.0 + 50 },
                    { x = -7356.0 - 50, y = 12693.0 + 50 },
                    --右下
                    { x = -7356.0 - 50, y = 12693.446289062 },
                    --正下
                    { x = -7356.0 - 50, y = 12693.0 - 50 },
                    { x = -7209.0 - 50, y = 12441.0 - 50 },
                    { x = -6953.0 - 50, y = 12277.0 - 50 },
                    { x = -6759.0 - 50, y = 12183.0 - 50 },


                }
            },
            {
                name = '未竟庭院-小正下',
                area = {
                    --正上
                    { x = -5851.0 + 50, y = 17779.0 + 50 },
                    --右上
                    { x = -6814.0, y = 18060.0 + 50 },
                    --正右
                    { x = -6814.0 - 50, y = 18060.0 + 50 },
                    { x = -6954.0 - 50, y = 17988.0 + 50 }, --false
                    { x = -7057.0 - 50, y = 17098.0 + 50 },
                    { x = -7155.0 - 50, y = 16993.0 + 50 }, --false
                    --右下
                    { x = -7155.0 - 50, y = 16993.0 }, --false

                    --正下
                    { x = -7155.0 - 50, y = 16993.0 - 50 }, --false
                    { x = -7078.0 - 50, y = 16377.0 - 50 },
                    { x = -7145.0 - 300, y = 16592.80078125 }, --false

                    { x = -6998.0 - 300, y = 16297.0 - 300 }, --false
                    { x = -5990.0 - 50, y = 15910.0 - 50 },
                    --左下
                    { x = -5990.0, y = 15910.0 - 50 },
                    --正左
                    { x = -5990.0 + 50, y = 15910.0 - 50 },
                    { x = -5795.0 + 50, y = 16189.0 - 50 },
                    --左上
                    { x = -5598.0 + 50, y = 17062.0 },
                    { x = -5851.0 + 50, y = 17779.0 },

                }
            },
            {
                name = '未竟庭院-大左',
                area = {
                    --正上
                    { x = -2271.0 + 300, y = 10022.0 + 300 },
                    { x = -5688.0 + 300, y = 12329.0 + 300 },
                    --右上
                    { x = -5688.0, y = 12329.0 + 300 },
                    { x = -5803.0, y = 12339.0 + 300 },
                    { x = -5919.0, y = 12349.0 + 300 },
                    { x = -6151.0, y = 12494.0 + 300 },
                    { x = -6238.0, y = 12523.0 + 300 },
                    { x = -6529.0, y = 12438.0 + 300 },
                    --正右
                    { x = -6529.0 - 300, y = 12438.0 + 300 },
                    --右下
                    { x = -6536.0 - 50, y = 12450.0 },
                    { x = -6538.0 - 50, y = 12406.103515625 },
                    { x = -6543.0 - 50, y = 12335.0 },
                    { x = -6545.0 - 50, y = 12291.026367188 },
                    { x = -6549.0 - 50, y = 12233.0 },
                    { x = -6502.0 - 50, y = 12174.0 },
                    { x = -6466.0 - 50, y = 12056.0 },
                    { x = -6570.0 - 50, y = 11794.0 },
                    --正上
                    { x = -7713.0, y = 11221.0 },
                    { x = -8253.0, y = 11702.0 },
                    --左上
                    { x = -8722.0 + 300, y = 12781.0 },
                    --正上
                    { x = -9525.1806640625, y = 13503.638671875 },
                    --右上
                    { x = -9525.0, y = 13503.0 + 300 },
                    --正右
                    { x = -9794.0 - 300, y = 13525.0 + 300 },
                    { x = -10396.0 - 300, y = 12795.0 + 300 },
                    { x = -10592.0 - 300, y = 12574.0 + 300 },
                    --正上
                    { x = -14371.0, y = 13776.0 },
                    { x = -14695.0, y = 14040.0 },
                    --正右
                    { x = -14695.0 - 300, y = 14040.0 + 300 },
                    { x = -15108.0 - 300, y = 13998.0 + 300 },
                    { x = -16507.0 - 300, y = 12620.0 + 300 },
                    { x = -17812.0 - 300, y = 11187.0 + 300 },
                    { x = -18804.0 - 300, y = 5160.0 + 300 },
                    { x = -20131.0 - 300, y = 4429.0 + 300 },
                    { x = -20866.0 - 300, y = 3675.0 + 300 },
                    --右下
                    { x = -20866.0 - 300, y = 3676.0698242188 },
                    { x = -20729.0 - 300, y = 1055.7094726562 },
                    --正下
                    { x = -20611.0 - 300, y = 449.0 - 300 },
                    --左下
                    { x = -20611.0, y = 449.0 - 300 },
                    { x = -19553.0, y = 561.0 - 300 },
                    { x = -13170.0, y = 2575.0 - 300 },
                    { x = -10819.0, y = 2041.0 - 300 },
                    { x = -10193.0, y = 2531.0 - 300 },
                    --正左
                    { x = -2085.0 + 300, y = 8358.0 - 300 },
                    --左上
                    { x = -2085.0 + 300, y = 8358.0 },
                    { x = -2096.0 + 300, y = 9556.875 },
                    { x = -2271.0 + 300, y = 10022.0 },

                }
            },
            {
                name = '未竟庭院-大右',
                area = {
                    --正左
                    { x = -14492.0 + 300, y = 15632.0 - 300 },
                    { x = -14359.0 + 300, y = 15655.0 - 300 },
                    { x = -14186.0 + 300, y = 15875.0 - 300 },
                    { x = -13775.0 + 300, y = 16360.0 - 300 },
                    { x = -13587.0 + 300, y = 16598.0 - 300 },
                    --左上
                    { x = -13701.0 + 300, y = 16920.0 },
                    --正左
                    { x = -11970.0 + 300, y = 18914.0 - 300 },
                    --左上
                    { x = -11970.0 + 50, y = 18914.025390625 },
                    { x = -11959.0 + 50, y = 18966.0 },
                    { x = -11961.0 + 50, y = 19005.0 },
                    { x = -11967.0 + 50, y = 19083.0 },
                    { x = -11978.0 + 50, y = 19154.0 },
                    { x = -12032.0 + 50, y = 19317.1640625 },
                    --正上
                    { x = -12032.0 + 50, y = 19317.0 + 50 },
                    --右上
                    { x = -12032.747070312, y = 19317.0 + 300 },
                    --正左
                    { x = -12689.0 + 300, y = 21531.0 - 300 },
                    { x = -12660.0 + 300, y = 22303.0 - 300 },
                    { x = -12490.0 + 300, y = 23891.0 - 300 },
                    --正上
                    { x = -12384.0 + 300, y = 24253.0 + 300 },
                    --右上
                    { x = -12384.0, y = 24253.0 + 300 },
                    { x = -13532.0, y = 24491.0 + 300 },
                    { x = -15719.0, y = 24629.0 + 300 },
                    { x = -17207.806640625, y = 24410.0 + 300 },
                    { x = -20293.828125, y = 21851.0 + 300 },
                    { x = -23748.34765625, y = 21305.0 + 300 },
                    { x = -24619.978515625, y = 20835.0 + 300 },
                    { x = -25712.0, y = 19827.0 + 300 },
                    --正右
                    { x = -25712.0 - 300, y = 19827.0 + 300 },
                    --右下
                    { x = -25712.0 - 300, y = 19827.0 },
                    { x = -25330.0 - 300, y = 17273.0 },
                    --正下
                    { x = -25330.0 - 300, y = 17273.0 - 300 },
                    { x = -25604.0 - 300, y = 12233.0 - 300 },
                    { x = -24129.0 - 300, y = 11777.0 - 300 },
                    --左下

                    { x = -23509.361328125, y = 11650.0 - 300 },
                    --正左
                    { x = -22863.0 + 300, y = 12190.0 - 300 },
                    --左上
                    { x = -22755.0 + 300, y = 12691.444335938 },
                    --正上
                    { x = -23088.0 + 300, y = 13087.0 + 300 },
                    --右上
                    { x = -24047.830078125, y = 13040.0 + 300 },
                    --正上
                    { x = -24215.0 + 10, y = 13187.0 + 10 },
                    --正右
                    { x = -24215.0 - 10, y = 13187.0 + 10 },
                    { x = -24236.0 - 10, y = 13149.0 + 10 },
                    { x = -24256.0 - 10, y = 13107.0 + 10 },
                    { x = -24287.0 - 10, y = 13076.0 + 10 },
                    { x = -24325.0 - 10, y = 13010.0 + 10 },
                    { x = -24347.0 - 10, y = 12981.0 + 10 },
                    { x = -24390.0 - 10, y = 12937.0 + 10 },
                    { x = -24416.0 - 10, y = 12883.0 + 10 },
                    { x = -24445.0 - 10, y = 12854.0 + 10 },
                    { x = -24470.0 - 10, y = 12829.0 + 10 },
                    { x = -24479.0 - 10, y = 12803.0 + 10 },
                    --右上
                    { x = -24421.0, y = 12573.0 + 50 },
                    { x = -24625.0, y = 12584.0 + 50 },
                    { x = -24723.0, y = 12637.0 + 50 },
                    { x = -24827.0, y = 12621.0 + 50 },
                    { x = -24929.0, y = 12630.0 + 50 },
                    --正左
                    { x = -25231.0 + 50, y = 12960.0 - 50 },
                    { x = -24998.0 + 50, y = 13465.0 - 50 },
                    { x = -24815.0 + 50, y = 13456.0 - 50 },
                    { x = -24513.0 + 50, y = 13670.0 - 50 },
                    { x = -24198.0 + 300, y = 14082.0 - 300 },
                    { x = -23516.0 + 300, y = 14425.0 - 300 },
                    { x = -22837.0 + 300, y = 14437.0 - 300 },
                    { x = -22172.0 + 300, y = 14767.0 - 300 },
                    --正下
                    { x = -21527.0 - 300, y = 14500.0 - 300 },
                    { x = -20490.0 - 300, y = 13621.0 - 300 },
                    --左下
                    { x = -20490.0, y = 13621.0 - 300 },
                    { x = -18940.0, y = 13893.0 - 300 },
                    --正左
                    { x = -18940.0 + 300, y = 13893.0 - 300 },
                    --正下
                    { x = -15601.0 - 300, y = 15694.0 - 300 },
                    --左下
                    { x = -14492.0, y = 15632.0 - 300 },


                },
                min_cz = 0,
            },
            {
                name = '未竟庭院-升降机',
                area = {
                    { x = -24261.0 + 20, y = 13143.0 },
                    { x = -24261.0 + 20, y = 13143.0 + 20 },
                    { x = -24548.0, y = 13365.0 + 20 }, --false
                    { x = -24558.0, y = 13351.0 + 20 },

                    { x = -24746.0 - 20, y = 13073.0 },
                    { x = -24466.0, y = 12858.0 - 10 },
                }
            }

        },

        ['铁锤工坊'] = {
            {
                name = '铁锤工坊-中间',
                area = {
                    --正上
                    { x = -27397.0 + 300, y = -27282.0 + 300 },
                    { x = -27967.0 + 300, y = -26325.0 + 300 },
                    { x = -28069.0 + 300, y = -26201.0 + 300 },
                    { x = -28745.0 + 300, y = -25846.0 + 300 },
                    -- 右上
                    { x = -28745.0, y = -25846.0 + 300 },
                    --正右
                    { x = -28745.0 - 300, y = -25846.0 + 300 },
                    { x = -29133.0 - 100, y = -26259.0 + 100 },
                    --右下
                    { x = -29133.0 - 50, y = -26259.0 },
                    { x = -29198.0 - 50, y = -26356.0 },
                    { x = -29220.0 - 50, y = -26441.0 },
                    { x = -29268.0 - 50, y = -26516.0 },
                    { x = -29294.0 - 50, y = -26593.0 },
                    { x = -29312.0 - 50, y = -26672.0 },
                    { x = -29307.0 - 50, y = -26748.0 },
                    { x = -29319.0 - 50, y = -26844.0 },
                    { x = -29314.0 - 50, y = -26937.0 },
                    { x = -29308.0 - 50, y = -27040.0 },
                    { x = -29309.0 - 50, y = -27167.0 },
                    { x = -29078.0 - 50, y = -27564.0 },
                    --正下
                    { x = -29078.0 - 300, y = -27564.0 - 300 },
                    { x = -28966.0 - 300, y = -27722.0 - 300 },
                    --左上
                    { x = -28966.0 - 300, y = -27722.0 - 300 },

                    { x = -28052.0 + 300, y = -27909.0 - 300 }, --false

                    { x = -28052.0 + 300, y = -27909.0 },


                },
            },
            {
                name = '铁锤工坊-连接点',
                area = {
                    -- 正上
                    { x = -29476.0 + 100, y = -25818.0 + 100 },
                    { x = -30021.0 + 100, y = -25329.0 + 100 },
                    -- 右上
                    { x = -30021.0, y = -25329.0 + 50 },
                    { x = -30254.0, y = -25342.0 + 50 },
                    --正右
                    { x = -30485.0 - 50, y = -25418.0 + 50 },
                    --右下
                    { x = -30485.0 - 50, y = -25418.0 },
                    { x = -30489.0 - 50, y = -25524.0 },
                    { x = -30473.0 - 50, y = -25700.0 },
                    { x = -30478.0 - 50, y = -25767.0 },
                    { x = -30484.0 - 50, y = -25840.0 },
                    { x = -30485.0 - 50, y = -26054.0 },
                    { x = -30481.0 - 50, y = -26135.0 },
                    { x = -30474.0 - 50, y = -26222.0 },
                    { x = -30476.0 - 50, y = -26267.0 },
                    { x = -30475.0 - 50, y = -26374.0 },
                    { x = -30477.0 - 50, y = -26469.0 },
                    { x = -30469.0 - 50, y = -26673.0 },
                    { x = -30465.0 - 50, y = -26800.0 },
                    --正右
                    { x = -30465.0 - 50, y = -26800.0 + 50 },
                    --右下
                    { x = -30744.0 - 50, y = -27070.0 },
                    { x = -30750.0 - 50, y = -27152.0 },
                    { x = -30759.0 - 50, y = -27357.0 },
                    --正下
                    { x = -30759.0 - 50, y = -27357.0 - 50 },
                    --左下
                    { x = -30691.0, y = -27351.0 - 50 },
                    { x = -30542.0, y = -27384.0 - 50 },
                    { x = -30339.0, y = -27554.0 - 50 },
                    { x = -30129.0, y = -27561.0 - 50 },
                    { x = -29954.0, y = -27567.0 - 50 },
                    { x = -29796.0, y = -27446.0 - 50 },
                    { x = -29699.0, y = -27363.0 - 50 },
                    --正左
                    { x = -29699.0 + 50, y = -27363.0 - 50 },
                    --左上
                    { x = -29637.0 + 50, y = -27266.0 },
                    { x = -29460.0 + 50, y = -27131.0 },
                    { x = -29457.0 + 50, y = -27069.0 },
                    { x = -29454.0 + 50, y = -26997.0 },
                    { x = -29450.0 + 50, y = -26918.0 },
                    { x = -29447.0 + 50, y = -26870.0 },
                    { x = -29513.0 + 50, y = -26512.0 },
                    { x = -29439.0 + 50, y = -26388.0 },
                    { x = -29442.0 + 50, y = -26281.0 },
                    { x = -29433.0 + 50, y = -26220.0 },
                    { x = -29405.0 + 50, y = -25944.0 },

                },
                min_cz = 3400,
            },
            {
                name = '铁锤工坊-大板块',
                area = {
                    --正上
                    { x = -29509.0 + 100, y = -28350.0 + 100 },
                    { x = -30088.0 + 100, y = -27890.0 + 100 },
                    --右上
                    { x = -30088.0, y = -27890.0 + 100 },
                    { x = -30265.0, y = -27858.0 + 100 },
                    { x = -30640.0, y = -27958.0 + 100 },
                    --正上
                    { x = -30967.0 + 100, y = -27954.0 + 100 },
                    --左上
                    { x = -31099.0 + 50, y = -27589.0 },
                    { x = -30901.0 + 50, y = -27321.0 },
                    { x = -30898.0 + 50, y = -27259.0 },
                    { x = -30890.0 + 50, y = -27085.0 },
                    { x = -30942.0 + 50, y = -26967.0 },
                    { x = -31181.0 + 50, y = -26601.0 },
                    { x = -31125.0 + 50, y = -26291.0 },
                    { x = -30950.0 + 50, y = -25961.0 },
                    { x = -30741.0 + 50, y = -25750.0 },
                    { x = -30594.0 + 50, y = -25509.0 },
                    { x = -30677.0 + 50, y = -25228.0 },
                    --正左
                    { x = -30453.0 + 50, y = -24910.0 - 50 },
                    --左下
                    { x = -29692.0, y = -24743.0 - 50 },
                    { x = -29347.0, y = -24639.0 - 50 },
                    { x = -28841.0, y = -24590.0 - 50 },
                    { x = -28411.0, y = -24775.0 - 50 },
                    --正左
                    { x = -28137.0 + 50, y = -24483.0 - 50 },
                    --左上
                    { x = -28137.0 + 50, y = -24483.0 },
                    { x = -27982.0 + 50, y = -24146.0 },
                    { x = -28178.0 + 50, y = -23694.0 },
                    --正上
                    { x = -28178.0 + 500, y = -23694.0 + 500 },
                    --左上
                    { x = -28639.0 + 500, y = -21062.0 },
                    { x = -29048.0 + 500, y = -18958.0 },
                    --正上
                    { x = -29048.0 + 500, y = -18958.0 + 500 },
                    { x = -29397.0 + 500, y = -18638.0 + 500 },
                    { x = -30332.0 + 500, y = -18328.0 + 500 },
                    --右上
                    { x = -30332.361328125, y = -18328.0 + 3000 },
                    { x = -33933.0, y = -20400.0 + 3000 },
                    --正右
                    { x = -33933.0 - 3000, y = -20400.0 + 3000 },
                    { x = -35147.0 - 3000, y = -25685.0 + 3000 },
                    --右下
                    { x = -35147.0 - 3000, y = -25685.0 },
                    --正右
                    { x = -34276.0 - 3000, y = -28834.0 + 3000 },
                    --正下
                    { x = -34275.0 - 3000, y = -28726.0 - 3000 },
                    { x = -33194.0 - 3000, y = -30847.0 - 3000 },
                    { x = -32800.0 - 3000, y = -31629.0 - 3000 },

                    --左下
                    { x = -32800.0, y = -31629.0 - 3000 },
                    --正左
                    { x = -8618.0 + 3000, y = -32403.0 - 3000 },
                    --左上
                    { x = -5771.0 + 3000, y = -29249.974609375 },
                    { x = -6992.0 + 3000, y = -12772.095703125 },
                    --正上
                    { x = -6991.0 + 3000, y = -12774.0 + 3000 },
                    { x = -16087.0 + 3000, y = -5280.0 + 3000 },
                    { x = -20711.0 + 3000, y = -1339.0 + 3000 },
                    --右上
                    { x = -20709.90234375, y = -1339.0 + 3000 },
                    --正右
                    { x = -21269.0 - 3000, y = -1333.0 + 3000 },
                    --右下
                    { x = -21269.0 - 3000, y = -1333.6850585938 },
                    { x = -23628.0 - 3000, y = -5332.6264648438 },
                    { x = -25151.0 - 3000, y = -13361.584960938 },
                    { x = -25979.0 - 500, y = -14225.579101562 },
                    { x = -25575.0 - 500, y = -16909.12109375 },
                    { x = -26355.0 - 500, y = -18220.73828125 },
                    { x = -26359.0 - 500, y = -20751.900390625 },
                    --正下
                    { x = -26284.0 - 500, y = -22901.0 - 500 },
                    { x = -25632.0 - 500, y = -23992.0 - 500 },
                    --正右
                    { x = -23242.0 - 100, y = -28161.0 + 100 },
                    --右上
                    { x = -26001.100, y = -29776.0 + 100 },
                    { x = -28745.100, y = -29468.0 + 100 },
                    --左上
                    { x = -29509.0 + 100, y = -28350.0 },
                },
                min_cz = nil, -- 指定了当前区的Z坐标[存在重叠区域时使用]
                overlap = {
                    ['铁锤工坊-连接点'] = 2900,
                }
            },

        },

        ['破败的泽纳尔'] = {
            {
                name = '破败的泽纳尔-右边',
                area = {
                    --正左
                    { x = 18594.0 + 10, y = 9891.0 - 10 },
                    { x = 18699.0 + 10, y = 10072.0 - 10 },
                    { x = 18808.0 + 10, y = 10184.0 - 10 },
                    { x = 18930.0 + 10, y = 10299.0 - 10 },
                    --正上
                    { x = 18930.0 + 300, y = 10299.0 + 300 },
                    --正左
                    { x = 20846.0 + 300, y = 12407.0 - 300 },
                    --左上
                    { x = 20366.0 + 300, y = 14737.0 },
                    --正上
                    { x = 19731.0 + 300, y = 16692.0 + 300 },
                    { x = 15819.0 + 300, y = 22202.0 + 300 },
                    { x = 13752.0 + 300, y = 22484.0 + 300 },
                    --正右
                    { x = 13409.0 - 300, y = 22250.0 + 300 },
                    { x = 11917.0 - 300, y = 20847.0 + 300 },
                    { x = 10836.0 - 300, y = 18710.0 + 300 },
                    --正下
                    { x = 10835.0 - 300, y = 18708.0 - 300 },
                    { x = 12227.0 - 300, y = 17718.0 - 300 },
                    --左下
                    { x = 12227.733398438, y = 17718.0 - 300 },
                    --正下
                    { x = 17762.0 - 300, y = 16812.0 - 300 },
                    --正上
                    { x = 16949.0 + 300, y = 13304.0 + 300 },
                    --正右
                    { x = 16949.0 - 300, y = 13304.0 + 300 },
                    --右下
                    { x = 16949.0 - 300, y = 13304.0 },
                    { x = 16926.0 - 300, y = 13191.0 },
                    { x = 16909.0 - 300, y = 13135.0 },
                    { x = 16893.0 - 300, y = 13075.0 },
                    { x = 16878.0 - 300, y = 13006.0 },
                    { x = 16864.0 - 300, y = 12940.0 },
                    --正下
                    { x = 16864.0 - 300, y = 12940.0 - 300 },
                    { x = 18160.0 - 300, y = 9967.0 - 300 },
                    --左下
                    { x = 18594.0, y = 9891.0 - 300 },
                },
            },
            {
                name = '破败的泽纳尔-中间',
                area = {
                    --右上
                    { x = 26326.1796875, y = 17320.0 + 300 },
                    --正右
                    { x = 23179.0 - 300, y = 18251.0 + 300 },
                    { x = 22677.0 - 300, y = 17834.0 + 300 },
                    { x = 22465.0 - 300, y = 15830.0 + 300 },
                    { x = 22091.0 - 300, y = 12661.0 + 300 },
                    { x = 21383.0 - 300, y = 11902.0 + 300 },
                    { x = 22245.0 - 300, y = 9674.0 + 300 },
                    { x = 21713.0 - 300, y = 9259.0 + 300 },
                    --正上
                    { x = 20049.0 + 300, y = 9827.0 + 300 },
                    --右上
                    { x = 19254.0, y = 9933.0 + 300 },
                    --正右
                    { x = 19254.0 - 50, y = 9933.0 + 50 },
                    { x = 19254.0 - 10, y = 9933.0 + 10 },
                    { x = 19237.0 - 10, y = 9848.0 + 10 },
                    { x = 19162.0 - 10, y = 9763.0 + 10 },
                    { x = 19115.0 - 10, y = 9722.0 + 10 },
                    { x = 19066.0 - 10, y = 9671.0 + 10 },
                    { x = 19017.0 - 10, y = 9631.0 + 10 },
                    { x = 18947.0 - 50, y = 9634.0 + 50 },
                    --右下
                    { x = 18947.0 - 300, y = 9634.0 },
                    --正下
                    { x = 18947.0 - 300, y = 9634.0 - 300 },
                    { x = 19079.0 - 300, y = 8803.0 - 300 },
                    { x = 19634.0 - 300, y = 6302.0 - 300 },
                    { x = 20043.0 - 300, y = 6030.0 - 300 },
                    --正左
                    { x = 20043.0 + 300, y = 6030.0 - 300 },
                    { x = 20435.0 + 300, y = 6316.0 - 300 },
                    { x = 21159.0 + 300, y = 7396.0 - 300 },
                    { x = 22700.0 + 300, y = 7875.0 - 300 },
                    { x = 22998.0 + 50, y = 7895.0 - 50 }, --false
                    --左上
                    { x = 22998.0 + 100, y = 7895.0 + 50 }, --false
                    { x = 22833.0 + 100, y = 8055.0 + 50 },
                    { x = 22754.0 + 100, y = 8246.0 + 50 },
                    { x = 22583.0 + 100, y = 8377.0 + 50 },
                    { x = 22423.0 + 100, y = 8653.0 + 50 },
                    --正左
                    { x = 22776.0 + 10, y = 9926.0 - 10 },
                    { x = 23330.0 + 10, y = 11208.0 - 10 },
                    { x = 23826.0 + 10, y = 12004.0 - 10 },
                    { x = 25181.0 + 10, y = 11863.0 - 10 },
                    { x = 25479.0 + 10, y = 12002.0 - 10 },
                    { x = 25590.0 + 10, y = 12107.0 - 10 },
                    { x = 25726.0 + 10, y = 12402.0 - 10 },
                    --左上
                    { x = 25794.0 + 300, y = 13046.0 },
                    { x = 25739.0 + 300, y = 13800.0 },
                    { x = 26750.0 + 300, y = 16315.0 },
                    { x = 26468.0 + 300, y = 17093.35546875 },

                },
            },

            {
                name = '破败的泽纳尔-内中间',
                area = {
                    --正上
                    { x = 27236.0 + 100, y = 29512.0 + 100 },
                    --    { x = 16762.0+100, y = 13142.0+100 },--false
                    { x = 27371.0 + 100, y = 29656.0 + 100 }, --false
                    { x = 27234.0 + 100, y = 30036.0 + 100 },
                    --右上
                    { x = 27234.0, y = 30036.0 + 50 },
                    { x = 26822.0, y = 30001.0 + 50 },
                    --正上
                    { x = 26626.0 + 50, y = 30069.0 + 50 },
                    { x = 26385.0 + 100, y = 30273.0 + 100 },
                    { x = 26093.0 + 100, y = 30568.0 + 100 },
                    --右上
                    { x = 26093.0, y = 30568.0 + 100 },
                    --正右
                    { x = 25946.0 - 10, y = 30547.0 + 10 },
                    { x = 25859.0 - 10, y = 30486.0 + 10 },
                    { x = 25807.0 - 10, y = 30404.0 + 10 },
                    --右上
                    { x = 25698.0, y = 30394.0 + 10 },
                    { x = 25640.0, y = 30382.0 + 10 },
                    { x = 25563.0, y = 30402.0 + 10 },
                    { x = 25502.0, y = 30402.0 + 10 },
                    --正上
                    { x = 25403.0 + 10, y = 30405.0 + 10 },
                    { x = 25310.0 + 10, y = 30504.0 + 10 },
                    --右上
                    { x = 25172.05078125, y = 30486.0 + 300 },
                    --正右
                    { x = 25115.0 - 100, y = 30390.0 + 100 },
                    { x = 24820.0 - 100, y = 30230.0 + 100 },
                    { x = 24703.0 - 100, y = 30050.0 + 100 },
                    --右下
                    { x = 24703.0 - 100, y = 30050.951171875 },
                    --正下
                    { x = 25177.0 - 300, y = 29345.0 - 300 },
                    --左下
                    { x = 25848.0, y = 28905.0 - 100 },
                    { x = 26418.0, y = 29340.0 - 100 },
                    { x = 26787.0, y = 29426.0 - 100 },
                    { x = 27045.0, y = 29406.0 - 100 },
                    { x = 27236.0, y = 29512.0 - 100 },
                    --正左
                    { x = 27236.0 + 100, y = 29512.0 - 100 },
                    --左上
                    { x = 27236.0 + 100, y = 29512.0 },
                }
            },
            {
                name = '破败的泽纳尔-外圈',
                area = {

                    --正上
                    { x = 27207.0 + 300, y = 30299.0 + 300 },
                    { x = 27233.0 + 300, y = 30322.0 + 300 },
                    { x = 26760.0 + 300, y = 31104.0 + 300 },
                    { x = 25844.0 + 300, y = 31347.0 + 300 },
                    --右上
                    { x = 25505.0, y = 31528.0 + 300 },
                    { x = 25212.0, y = 31430.0 + 300 },
                    --正右
                    { x = 24834.0 - 300, y = 31362.0 + 300 },
                    { x = 24414.0 - 300, y = 31025.0 + 300 },
                    { x = 24098.0 - 300, y = 30602.0 + 300 },
                    { x = 23774.0 - 300, y = 30097.0 + 300 },
                    --右下
                    { x = 23767.0 - 300, y = 29732.0 },
                    --正下
                    { x = 24155.0 - 300, y = 28552.0 - 300 },
                    { x = 24638.0 - 300, y = 28026.0 - 300 },
                    { x = 25190.0 - 300, y = 27902.0 - 300 },
                    --左下
                    { x = 25921.0, y = 27900.0 - 300 },
                    --正左
                    { x = 26891.0 + 300, y = 28391.0 - 300 },
                    { x = 27292.0 + 300, y = 29295.0 - 300 },

                    --正上
                    { x = 27250.0 + 100, y = 29328.0 + 100 },
                    --右上
                    { x = 27245.0, y = 29326.0 + 50 },
                    { x = 27063.0, y = 29316.0 + 50 },
                    { x = 26878.0, y = 29309.0 + 50 },
                    --正右
                    { x = 26748.0 - 100, y = 29085.0 + 100 },
                    { x = 26278.0 - 100, y = 28793.0 + 100 },
                    { x = 26100.0 - 100, y = 28533.0 },
                    --右上
                    { x = 25510.0, y = 28619.0 + 100 },
                    --正上
                    { x = 24376.0 + 100, y = 29541.0 + 100 },
                    --正左
                    { x = 24515.0 + 100, y = 30187.0 - 100 },
                    { x = 24794.0 + 100, y = 30488.0 - 100 },
                    { x = 24959.0 + 100, y = 30652.0 - 100 },
                    { x = 25113.0 + 100, y = 30789.0 - 100 },
                    { x = 25243.0 + 10, y = 30895.0 - 10 },
                    --左下
                    { x = 25347.0, y = 30944.0 - 5 },
                    { x = 25452.0, y = 30947.0 - 5 },
                    { x = 25549.0, y = 30950.0 - 5 },
                    { x = 25669.0, y = 30961.0 - 5 },
                    { x = 25840.0, y = 30958.0 - 5 },
                    --正下
                    { x = 25989.0 - 10, y = 30798.0 - 10 },
                    { x = 25989.0 - 100, y = 30798.0 - 100 },
                    { x = 26219.0 - 100, y = 30674.0 - 100 },
                    { x = 26466.0 - 100, y = 30427.0 - 100 },
                    { x = 26613.0 - 100, y = 30280.0 - 100 },
                    { x = 26782.0 - 100, y = 30141.0 - 100 },
                    --左上
                    { x = 26782.0 + 10, y = 30141.0 },
                    { x = 26875.0 + 10, y = 30145.0 },
                    { x = 26995.0 + 10, y = 30236.0 },
                    { x = 27207.0 + 10, y = 30299.0 },


                }
            },
            {
                name = '破败的泽纳尔-下边',
                area = {
                    --正上
                    { x = 26038.0 + 300, y = 11853.0 + 300 },
                    --正右
                    { x = 26038.0 - 20, y = 11853.0 + 20 },
                    { x = 26024.0 - 20, y = 11727.0 + 20 },
                    { x = 25940.0 - 20, y = 11658.0 + 20 },
                    { x = 25843.0 - 20, y = 11563.0 + 20 },
                    { x = 25751.0 - 20, y = 11500.0 + 20 },
                    { x = 25682.0 - 20, y = 10830.0 + 20 },
                    { x = 24686.0 - 20, y = 9425.0 + 20 },
                    { x = 23105.0 - 20, y = 8903.0 + 20 },
                    { x = 22885.0 - 20, y = 8477.0 + 20 },
                    --右下
                    { x = 22886.0 - 20, y = 8458.0 },
                    { x = 22891.0 - 20, y = 8337.0 },
                    { x = 22957.0 - 20, y = 8120.0 },
                    { x = 23087.0 - 20, y = 7963.0 },
                    --正右
                    { x = 23174.0 - 50, y = 7667.0 + 50 },
                    { x = 23082.0 - 50, y = 7500.0 + 50 },
                    { x = 22544.0 - 300, y = 6903.0 + 300 },
                    { x = 22346.0 - 300, y = 6578.0 + 300 },
                    { x = 20462.0 - 300, y = 4801.0 + 300 },
                    { x = 18745.0 - 300, y = 3747.0 + 300 },
                    --左上
                    { x = 14942.0 + 300, y = 12177.0 },
                    --正上
                    { x = 14942.0 + 300, y = 12177.0 + 300 },
                    { x = 14192.0 + 300, y = 12236.0 + 300 },
                    --右上
                    { x = 14192.0, y = 12236.0 + 300 },
                    --正上
                    { x = 12160.0 + 300, y = 15221.0 + 300 },
                    { x = 5951.0 + 300, y = 17197.0 + 300 },
                    --左上
                    { x = 6213.0 + 300, y = 23635.599609375 },
                    --正上
                    { x = 6213.0 + 300, y = 23635.0 + 300 },
                    { x = 5378.0 + 300, y = 25003.0 + 300 },
                    { x = 3847.0 + 300, y = 25490.0 + 300 },
                    { x = 2851.0 + 300, y = 25798.0 + 300 },
                    --右上
                    { x = 2851.0, y = 25798.0 + 300 },
                    --正右
                    { x = 2851.0 - 300, y = 25798.0 + 300 },
                    { x = 2496.0 - 300, y = 25207.0 + 300 },
                    --正下
                    { x = 2496.0 - 300, y = 25207.0 - 300 },
                    { x = 2496.0 - 300, y = 25207.0 - 300 },
                    { x = 1688.0 - 300, y = 15409.0 - 300 },
                    { x = 6918.0 - 300, y = 6149.0 - 300 },
                    { x = 8789.0 - 300, y = 3114.0 - 300 },
                    { x = 10095.0 - 300, y = 2016.0 - 300 },
                    --左下
                    { x = 10095.354492188, y = 2016.0 - 300 },
                    --正左
                    { x = 10906.0 + 300, y = 1988.0 - 300 },
                    { x = 25040.0 + 300, y = 1889.0 - 300 },
                    { x = 25105.0 + 300, y = 2286.0 - 300 },
                    { x = 25049.0 + 300, y = 4620.0 - 300 },
                    { x = 26805.0 + 300, y = 11037.0 - 300 },
                    --正上
                    { x = 26805.0 + 300, y = 11037.0 + 300 },
                }
            },
            {
                name = '破败的泽纳尔-内电梯',
                area = {
                    { x = 25866.5234375, y = 30835.876953125 },
                    { x = 25730.96875, y = 30906.021484375 },
                    { x = 25469.70703125, y = 30924.548828125 },
                    { x = 25366.47265625, y = 30842.513671875 },
                    { x = 25340.765625, y = 30573.076171875 },
                    { x = 25447.6171875, y = 30463.091796875 },
                    { x = 25741.7578125, y = 30449.099609375 },
                    { x = 25862.45703125, y = 30564.1484375 },

                }
            },
            {
                name = '破败的泽纳尔-电梯一',
                area = {
                    { x = 26016.76171875, y = 11942.887695312 },
                    { x = 25806.037109375, y = 12134.986328125 },
                    { x = 25646.66015625, y = 12136.424804688 },
                    { x = 25450.361328125, y = 11919.318359375 },
                    { x = 25458.84765625, y = 11760.926757812 },
                    { x = 25634.91796875, y = 11577.083984375 },
                    { x = 25796.4140625, y = 11572.7890625 },
                    { x = 26013.4140625, y = 11782.088867188 },
                }
            },
            {
                name = '破败的泽纳尔-电梯二',
                area = {
                    { x = 19037.0078125, y = 10219.306640625 },
                    { x = 18885.6875, y = 10199.451171875 },
                    { x = 18677.779296875, y = 9995.0224609375 },
                    { x = 18667.80078125, y = 9862.751953125 },
                    { x = 18856.544921875, y = 9657.9853515625 },
                    { x = 19013.3203125, y = 9655.8828125 },
                    { x = 19197.5859375, y = 9855.736328125 },
                    { x = 19230.376953125, y = 9980.35546875 },
                }
            },
        },

        ['埃尔乔文之荫'] = {
            {
                name = '埃尔乔文之荫-阴影大地',
                area = {
                    --正上
                    { x = 5921.0 + 300, y = 3355.0 + 300 },
                    { x = 4673.0 + 300, y = 16363.0 + 300 },
                    { x = 3527.0 + 300, y = 17171.0 + 300 },
                    --右上
                    { x = 3112.0, y = 17268.0 + 100 },
                    { x = 2950.0, y = 17272.0 + 100 },
                    { x = 2541.0, y = 17340.0 + 100 },
                    { x = 2253.0, y = 17304.0 + 100 },
                    { x = 1721.0, y = 17927.0 + 100 },
                    { x = 1678.0, y = 18068.0 + 100 }, --false
                    { x = 1464.0, y = 17998.0 + 100 },
                    --正右
                    { x = 1464.0 - 100, y = 17998.0 + 100 },
                    --右下
                    { x = 1464.0 - 50, y = 17998.0 },
                    { x = 1206.0 - 50, y = 17871.0 },
                    { x = 1206.0 - 50, y = 17793.0 },
                    { x = 1206.0 - 50, y = 17725.0 },
                    { x = 1239.0 - 50, y = 17669.0 },
                    { x = 1260.0 - 50, y = 17660.0 },
                    { x = 1288.0 - 50, y = 17584.0 },
                    { x = 1312.0 - 50, y = 17479.0 },
                    { x = 1360.0 - 50, y = 17384.0 },
                    --正下
                    { x = 1360.0 - 5000, y = 17384.0 - 5000 },
                    { x = 1575.0 - 5000, y = 1230.0 - 5000 },
                    --左下
                    { x = 1575.0, y = 1230.0 - 5000 },
                    --正左
                    { x = 4710.0 + 2000, y = 1343.0 - 2000 },
                    --左上
                    { x = 6208.0 + 500, y = 2667.0 },


                },
            },
            {
                name = '埃尔乔文之荫-连接一',
                area = {
                    --正左
                    { x = 1146.0 + 50, y = 17710.0 },
                    --左上
                    { x = 1146.0 + 50, y = 17710.0 },
                    { x = 1146.0 + 50, y = 17832.0 },
                    { x = 1067.0 + 50, y = 17934.0 },
                    { x = 1009.0 + 50, y = 18011.0 },
                    --正左
                    { x = 1113.0 + 50, y = 18257.0 - 50 },
                    { x = 1287.0 + 50, y = 18413.0 - 50 },
                    { x = 1439.0 + 300, y = 18506.0 - 300 },
                    { x = 1632.0 + 300, y = 18603.0 - 300 },
                    { x = 1970.0 + 300, y = 18694.0 - 300 },
                    { x = 3243.0 + 300, y = 18653.0 - 300 },
                    --左下
                    { x = 4818.0, y = 17962.0 - 300 },
                    --正左
                    { x = 5511.0 + 300, y = 17974.0 - 300 },
                    --正上
                    { x = 5509.0 + 300, y = 17973.0 + 300 },
                    { x = 5722.0 + 300, y = 20019.0 + 300 },
                    { x = 5360.0 + 300, y = 20245.0 + 50 },
                    --右上
                    { x = 5311.0, y = 20234.0 + 50 },
                    { x = 5306.0, y = 20216.0 + 50 },
                    { x = 5293.0, y = 20171.0 + 50 },
                    { x = 5273.0, y = 20133.0 + 50 },
                    { x = 5257.0, y = 20091.0 + 50 },
                    { x = 5254.0, y = 20025.0 + 50 },
                    { x = 5216.0, y = 19794.0 + 50 },
                    { x = 5190.0, y = 19614.0 + 50 },
                    --正上
                    { x = 4055.0 + 300, y = 20117.0 + 50 },
                    --正右
                    { x = 4055.0 - 300, y = 20117.0 + 300 },
                    { x = 3089.0 - 300, y = 20335.0 + 300 },
                    { x = 2310.0 - 300, y = 20012.0 + 300 },
                    --右上
                    { x = 1677.0, y = 19589.0 + 300 },
                    { x = 1640.0, y = 19607.0 + 300 },
                    { x = 1606.0, y = 19650.0 + 300 },
                    { x = 1551.0, y = 19666.0 + 300 },
                    { x = 1517.0, y = 19697.0 + 300 },
                    { x = 1467.0, y = 19704.0 + 300 },
                    --正右
                    { x = 1467.0 - 300, y = 19704.0 + 300 },
                    { x = 714.0 - 300, y = 18014.0 + 300 },
                    --正下
                    { x = 714.0 - 300, y = 18014.0 - 300 },
                    { x = 957.0 - 300, y = 17637.0 - 300 },
                    --左下
                    { x = 957.0, y = 17637.0 - 300 },
                },
            },
            {
                name = '埃尔乔文之荫-遗忘海',
                area = {
                    { x = 21199.046875, y = 12237.025390625 }, --false
                    { x = 21218.9765625, y = 12318.755859375 }, --false
                    { x = 21238.810546875, y = 12401.79296875 }, --false
                    { x = 21257.93359375, y = 12483.08984375 }, --false
                    { x = 21268.55078125, y = 12565.245117188 }, --false
                    { x = 21256.10546875, y = 12644.666992188 }, --false
                    { x = 21243.05859375, y = 12723.678710938 }, --false
                    { x = 21229.314453125, y = 12802.8359375 }, --false
                    { x = 21214.451171875, y = 12884.25 }, --false
                    { x = 21191.205078125, y = 12960.704101562 }, --false
                    { x = 21153.08203125, y = 13032.55859375 }, --false
                    { x = 21114.595703125, y = 13104.04296875 }, --false
                    { x = 21075.65625, y = 13175.473632812 }, --false
                    { x = 21036.376953125, y = 13246.610351562 }, --false
                    { x = 20981.044921875, y = 13304.391601562 }, --false
                    { x = 20915.998046875, y = 13353.5234375 }, --false
                    { x = 20850.345703125, y = 13402.314453125 }, --false
                    { x = 20784.087890625, y = 13450.716796875 }, --false
                    { x = 20717.51171875, y = 13498.517578125 }, --false
                    { x = 20649.654296875, y = 13542.12109375 }, --false
                    { x = 20579.109375, y = 13573.83984375 }, --false
                    { x = 20508.439453125, y = 13605.471679688 }, --false
                    { x = 20435.619140625, y = 13637.869140625 }, --false
                    { x = 20364.765625, y = 13669.26171875 }, --false
                    { x = 20294.16015625, y = 13700.260742188 }, --false
                    { x = 20226.18359375, y = 13729.017578125 }, --false
                    { x = 20158.546875, y = 13757.6328125 }, --false
                    { x = 20090.9140625, y = 13786.244140625 }, --false
                    { x = 20023.609375, y = 13814.717773438 }, --false
                    { x = 19956.1328125, y = 13843.264648438 }, --false
                    { x = 19886.822265625, y = 13869.657226562 }, --false
                    { x = 19809.04296875, y = 13881.497070312 }, --false
                    { x = 19732.142578125, y = 13892.84765625 }, --false
                    { x = 19655.607421875, y = 13903.78125 }, --false
                    { x = 19578.669921875, y = 13914.426757812 }, --false
                    { x = 19498.59375, y = 13906.657226562 }, --false
                    { x = 19416.1953125, y = 13894.099609375 }, --false
                    { x = 19338.505859375, y = 13881.801757812 }, --false
                    { x = 19255.96875, y = 13868.141601562 }, --false
                    { x = 19186.08984375, y = 13826.630859375 }, --false
                    { x = 19120.23046875, y = 13777.41015625 }, --false
                    { x = 19055.03125, y = 13727.228515625 }, --false
                    { x = 18990.123046875, y = 13675.813476562 }, --false
                    { x = 18928.693359375, y = 13621.837890625 }, --false
                    { x = 18909.0 - 10, y = 13602.0 + 10 }, --false
                    { x = 18869.0 - 10, y = 13536.0 + 10 }, --false
                    { x = 18829.0 - 10, y = 13470.0 + 10 }, --false
                    { x = 18790.0 - 10, y = 13404.0 + 10 }, --false
                    { x = 18751.0 - 10, y = 13337.0 + 10 }, --false
                    { x = 18712.0 - 10, y = 13271.0 + 10 }, --false

                    { x = 18675.5078125, y = 13207.407226562 }, --false
                    { x = 18670.0546875, y = 13182.705078125 }, --false
                    { x = 18652.044921875, y = 13099.7421875 }, --false
                    { x = 18634.40234375, y = 13016.569335938 }, --false
                    { x = 18617.150390625, y = 12933.161132812 }, --false
                    { x = 18600.3046875, y = 12849.584960938 }, --false
                    { x = 18601.15625, y = 12743.278320312 }, --false
                    { x = 18615.6640625, y = 12654.576171875 }, --false
                    { x = 18631.41796875, y = 12563.407226562 }, --false
                    { x = 18647.5234375, y = 12474.540039062 }, --false
                    { x = 18671.34375, y = 12391.655273438 }, --false
                    { x = 18706.48046875, y = 12326.046875 }, --false
                    { x = 18738.990234375, y = 12266.1640625 }, --false
                    { x = 18771.857421875, y = 12206.248046875 }, --false
                    { x = 18805.103515625, y = 12146.319335938 }, --false
                    { x = 18838.4375, y = 12086.870117188 }, --false
                    { x = 18897.90625, y = 12036.0703125 }, --false
                    { x = 18963.421875, y = 11987.447265625 }, --false
                    { x = 19029.45703125, y = 11939.263671875 }, --false
                    { x = 19096.130859375, y = 11891.446289062 }, --false
                    { x = 19163.0, y = 11844.313476562 }, --false
                    { x = 19231.767578125, y = 11803.9921875 }, --false
                    { x = 19302.638671875, y = 11771.859375 }, --false
                    { x = 19373.37890625, y = 11739.9375 }, --false
                    { x = 19444.115234375, y = 11708.147460938 }, --false
                    { x = 19514.939453125, y = 11676.474609375 }, --false
                    { x = 19585.5234375, y = 11645.700195312 }, --false
                    { x = 19655.6640625, y = 11616.609375 }, --false
                    { x = 19723.5859375, y = 11588.439453125 }, --false
                    { x = 19791.44921875, y = 11560.286132812 }, --false
                    { x = 19859.248046875, y = 11532.174804688 }, --false
                    { x = 19927.201171875, y = 11503.999023438 }, --false
                    { x = 19999.734375, y = 11481.971679688 }, --false
                    { x = 20076.7734375, y = 11470.955078125 }, --false
                    { x = 20153.54296875, y = 11460.334960938 }, --false
                    { x = 20230.623046875, y = 11450.057617188 }, --false
                    { x = 20307.83984375, y = 11441.98046875 }, --false
                    { x = 20387.50390625, y = 11453.86328125 }, --false
                    { x = 20467.255859375, y = 11466.247070312 }, --false
                    { x = 20546.755859375, y = 11479.110351562 }, --false
                    { x = 20626.310546875, y = 11493.747070312 }, --false
                    { x = 20694.47265625, y = 11543.690429688 }, --false
                    { x = 20762.4140625, y = 11594.91796875 }, --false
                    { x = 20829.740234375, y = 11647.233398438 }, --false



                    { x = 20925.0 + 10, y = 11724.0 - 10 }, --false
                    { x = 20966.0 + 10, y = 11792.0 - 10 }, --false
                    { x = 21006.0 + 10, y = 11862.0 - 10 }, --false
                    { x = 21045.0 + 10, y = 11932.0 - 10 }, --false
                    { x = 21083.0 + 10, y = 12002.0 - 10 }, --false
                    { x = 21122.0 + 10, y = 12073.0 - 10 }, --false
                    { x = 21160.0 + 10, y = 12144.0 - 10 }, --false
                    { x = 21161.0 + 10, y = 12145.0 - 10 }, --false
                }
            },
            {
                name = '埃尔乔文之荫-连接二',
                area = {
                    --正上
                    { x = 5012.0 + 100, y = 21458.0 + 100 },
                    --右上
                    { x = 4833.0, y = 21557.0 + 50 },
                    { x = 4495.0, y = 21717.0 + 50 },
                    --正上
                    { x = 3484.0 + 300, y = 22274.0 + 300 },
                    { x = 2212.0 + 300, y = 22619.0 + 300 },
                    { x = 1722.0 + 300, y = 22710.0 + 300 },
                    --正右
                    { x = 1542.0 - 100, y = 22694.0 + 100 },
                    --右下
                    { x = 1542.0 - 50, y = 22694.0 },
                    { x = 1554.0 - 50, y = 22620.0 },
                    { x = 1559.0 - 50, y = 22577.0 },
                    { x = 1554.0 - 50, y = 22515.0 },
                    { x = 1541.0 - 50, y = 22460.0 },
                    { x = 1534.0 - 50, y = 22405.0 },
                    { x = 1600.0 - 50, y = 22268.0 },
                    { x = 1612.0 - 50, y = 22146.0 },
                    --正下
                    { x = 1612.0 - 300, y = 22146.0 - 300 },
                    { x = 2175.0 - 300, y = 20885.0 - 300 },
                    --左下
                    { x = 2175.0, y = 20885.0 - 300 },
                    { x = 2549.0, y = 21064.0 - 300 },
                    { x = 5106.0, y = 20215.0 - 50 },
                    --正左
                    { x = 5205.0 + 50, y = 20184.0 - 50 },
                    --左上
                    { x = 5231.0 - 10, y = 20102.0 }, --true
                    { x = 5210.0 + 40, y = 20190.0 }, --true
                    { x = 5205.0 + 50, y = 20184.0 },
                    { x = 5231.0 + 50, y = 20240.0 },
                    { x = 5264.0 + 50, y = 20312.0 },
                    { x = 5269.0 + 50, y = 20317.0 },
                    { x = 5243.0 + 50, y = 20681.0 },
                    { x = 5222.0 + 50, y = 21060.0 },

                },
            },
            {
                name = '埃尔乔文之荫-森林东',
                area = {
                    --正下
                    { x = 1243.0 - 300, y = 22377.0 - 300 },
                    --正左
                    { x = 1243.0 + 50, y = 22377.0 - 50 },
                    --左上
                    { x = 1423.0 + 50, y = 22449.0 },
                    { x = 1456.0 + 50, y = 22531.0 },
                    { x = 1460.0 + 50, y = 22612.0 },
                    { x = 1463.0 + 50, y = 22661.0 },
                    --正左
                    { x = 1338.0 + 50, y = 23042.0 - 50 },
                    { x = 2339.0 + 300, y = 23579.0 - 300 },
                    { x = 4537.0 + 300, y = 22977.0 - 300 },
                    --右下
                    { x = 12946.0 - 300, y = 17110.125 },
                    --正上
                    { x = 10828.0 + 300, y = 15013.0 + 300 },
                    { x = 9906.0 + 300, y = 15020.0 + 300 },
                    --右上
                    { x = 9804.0, y = 15228.0 + 50 },
                    { x = 9759.0, y = 15219.0 + 50 },
                    { x = 9698.0, y = 15207.0 + 50 },
                    { x = 9634.0, y = 15145.0 + 50 },
                    { x = 9569.0, y = 15034.0 + 50 },
                    --正右
                    { x = 9569.0 - 300, y = 15034.0 + 300 },
                    --右下
                    { x = 9563.0 - 300, y = 14918.651367188 },
                    --正下
                    { x = 9850.0 - 300, y = 14170.0 - 300 },
                    { x = 11314.0 - 300, y = 13348.0 - 300 },
                    { x = 13910.0 - 10, y = 12126.0 - 10 },
                    --左下
                    { x = 13910.0, y = 12126.0 - 10 },
                    { x = 13994.0, y = 12118.0 - 10 }, --true
                    --正左
                    { x = 18643.0 + 10, y = 13162.0 - 10 },
                    --左上
                    { x = 18643.0 + 10, y = 13162.0 },
                    { x = 18673.0 + 10, y = 13253.0 }, --false
                    { x = 17698.0 + 300, y = 17598.0 },
                    { x = 17712.0 + 300, y = 18530.0 },
                    --正上
                    { x = 17387.0 + 300, y = 19472.0 + 300 },
                    { x = 16828.0 + 300, y = 25153.0 + 300 },
                    --右上
                    { x = 16828.0, y = 25153.0 + 300 },
                    { x = 15711.0, y = 25596.0 + 300 },
                    { x = 13945.0, y = 25910.0 + 300 },
                    { x = 10351.0, y = 26528.0 + 300 },
                    { x = 9278.0, y = 26372.0 + 300 },
                    { x = 3363.0, y = 25202.0 + 300 },
                    --正右
                    { x = 3363.0 - 300, y = 25202.0 + 300 },
                    { x = 852.0 - 300, y = 23139.0 + 300 },
                    --正下
                    { x = 852.0 - 300, y = 23139.0 - 300 },


                },
            },

            {
                name = '埃尔乔文之荫-中间连接点',
                area = {
                    --正上
                    { x = 10027.0 + 300, y = 16007.0 + 300 },
                    { x = 8777.0 + 300, y = 17046.0 + 300 },
                    { x = 7430.0 + 300, y = 17451.0 + 300 },
                    { x = 6247.0 + 300, y = 17391.0 + 300 },
                    --正右
                    { x = 6247.0 - 300, y = 17391.0 + 300 },
                    { x = 7621.0 - 300, y = 12644.0 + 300 },
                    --正下
                    { x = 7609.0 - 300, y = 12444.0 - 300 },
                    --左下
                    { x = 7756.0, y = 12350.0 - 300 },
                    { x = 8038.0, y = 12113.0 - 300 },
                    { x = 8646.0, y = 11812.0 - 300 },
                    { x = 9002.0, y = 11650.0 - 300 },
                    { x = 9428.0, y = 11579.0 - 300 },
                    { x = 9553.0, y = 11549.0 - 300 },
                    { x = 9549.0, y = 11449.0 - 50 }, --
                    { x = 9716.0, y = 11392.0 - 50 }, --
                    { x = 9769.0, y = 11388.0 - 50 }, --
                    { x = 9836.0, y = 11382.0 - 300 },
                    { x = 10112.0, y = 11681.0 - 300 },
                    { x = 10427.0, y = 11739.0 - 300 },
                    --左上
                    { x = 10584.0 + 300, y = 12033.0 },
                    --正上
                    { x = 10584.0 + 300, y = 12033.0 + 300 },
                    { x = 10102.0 + 300, y = 12535.0 + 300 },
                    { x = 8906.0 + 300, y = 14337.0 + 300 },
                    --正下
                    { x = 9518.0 - 300, y = 15320.0 - 300 },
                    --左下
                    { x = 9518.0, y = 15320.0 - 50 },
                    { x = 9641.0, y = 15311.0 - 50 },
                    { x = 9692.0, y = 15318.0 - 50 },
                    { x = 9756.0, y = 15307.0 - 50 },
                    { x = 9832.0, y = 15311.0 - 50 },
                    { x = 9955.0, y = 15385.0 - 50 },
                    { x = 10106.0, y = 15437.0 - 50 },
                    --正左
                    { x = 10106.0 + 300, y = 15437.0 - 300 },
                    --左上
                    { x = 10106.0 + 300, y = 15437.00390625 },
                },
            },
            {
                name = '埃尔乔文之荫-左边',
                area = {
                    --左上
                    { x = 9834.0 + 300, y = 11102.0 },
                    --正上
                    { x = 9834.0 + 300, y = 11102.0 + 300 },
                    --右上
                    { x = 9834.0, y = 11102.0 + 50 },
                    { x = 9776.0, y = 11248.0 + 50 },
                    { x = 9749.0, y = 11282.0 + 50 },
                    { x = 9684.0, y = 11285.0 + 50 },
                    { x = 9612.0, y = 11276.0 + 50 },
                    --正右
                    { x = 9544.0 - 300, y = 11161.0 + 300 },
                    { x = 7768.0 - 300, y = 10738.0 + 300 },
                    { x = 7343.0 - 300, y = 10134.0 + 300 },
                    --正下
                    { x = 7523.0 - 300, y = 9963.0 - 300 },
                    { x = 8566.0 - 300, y = 5679.0 - 300 },
                    { x = 11155.0 - 300, y = 3165.0 - 300 },
                    --正左
                    { x = 11155.0 + 300, y = 3165.0 - 300 },
                    { x = 12992.0 + 300, y = 3952.0 - 300 },
                    { x = 14959.0 + 300, y = 4429.0 - 300 },
                    { x = 15743.0 + 300, y = 4842.0 - 300 },
                    { x = 16291.0 + 300, y = 5604.0 - 300 },
                    --左上
                    { x = 16504.0 + 300, y = 6007.0 },
                    --正上
                    { x = 16504.0 + 300, y = 6007.0 + 300 },
                    { x = 15822.0 + 300, y = 7540.0 + 300 },
                    { x = 13993.0 + 300, y = 9322.0 + 300 },
                    { x = 10071.0 + 300, y = 10646.0 + 300 },
                },
            },
            {
                name = '埃尔乔文之荫-副本连接一',
                area = {
                    --正上
                    { x = 23729.0 + 300, y = 10942.0 + 300 },
                    { x = 22720.0 + 300, y = 11818.0 + 300 },
                    { x = 21230.0 + 300, y = 12200.0 + 300 },
                    --正右
                    { x = 21230.0 - 10, y = 12200.0 + 10 },
                    { x = 21178.0 - 10, y = 12080.0 + 10 }, --true
                    --正下
                    { x = 21188.0 - 50, y = 12090.0 - 50 },
                    { x = 21711.0 - 300, y = 11423.0 - 300 },
                    { x = 22225.0 - 300, y = 10719.0 - 300 },
                    { x = 23729.0 - 300, y = 10942.0 - 300 },
                    --正左
                    { x = 23729.0 + 300, y = 10942.0 - 300 },
                },
            },
            {
                name = '埃尔乔文之荫-副本连接二',
                area = {
                    { x = 24335.0 + 100, y = 10593.0 + 100 },
                    { x = 24037.0 - 300, y = 10572.0 + 300 },
                    { x = 24118.0 - 300, y = 10382.0 - 300 },
                    { x = 24361.0 + 300, y = 10257.0 - 300 },
                },
            },
            {
                name = '埃尔乔文之荫-副本连接三',
                area = {
                    { x = 24654.0 + 100, y = 10993.0 + 100 }, --false
                    { x = 24382.0 - 100, y = 11025.0 + 100 }, --false
                    { x = 24485.0 - 100, y = 10781.0 - 100 }, --false
                    { x = 24714.0 + 100, y = 10677.0 - 100 }, --false

                },
            },
            {
                name = '埃尔乔文之荫-副本连接四',
                area = {
                    { x = 25298.0 + 100, y = 10469.0 + 100 },
                    { x = 24899.0 - 100, y = 10496.0 + 100 },
                    { x = 24853.0 - 100, y = 10368.0 }, --false
                    { x = 25002.0 - 100, y = 10342.0 - 100 },
                    { x = 25212.0 + 100, y = 10216.0 - 100 },
                },
            },
            {
                name = '埃尔乔文之荫-副本门口',
                area = {
                    { x = 27066.0 + 100, y = 10597.0 + 100 },
                    { x = 26474.0 + 300, y = 10919.0 }, --false
                    { x = 26349.0 + 300, y = 10958.0 }, --false
                    { x = 26146.0 - 100, y = 10865.0 + 100 },
                    { x = 25823.0 - 100, y = 10461.0 }, --false
                    { x = 25946.0 - 100, y = 10342.0 }, --false
                    { x = 26279.0 - 100, y = 10073.0 - 100 },
                    { x = 26918.0, y = 9631.0 - 300 }, --false
                    { x = 27029.0 + 100, y = 9704.0 - 100 },

                },
            },
        },

        ['风弥之丘'] = {
            {
                name = '风弥之丘-大板块',
                area = {   --左下
                    { x = 12019.0, y = 16077.0 - 300 },
                    --正左
                    { x = 12297.0 + 300, y = 16098.0 - 300 },

                    --左上
                    { x = 12485.0 + 300, y = 16477.0 },
                    --左下
                    { x = 17771.0, y = 18092.0 - 300 },
                    { x = 19317.0, y = 17622.0 - 300 },
                    { x = 21777.0, y = 17454.0 - 300 },
                    --正左
                    { x = 21777.0 + 300, y = 17454.0 - 300 },
                    { x = 24526.0 + 300, y = 18232.0 - 300 },
                    --左上
                    { x = 24892.0 + 3000, y = 18762.0 },
                    --正上
                    { x = 24892.0 + 3000, y = 18762.0 + 3000 },
                    --左上
                    { x = 25076.0 + 3000, y = 23622.955078125 },
                    --正上
                    { x = 25076.0 + 3000, y = 23622.0 + 3000 },
                    { x = 23645.0 + 3000, y = 24586.0 + 3000 },
                    --右上
                    { x = 23645.0, y = 24586.0 + 3000 },
                    --正右
                    { x = 22571.0 - 3000, y = 24904.0 + 3000 },
                    { x = 21845.0 - 3000, y = 25007.0 + 3000 },
                    { x = 21456.0 - 3000, y = 25199.0 + 3000 },
                    { x = 18716.0 - 3000, y = 24320.0 + 3000 },
                    { x = 12023.0 - 3000, y = 25761.0 + 3000 },
                    { x = 8577.0 - 3000, y = 25134.0 + 3000 },
                    { x = 7802.0 - 3000, y = 24863.0 + 3000 },
                    { x = 4730.0 - 3000, y = 21301.0 + 3000 },
                    { x = 3333.0 - 3000, y = 20107.0 + 3000 },
                    { x = 1108.0 - 3000, y = 16441.0 + 3000 },
                    { x = 872.0 - 3000, y = 15708.0 + 3000 },
                    { x = 466.0 - 3000, y = 8137.0 + 3000 },
                    { x = 244.0 - 3000, y = 6639.0 + 3000 },
                    { x = 1185.0 - 3000, y = -1356.0 + 3000 },
                    --正下
                    { x = 1185.0 - 3000, y = -1356.0 - 3000 },
                    --正左
                    { x = 1185.0 + 3000, y = -1356.0 - 3000 },
                    { x = 1556.0 + 3000, y = -1404.0 - 3000 },
                    { x = 5597.0 + 3000, y = -2665.0 - 3000 },
                    { x = 10123.0 + 3000, y = -798.0 - 3000 },
                    { x = 11352.0 + 3000, y = 194.0 - 3000 },
                    --左上
                    { x = 11352.0 + 3000, y = 194.73631286621 },
                    --正上
                    { x = 11352.0 + 3000, y = 194.0 + 3000 },
                    --左上
                    { x = 11018.0 + 3000, y = 4677.6606445312 },
                    { x = 11262.0 + 3000, y = 8637.884765625 },
                    { x = 11290.0 + 3000, y = 10082.287109375 },
                    --正上
                    { x = 11290.0 + 500, y = 10082.0 + 500 },
                    { x = 10010.0 + 500, y = 10489.0 + 500 },
                    { x = 9297.0 + 500, y = 10908.0 + 500 },
                    { x = 8560.0 + 500, y = 10854.0 + 500 },
                    --正左
                    { x = 9333.0 + 300, y = 12298.0 - 300 },
                    { x = 9508.0 + 300, y = 12467.0 - 300 },
                    { x = 9562.0 + 300, y = 12683.0 - 300 },
                    --左上
                    { x = 9396.0 + 300, y = 12962.0 },
                    --正上
                    { x = 9396.0 + 500, y = 12962.0 + 500 }, },
            },
            {
                name = '风弥之丘-左一',
                area = {     --正左
                    { x = 15136.0 + 300, y = 14800.0 - 300 }, --false
                    --左上
                    { x = 15107.0 + 300, y = 15236.158203125 }, --false
                    --正上
                    { x = 15107.0 + 300, y = 15236.0 + 300 }, --false
                    --右上
                    { x = 15107.666992188, y = 15236.0 + 300 }, --false
                    { x = 15107.666992188, y = 15236.0 + 300 },
                    { x = 14736.684570312, y = 15219.0 + 300 },
                    { x = 14060.0390625, y = 15122.0 + 300 },
                    --正右
                    { x = 13619.0 - 300, y = 14924.0 + 300 },
                    --右上
                    { x = 11794.7578125, y = 14979.0 + 300 },
                    --正右
                    { x = 11794.0 - 300, y = 14979.0 + 300 },
                    { x = 9920.0 - 300, y = 12351.0 + 300 },

                    --右下
                    { x = 9802.0 - 300, y = 12063.442382812 },
                    --正下
                    { x = 9882.0 - 300, y = 11871.0 - 300 },
                    --左下
                    { x = 10089.0, y = 11694.0 - 300 },
                    --正左
                    { x = 11376.0 + 50, y = 12308.0 - 50 },
                    { x = 11562.0 + 50, y = 12323.0 - 50 },
                    { x = 11578.0 + 50, y = 12419.0 - 50 },
                    { x = 11597.0 + 50, y = 12514.0 - 50 },
                    { x = 11606.0 + 50, y = 12563.0 - 50 },
                    { x = 11622.0 + 50, y = 12642.0 - 50 },
                    { x = 11618.0 + 50, y = 12749.0 - 50 },
                    { x = 11674.0 + 50, y = 12835.0 - 50 },
                    { x = 11714.0 + 50, y = 12875.0 - 50 },
                    { x = 12127.0 + 50, y = 13221.0 - 50 },
                    { x = 12281.0 + 50, y = 13458.0 - 50 },
                    { x = 12536.0 + 50, y = 13570.0 - 50 },
                    { x = 12669.0 + 50, y = 13656.0 - 50 },
                    { x = 13021.0 + 50, y = 13689.0 - 50 },
                    --左下
                    { x = 13418.369140625, y = 13949.0 - 300 },
                    { x = 14054.0, y = 13695.0 - 300 },
                    --正左
                    { x = 14054.0 + 300, y = 13695.0 - 300 },
                    { x = 14353.0 + 300, y = 13731.0 - 300 },
                    { x = 14618.0 + 300, y = 13907.0 - 300 }, },
            },
            {
                name = '风弥之丘-左二',
                area = {   --正上
                    { x = 13258.0 + 300, y = 12660.0 + 300 },
                    --右上
                    { x = 13258.0, y = 12660.0 + 300 },
                    { x = 12847.0, y = 13030.0 + 300 },
                    { x = 12328.0, y = 12801.0 + 50 },
                    --正右
                    { x = 11999.0 - 50, y = 12698.0 + 50 },
                    { x = 11857.0 - 50, y = 12598.0 + 50 },
                    { x = 11781.0 - 50, y = 12552.0 + 50 },
                    { x = 11662.0 - 50, y = 12485.0 + 50 },
                    { x = 11636.0 - 50, y = 12375.0 + 50 },
                    { x = 11670.0 - 50, y = 12333.0 + 50 },
                    { x = 11748.0 - 50, y = 12171.0 + 50 },
                    --右下
                    { x = 11748.0 - 50, y = 12171.0 },
                    --正下
                    { x = 11919.0 - 50, y = 12065.0 - 50 },
                    --左下
                    { x = 11919.0, y = 12065.0 - 300 },
                    { x = 12838.0, y = 11750.0 - 300 },
                    --正左
                    { x = 12838.0 + 300, y = 11750.0 - 300 },
                    --左上
                    { x = 12838.0 + 300, y = 11750.0 + 300 },
                    { x = 13287.0 + 300, y = 12509.0 + 300 }, },
            },
            {
                name = '风弥之丘-左三',
                area = {
                    --正上
                    { x = 15130.0 + 300, y = 12733.0 + 300 },
                    { x = 14731.0 + 300, y = 12986.0 + 300 },
                    --右上
                    { x = 14731.0, y = 12986.0 + 300 },
                    --正右
                    { x = 14731.0 - 100, y = 12986.0 + 300 },
                    { x = 14152.0 - 100, y = 13014.0 + 300 },
                    { x = 13828.0 - 100, y = 12573.0 + 300 },
                    --右下
                    { x = 13828.0 - 100, y = 12573.0 },
                    --正下
                    { x = 13828.0 - 300, y = 12573.0 - 300 },
                    { x = 14451.0 - 300, y = 11761.0 - 300 },
                    --左下
                    { x = 14451.79296875, y = 11761.0 - 300 },
                    --正左
                    { x = 14451.0 + 300, y = 11761.0 - 300 },
                    { x = 15582.0 + 300, y = 12208.0 - 300 },
                    --左上
                    { x = 15582.0 + 300, y = 12208.0 },
                    --正上
                    { x = 15582.0 + 300, y = 12208.0 + 300 },
                },
            },
        },

        ['琉璃莲花池'] = {
            {
                name = '琉璃莲花池-大板块',
                area = {    --    --正上
                    --左下
                    { x = 22070.0, y = 21713.0 - 50 },
                    { x = 25349.0, y = 22958.0 - 50 },
                    { x = 25700.0, y = 22672.0 - 50 },
                    { x = 25899.0, y = 22506.0 - 50 },
                    { x = 26044.0, y = 22652.0 - 50 },
                    { x = 26149.0, y = 22880.0 - 50 },
                    --正左边
                    { x = 27979.0 + 300, y = 22404.0 - 300 },

                    --正上
                    { x = 27887.0 + 10000, y = 23844.0 + 10000 },
                    { x = 25039.0 + 10000, y = 27140.0 + 10000 },
                    { x = 24064.0 + 10000, y = 29182.0 + 10000 },

                    --正右
                    { x = 22731.0 - 10000, y = 29130.0 + 10000 },
                    { x = 19726.0 - 10000, y = 28156.0 + 10000 },
                    { x = 9744.0 - 10000, y = 29120.0 + 10000 },
                    { x = 6811.0 - 10000, y = 29242.0 + 10000 },
                    { x = 6206.0 - 10000, y = 27713.0 + 10000 },
                    { x = 5442.0 - 10000, y = 24475.0 + 10000 },
                    { x = 4179.0 - 10000, y = 23004.0 + 10000 },
                    { x = 2673.0 - 10000, y = 13477.0 + 10000 },
                    --正下
                    { x = 3120.0 - 10000, y = 2979.0 - 10000 },
                    { x = 4848.0 - 10000, y = 1704.0 - 10000 },
                    --正左
                    { x = 5284.0 + 10000, y = 1532.0 - 10000 },
                    { x = 17051.0 + 10000, y = 6926.0 - 10000 },
                    { x = 20163.0 + 10000, y = 13928.0 - 10000 },
                    --正上
                    { x = 20730.0 + 800, y = 17327.0 + 800 },
                },
            },

            {
                name = '银波湖-左一',
                area = {    --    -- 左上
                    { x = 27160.0 + 300, y = 20416.0 },
                    { x = 26822.0 + 300, y = 20988.0 },
                    { x = 26628.0 + 300, y = 21302.0 },
                    { x = 26528.0 + 300, y = 21627.0 },
                    { x = 26158.0 + 300, y = 22187.0 },
                    { x = 26017.0 + 300, y = 22463.0 },
                    --正上
                    { x = 26017.0 + 300, y = 22463.0 + 300 },
                    --右上
                    { x = 26017.0, y = 22463.0 + 50 },
                    { x = 25955.0, y = 22457.0 + 50 },
                    { x = 25892.0, y = 22451.0 + 50 },
                    { x = 25796.0, y = 22437.0 + 50 },
                    --正右
                    { x = 25796.0 - 300, y = 22437.0 + 300 },
                    --右下
                    { x = 25796.0 - 300, y = 22437.0 },
                    { x = 25785.0 - 300, y = 22232.0 },
                    { x = 25815.0 - 300, y = 22076.0 },
                    { x = 25915.0 - 300, y = 21862.0 },
                    { x = 26016.0 - 300, y = 21693.0 },
                    { x = 26011.0 - 300, y = 21399.0 },
                    { x = 26277.0 - 50, y = 21086.0 },
                    { x = 26423.0 - 50, y = 20877.0 },
                    { x = 26503.0 - 300, y = 20688.0 },
                    --正右
                    { x = 26422.0 - 300, y = 20290.0 + 300 },
                    { x = 26275.0 - 300, y = 19895.0 + 300 },
                    { x = 25753.0 - 300, y = 19726.0 + 300 },
                    { x = 25323.0 - 300, y = 19188.0 + 300 },
                    --右下
                    { x = 25323.0 - 50, y = 19188.0 },
                    { x = 25191.0 - 50, y = 19143.0 },
                    { x = 25192.0 - 50, y = 19080.0 },
                    { x = 25191.0 - 50, y = 19033.0 },
                    { x = 25383.0 - 50, y = 18873.0 },
                    --正下
                    { x = 25383.0 - 300, y = 18873.0 - 300 },
                    --左下
                    { x = 26143.0, y = 18678.0 - 300 },
                    --正左
                    { x = 26143.0 + 300, y = 18678.0 - 300 },
                    { x = 27160.0 + 300, y = 20416.0 - 300 }, },
                min_cz = 230,
            },
            {
                name = '银波湖-左二',
                area = {   --
                    --正上
                    { x = 26390.0 + 300, y = 21061.0 },
                    { x = 25309.0 + 300, y = 21641.0 },
                    --右上
                    { x = 25309.0, y = 21641.0 + 300 },
                    --正右
                    { x = 25309.0 - 300, y = 21641.0 + 300 },
                    { x = 25309.0 - 300, y = 21641.0 + 300 },
                    { x = 24534.0 - 300, y = 20183.0 + 300 },
                    { x = 24258.0 - 300, y = 19203.0 },
                    --右下
                    { x = 24258.0 - 300, y = 19203.0 },
                    --正下
                    { x = 24261.0 - 300, y = 18652.0 - 300 },
                    --左下
                    { x = 24943.0, y = 18638.0 - 300 },
                    --正左
                    { x = 24943.0 + 300, y = 18638.0 - 300 },
                    { x = 25010.0 + 300, y = 18762.0 - 300 },
                    --左上
                    { x = 25010.0 + 300, y = 18762.0 },
                    { x = 25098.0 + 300, y = 19099.0 },
                    --正左
                    { x = 24925.0 + 300, y = 19916.0 - 300 },
                    { x = 25340.0 + 300, y = 20601.0 - 300 },
                    { x = 25835.0 + 300, y = 20704.0 - 300 }, },
                min_cz = 0,
            },
        },

        ['银波湖'] = {
            {
                name = '银波湖-中间',
                area = {
                    -- 右下
                    { x = -573.0 - 300, y = 17871.0 },
                    -- 正下
                    { x = -595.0 - 300, y = 17388.0 - 300 },
                    -- 左下
                    { x = -595.0, y = 17388.0 - 300 },
                    { x = 5105.0, y = 12089.0 - 1500 }, ---大
                    { x = 11015.0, y = 9156.0 - 300 },
                    { x = 12884.0, y = 7749.0 - 300 },
                    --正左
                    { x = 12884.0 + 300, y = 7749.0 - 300 },
                    { x = 16117.0 + 300, y = 8468.0 - 300 },
                    { x = 16916.0 + 300, y = 8798.0 - 300 },
                    --正下
                    { x = 21235.0 - 300, y = 11268.0 - 300 },
                    --左下
                    { x = 21235.0, y = 11268.0 - 100 },
                    { x = 21378.0, y = 11313.0 - 300 },
                    { x = 21534.0, y = 11385.0 - 300 },
                    { x = 21745.0, y = 11454.0 - 300 },
                    --正左
                    { x = 21745.0 + 300, y = 11454.0 - 300 },
                    --正下
                    { x = 26478.0 - 300, y = 13209.0 - 300 },
                    { x = 26706.0 - 300, y = 12234.0 - 300 },
                    --左下
                    { x = 26706.0, y = 12234.0 - 300 },
                    { x = 28075.0, y = 10746.0 - 300 },
                    { x = 29472.0, y = 11413.0 - 300 },
                    --正左
                    { x = 30094.0 + 300, y = 11726.0 - 300 },
                    --左上
                    { x = 30510.0 + 300, y = 12168.0 },
                    { x = 34381.0 + 300, y = 17733.0 },
                    --正上
                    { x = 34381.0 + 300, y = 17733.0 + 300 },
                    { x = 33551.0 + 300, y = 20157.0 + 300 },
                    { x = 32275.0 + 300, y = 21030.0 + 300 },
                    --右上
                    { x = 32275.0, y = 21030.0 + 300 },
                    { x = 30703.0, y = 20945.0 + 300 },

                    { x = 30358.0, y = 21124.0 + 50 },
                    { x = 30264.0, y = 21187.0 + 50 },
                    { x = 30070.0, y = 21354.0 + 50 },
                    { x = 29960.0, y = 21384.0 + 50 },
                    { x = 29810.0, y = 21420.0 + 50 },
                    { x = 29578.0, y = 21440.0 + 50 },
                    { x = 29381.0, y = 21562.0 + 50 },
                    { x = 29233.0, y = 21707.0 + 50 },
                    { x = 29166.0, y = 21870.0 + 100 },
                    { x = 28904.0, y = 21815.0 + 300 }, --false
                    --正右
                    { x = 27595.0 - 300, y = 20407.0 + 300 },
                    --左上
                    { x = 24578.0 + 300, y = 24361.0 },
                    --右上
                    { x = 24579.0, y = 24362.0 + 300 },
                    { x = 23440.0, y = 24611.0 + 300 },
                    { x = 22311.0, y = 24584.0 + 300 },
                    --左上
                    { x = 21764.0 + 300, y = 25342.0 },

                    --右上
                    { x = 21763.0, y = 25338.0 + 300 },
                    { x = 21655.0, y = 25461.0 + 300 },
                    { x = 21577.0, y = 25501.0 + 300 },
                    { x = 21495.0, y = 25523.0 + 300 },
                    { x = 21389.0, y = 25517.0 + 300 },
                    { x = 21204.0, y = 25448.0 + 300 },
                    --正右
                    { x = 21082.0 - 300, y = 25253.0 + 300 },

                    --左上
                    { x = 19906.0 + 300, y = 25749.0 },
                    --正上
                    { x = 19692.0 + 300, y = 26096.0 + 300 },
                    --右上
                    { x = 19503.0, y = 26361.0 + 300 },
                    { x = 18686.0, y = 26366.0 + 300 },
                    { x = 17061.0, y = 27067.0 + 300 },
                    { x = 12516.0, y = 27217.0 + 300 },
                    { x = 4997.0, y = 22398.0 + 300 },
                    { x = 1860.0, y = 21056.0 + 300 },
                    --正右
                    { x = 1860.0 - 300, y = 21056.0 + 300 },
                    --右下
                    { x = 1860.0 - 300, y = 21056.0 },
                    --正下
                    { x = 1718.0 - 300, y = 20899.0 - 300 },
                    { x = 2701.0 - 300, y = 19910.0 - 300 },
                    --右上
                    { x = 1164.0, y = 18038.0 + 300 },
                    { x = 404.0, y = 18107.0 + 300 },
                    { x = -513.0, y = 18119.0 + 300 },
                    --正右
                    { x = -513.0 - 300, y = 18119.0 + 300 },
                },
                min_cz = 2900,
                overlap = {
                    ['银波湖-中间'] = 2900, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['银波湖-中间小'] = 0,
                },
            },
            {
                name = '银波湖-中间小',
                area = { { x = 21710.0 + 300, y = 17323.0 + 300 },
                         { x = 21085.0 - 300, y = 17344. + 300 },
                         { x = 21026.0 - 300, y = 16647.0 - 300 },
                         { x = 21682.0 + 300, y = 16585.0 - 300 }, },
                min_cz = 2690,
            },
            {
                name = '银波湖-右下',
                area = {    --
                    --正上
                    { x = 21966.0 + 300, y = 26379.0 + 300 },
                    { x = 21563.0 + 300, y = 26751.0 + 300 },
                    --右上
                    { x = 21563.0, y = 26751.0 + 300 },
                    { x = 21042.0, y = 26685.0 + 300 },
                    { x = 20753.0, y = 26688.0 + 300 },
                    --正右
                    { x = 20753.0 - 300, y = 26688.0 + 300 },
                    --右下
                    { x = 20753.0 - 300, y = 26688.0 },
                    --正下
                    { x = 21115.0 - 300, y = 26049.0 - 300 },
                    --左下
                    { x = 21425.0, y = 25833.0 - 300 },
                    { x = 21589.0, y = 25820.0 - 300 },
                    { x = 21720.0, y = 25815.0 - 300 },
                    --正左
                    { x = 21720.0 + 300, y = 25815.0 - 300 },
                    { x = 21908.0 + 300, y = 25988.0 - 300 },
                    { x = 22146.0 + 300, y = 26207.0 - 300 },
                    --左上
                    { x = 22146.0 + 300, y = 26207.0 },
                },
            },
            {
                name = '银波湖-右上',
                area = {    --    --正上
                    { x = 30537.0 + 300, y = 23336.0 + 300 },
                    { x = 30039.0 + 300, y = 23808.0 + 300 },
                    --右上
                    { x = 28831.0, y = 24372.0 + 300 },
                    --正右
                    { x = 28353.0 - 300, y = 24076.0 + 300 },
                    --右下
                    { x = 28553.0 - 300, y = 23652.0 },
                    --正下
                    { x = 28553.0 - 300, y = 23652.0 - 300 },
                    --正右
                    { x = 29408.0 - 300, y = 21795.0 + 300 },
                    --左下
                    { x = 29408.0, y = 21795.0 - 100 },
                    { x = 29555.0, y = 21753.0 - 100 },
                    { x = 29622.0, y = 21739.0 - 100 },
                    { x = 29723.0, y = 21574.0 - 100 },
                    { x = 29857.0, y = 21586.0 - 100 },
                    { x = 30082.0, y = 21471.0 - 100 },
                    { x = 30137.0, y = 21458.0 - 100 },
                    --正左
                    { x = 30137.0 + 300, y = 21458.0 - 300 },
                    { x = 30537.0 + 300, y = 23336.0 - 300 }, },
            },
            {
                name = '银波湖-左下',
                area = {
                    --正上
                    { x = 23495.0 + 300, y = 10248.0 + 300 },
                    --右上
                    { x = 23495.0, y = 10248.0 + 300 },
                    --左上
                    { x = 21619.0 + 300, y = 10924.0 },
                    --正上
                    { x = 21619.0 + 300, y = 10924.0 + 300 },
                    --右上
                    { x = 21619.0, y = 10924.0 + 300 },
                    { x = 21547.0, y = 10908.0 + 300 },
                    { x = 21460.0, y = 10888.0 + 300 },
                    { x = 21375.0, y = 11006.0 + 100 },
                    { x = 21218.0, y = 10984.0 + 100 },
                    --正右
                    { x = 21218.0 - 300, y = 10984.0 + 300 },
                    --右下
                    { x = 21218.0 - 300, y = 10984.0 },
                    { x = 20871.0 - 300, y = 10139.0 },
                    --正右
                    { x = 20154.0 - 300, y = 9800.0 + 300 },
                    --右下
                    { x = 20136.0 - 300, y = 9421.0 },
                    --正右
                    { x = 17300.0 - 300, y = 4418.0 + 300 },
                    { x = 17086.0 - 300, y = 4021.0 + 300 },
                    --右下
                    { x = 17086.0 - 300, y = 4021.0 },
                    { x = 17445.0 - 300, y = 3137.0 },
                    --正下
                    { x = 17385.0 - 300, y = 2804.0 - 300 },
                    { x = 19351.0 - 300, y = 434.0 - 300 },
                    { x = 20444.0 - 300, y = 51.0 - 300 },
                    --左下
                    { x = 20444.0, y = 51.0 - 300 },
                    --正左
                    { x = 20444.0 + 300, y = 51.0 - 300 },
                    --左上
                    { x = 20444.0 + 300, y = 51.0 },
                    { x = 20729.0 + 300, y = 922.0 },
                    { x = 20890.0 + 100, y = 1651.0 },
                    { x = 21100.0 + 100, y = 1840.0 },
                    { x = 21086.0 + 100, y = 1959.0 },
                    { x = 20993.0 + 300, y = 2127.0 },
                    { x = 20872.0 + 300, y = 2338.0 },
                    --正上
                    { x = 20872.0 + 300, y = 2338.0 + 300 },

                    --左上
                    { x = 21893.0 + 300, y = 5378.0 },
                    { x = 22555.0 + 300, y = 8096.0 },
                    { x = 23464.0 + 300, y = 10030.0 },
                },
            },
            {
                name = '银波湖-左下一',
                area = {    --    --正上
                    { x = 22067.0 + 300, y = 1867.0 + 300 },
                    { x = 21715.0 + 300, y = 2368.0 + 300 },
                    --右上
                    { x = 21423.751953125, y = 2205.0 + 300 },
                    --正右
                    { x = 21363.0 - 300, y = 2143.0 + 300 },
                    --右下
                    { x = 21363.0 - 100, y = 2104.0 },
                    { x = 21363.0 - 100, y = 1958.0 },
                    { x = 21470.0 - 100, y = 1847.0 },
                    { x = 21530.0 - 100, y = 1763.0 },
                    --正下
                    { x = 21530.0 - 300, y = 1763.0 - 300 },
                    { x = 21926.0 - 300, y = 1537.0 - 300 },
                    --左下
                    { x = 22314.0, y = 1517.0 - 100 },
                    --正左
                    { x = 22314.0 + 100, y = 1517.0 - 100 },
                    --左上
                    { x = 22314.0 + 100, y = 1517.0 }, }
            },
            {
                name = '银波湖-左下二',
                area = {    --    --正上
                    { x = 22815.0 + 300, y = 1321.0 + 300 },
                    --右上
                    { x = 22815.0, y = 1321.0 + 100 },
                    { x = 22319.0, y = 1229.0 + 100 },
                    { x = 22121.0, y = 1160.0 + 100 },
                    --正右
                    { x = 22121.0 - 100, y = 1160.0 + 100 },
                    --右下
                    { x = 22121.0 - 300, y = 1160.0 },
                    --正下
                    { x = 22254.0 - 300, y = 769.0 - 300 },
                    --左下
                    { x = 22391.0, y = 619.0 - 300 },
                    --正左
                    { x = 22703.0 + 300, y = 748.0 - 300 },
                    --左上
                    { x = 22815.0 + 300, y = 1321.0 }, }
            },
            {
                name = '银波湖-左下三',
                area = {    --    -- 正上
                    { x = 22877.0 + 300, y = -344.0 + 300 }, --false
                    --右上
                    { x = 22575.0, y = -334.0 + 300 }, --false
                    { x = 22336.0, y = -531.0 + 300 }, --false
                    --正右
                    { x = 22336.0 - 300, y = -531.0 + 300 }, --false
                    --正下
                    { x = 22336.0 - 50, y = -531.0 - 50 }, --false
                    { x = 22449.0 - 100, y = -786.0 - 100 }, --false
                    --正左
                    { x = 22449.0 + 50, y = -786.0 - 50 }, --false
                    --左上
                    { x = 22501.0 + 300, y = -734.0 },
                    { x = 22751.0 + 300, y = -658.0 },
                    { x = 22877.0 + 300, y = -344.0 }, --false

                }
            },
            {
                name = '银波湖-左下四',
                area = {      --正左
                    { x = 25342.0 + 300, y = -3863.0 - 300 },
                    --左上
                    { x = 25342.0 + 300, y = -3863.0 },
                    --正上
                    { x = 24712.0 + 300, y = -2088.0 + 300 },
                    { x = 24063.0 + 300, y = -951.0 + 300 },
                    --右上
                    { x = 24063.0, y = -951.0 + 100 },
                    { x = 23639.0, y = -838.0 + 100 },
                    { x = 22957.0, y = -960.0 + 100 },
                    { x = 22784.0, y = -774.0 + 100 },
                    { x = 22589.0, y = -807.0 + 100 },
                    { x = 22434.0, y = -949.0 + 100 },
                    { x = 22182.0, y = -1111.0 + 100 },

                    --正右
                    { x = 21528.0 - 300, y = -1719.0 + 300 },
                    { x = 20573.0 - 300, y = -1945.0 + 300 },
                    { x = 19705.0 - 300, y = -3094.0 + 300 },
                    { x = 19615.0 - 300, y = -3824.0 + 300 },
                    --右下
                    { x = 19615.0 - 300, y = -3824.0 },
                    --正下
                    { x = 19615.0 - 300, y = -3824.0 - 300 },
                    --左下
                    { x = 21391.0, y = -4757.0 - 300 },
                    --正左
                    { x = 21391.0 + 300, y = -4757.0 - 300 },
                    { x = 23968.0 + 300, y = -4800.0 - 300 },
                }
            },

        },

        ['黑砧工坊'] = {
            {
                name = '黑砧工坊-大板块',
                area = {
                    -- 正上
                    { x = 30420.0 + 300, y = 26975.0 + 300 },
                    --右上
                    { x = 30103.033203125, y = 26974.0 + 300 },
                    --正右
                    { x = 29891.0 - 300, y = 26975.0 + 300 },
                    { x = 28741.0 - 300, y = 25791.0 + 300 },
                    --左上
                    { x = 27353.0 + 300, y = 25972.802734375 },
                    --右上
                    { x = 27299.0, y = 25972.0 + 300 },
                    { x = 27255.0, y = 25967.0 + 300 },
                    { x = 27208.0, y = 25964.0 + 300 },
                    { x = 27160.0, y = 25962.0 + 300 },
                    { x = 27155.0, y = 25968.0 + 300 },
                    --正右
                    { x = 26355.0 - 300, y = 24879.0 + 300 },
                    { x = 25843.0 - 300, y = 24319.0 + 300 },
                    --右下
                    { x = 25843.0 - 300, y = 24319.0 },
                    { x = 25843.0 - 300, y = 24261.0 },
                    { x = 25843.0 - 300, y = 24184.0 },
                    { x = 25843.0 - 300, y = 24081.0 },
                    { x = 25843.0 - 300, y = 23935.0 },
                    { x = 25843.0 - 300, y = 23760.0 },
                    { x = 25843.0 - 300, y = 23551.0 },
                    { x = 25843.0 - 300, y = 23307.0 },
                    --右上
                    { x = 25448.0, y = 22943.0 + 300 },
                    { x = 25241.0, y = 22908.0 + 300 },
                    { x = 25172.392578125, y = 22891.0 + 300 },
                    { x = 25058.158203125, y = 22981.0 + 300 },
                    { x = 24992.505859375, y = 22911.0 + 300 },
                    { x = 24948.8125, y = 22907.0 + 300 },
                    { x = 24893.0625, y = 22899.0 + 300 },
                    { x = 24731.216796875, y = 22821.0 + 300 },
                    --正右
                    { x = 24731.0 - 300, y = 22821.0 + 300 },
                    --正上
                    { x = 19561.0 + 300, y = 24340.0 + 300 },
                    --右上
                    { x = 19132.111328125, y = 24489.0 + 300 },
                    { x = 18774.787109375, y = 24400.0 + 300 },
                    { x = 18324.193359375, y = 24311.0 + 300 },
                    { x = 17125.04296875, y = 24587.0 + 300 },
                    { x = 16832.435546875, y = 24498.0 + 300 },
                    --左上
                    { x = 15106.0 + 300, y = 24856.271484375 },
                    --正上
                    { x = 15106.0 + 300, y = 24856.0 + 300 },
                    { x = 13811.0 + 300, y = 24907.0 + 300 },
                    --右上
                    { x = 13357.0, y = 24907.0 + 300 },
                    --正右
                    { x = 13357.0 - 300, y = 24907.0 + 300 },
                    { x = 13036.0 - 300, y = 24397.0 + 300 },
                    --正下
                    { x = 13069.0 - 300, y = 24415.0 - 300 },
                    --右下
                    { x = 13300.0 - 300, y = 23921.0 },
                    { x = 13132.0 - 300, y = 22904.876953125 },
                    { x = 13161.0 - 300, y = 22388.0 },
                    --正下
                    { x = 13161.0 - 300, y = 22388.0 - 300 },
                    --正右
                    { x = 13097.0 - 300, y = 19412.0 + 300 },
                    { x = 12966.0 - 300, y = 19292.0 + 300 },
                    { x = 13575.0 - 300, y = 12681.0 + 300 },
                    --正下
                    { x = 13575.0 - 100, y = 12681.0 - 100 },
                    --左下
                    { x = 13575.0, y = 12681.0 - 100 },
                    { x = 13634.0, y = 12621.0 - 100 },
                    { x = 13695.0, y = 12609.0 - 100 },
                    { x = 13759.0, y = 12597.0 - 100 },
                    { x = 13824.0, y = 12584.0 - 100 },
                    { x = 13912.0, y = 12569.0 - 100 },
                    { x = 13976.0, y = 12546.0 - 100 },
                    { x = 14048.0, y = 12525.0 - 100 },
                    --正下
                    { x = 14519.0 - 300, y = 12552.0 - 300 },
                    { x = 14684.0 - 300, y = 12103.0 - 300 },
                    { x = 14856.0 - 300, y = 11787.0 - 300 },
                    --正右
                    { x = 14165.0 - 300, y = 10720.0 + 300 },
                    { x = 11862.0 - 300, y = 6318.0 + 300 },
                    { x = 10182.0 - 300, y = 2201.0 + 300 },
                    --右下
                    { x = 10286.0 - 300, y = 1201.0773925781 },
                    --正下
                    { x = 10286.0 - 300, y = 1201.0 - 300 },
                    --左下
                    { x = 10286.57421875, y = 1201.0 - 300 },
                    { x = 17951.53515625, y = 803.0 - 300 },
                    { x = 23916.19140625, y = 1342.0 - 300 },
                    { x = 26090.1328125, y = 3023.0 - 300 },
                    --正左
                    { x = 26089.0 + 300, y = 3022.0 - 300 },
                    { x = 28864.0 + 300, y = 9971.0 - 300 },
                    { x = 28977.0 + 300, y = 11020.0 - 300 },
                    { x = 29465.0 + 300, y = 19739.0 - 300 },
                    { x = 31580.0 + 300, y = 25260.0 - 300 },
                    --正上
                    { x = 31591.0 + 300, y = 25791.0 + 300 },


                }
            },
            {
                name = '黑砧工坊-副本连接',
                area = {
                    --右上
                    { x = 14153.0, y = 26567.0 + 100 },
                    { x = 14040.284179688, y = 26611.0 + 100 },
                    { x = 13970.823242188, y = 26630.0 + 100 },
                    { x = 13856.323242188, y = 26661.0 + 100 },
                    { x = 13787.0, y = 26656.0 },
                    --正右
                    { x = 13787.0 - 100, y = 26656.0 + 100 },
                    { x = 13120.0 - 100, y = 26014.0 + 100 },
                    --右下
                    { x = 13118.0 - 100, y = 25971.0 },
                    { x = 13115.0 - 100, y = 25922.0 },
                    { x = 13112.0 - 100, y = 25882.0 },
                    { x = 13109.0 - 100, y = 25835.0 },
                    { x = 13142.0 - 100, y = 25796.0 },
                    { x = 13158.0 - 100, y = 25740.0 },
                    { x = 13167.0 - 100, y = 25706.0 },
                    --正下
                    { x = 13167.0 - 100, y = 25706.0 - 100 },
                    --左下
                    { x = 13167.0, y = 25706.0 - 100 },
                    { x = 13280.0, y = 25687.0 - 100 },
                    { x = 13367.0, y = 25658.0 - 100 },
                    { x = 13441.0, y = 25614.0 - 100 },
                    { x = 13507.0, y = 25585.0 - 100 },
                    { x = 13589.0, y = 25602.0 - 100 },
                    --正左
                    { x = 13589.0 + 100, y = 25602.0 - 100 },
                    { x = 14143.0 + 100, y = 26249.0 - 100 },
                    --左上
                    { x = 14143.0 + 100, y = 26249.0 },
                    { x = 14153.0 + 100, y = 26567.0 },
                    --正上
                    { x = 14153.0 + 100, y = 26567.0 + 100 },
                }
            },
            {
                name = '黑砧工坊-副本门口',
                area = {
                    --左上
                    { x = 12855.0 + 100, y = 25832.0 },
                    { x = 12859.0 + 100, y = 25901.0 },
                    { x = 12862.0 + 100, y = 25949.0 },
                    { x = 12855.0 + 100, y = 26025.0 },
                    --正上
                    { x = 12719.0 + 300, y = 26048.0 + 300 },
                    { x = 12349.0 + 300, y = 26417.0 + 300 },
                    --左上
                    { x = 12410.0 + 300, y = 28607.865234375 },
                    --正上
                    { x = 12021.0 + 300, y = 29111.0 + 300 },
                    --右上
                    { x = 11638.0, y = 29444.0 + 300 },
                    { x = 7289.021484375, y = 30328.0 + 300 },
                    { x = 2819.7214355469, y = 29997.0 + 300 },
                    --正右
                    { x = 2819.0 - 300, y = 29997.0 + 300 },
                    --右下
                    { x = 2190.0 - 300, y = 29882.712890625 },
                    { x = 1707.0 - 300, y = 26487.017578125 },
                    { x = 1169.0 - 300, y = 24095.83984375 },
                    { x = 1293.0 - 300, y = 22455.564453125 },
                    --正下
                    { x = 1293.0 - 300, y = 22455.0 - 300 },
                    { x = 2668.0 - 300, y = 19756.0 - 300 },
                    --正左.
                    { x = 6058.0 + 300, y = 20398.0 - 300 },

                    --左下
                    { x = 12129.0, y = 20142.0 - 300 },
                    --正左
                    { x = 12252.0 + 300, y = 20263.0 - 300 },
                    --左上
                    { x = 12252.0 + 300, y = 20263.025390625 },
                    { x = 11978.0 + 300, y = 21734.3828125 },
                    { x = 12001.0 + 300, y = 23028.0 },
                    { x = 12288.0 + 300, y = 23491.173828125 },
                    --左下
                    { x = 12855.0, y = 25832.0 - 300 },
                    --正左
                    { x = 12855.0 + 300, y = 25832.0 - 300 },
                }
            },
            {
                name = '黑砧工坊-下小',
                area = {
                    --右上
                    { x = 14072.978515625, y = 12370.0 + 100 },
                    { x = 13977.0, y = 12392.0 + 100 },
                    { x = 13855.052734375, y = 12414.0 + 100 },
                    { x = 13462.0, y = 12583.0 + 100 },
                    --正右
                    { x = 13462.0 - 300, y = 12583.0 + 300 },
                    --右下
                    { x = 13462.0 - 300, y = 12583.0 },
                    { x = 13416.0 - 300, y = 12488.0 },
                    { x = 13322.0 - 300, y = 12171.575195312 },
                    { x = 13164.0 - 300, y = 11905.0 },
                    --正下
                    { x = 13164.0 - 300, y = 11905.0 - 300 },
                    { x = 13409.0 - 300, y = 11566.0 - 300 },
                    --左下
                    { x = 13409.0, y = 11566.0 - 300 },
                    { x = 13674.0, y = 11504.0 - 300 },
                    --正左
                    { x = 13770.0 + 300, y = 11528.0 - 300 },
                    { x = 14065.0 + 300, y = 11974.0 - 300 },
                    { x = 14072.0 + 300, y = 12370.0 - 300 },
                    --正上
                    { x = 14072.0 + 300, y = 12370.0 + 300 },
                }
            },
            {
                name = '黑砧工坊-正右',
                area = {
                    --正上
                    { x = 21281.0 + 300, y = 27986.0 + 300 },
                    { x = 18333.0 + 300, y = 29988.0 + 300 },
                    --右上
                    { x = 18332.81640625, y = 29990.0 + 300 },
                    { x = 16784.22265625, y = 29897.0 + 300 },
                    --正上
                    { x = 14747.0 + 300, y = 30566.0 + 300 },
                    --右上
                    { x = 14747.22265625, y = 30566.0 + 300 },
                    { x = 13242.772460938, y = 29999.0 + 300 },
                    --正右
                    { x = 13242.0 - 300, y = 29999.0 + 300 },
                    --正下
                    { x = 13246.0 - 300, y = 29991.0 - 300 },
                    { x = 13596.0 - 300, y = 29085.0 - 300 },

                    --正右
                    { x = 13704.0 - 300, y = 27327.0 + 300 },
                    --右下
                    { x = 13699.0 - 300, y = 27340.0 },
                    { x = 13762.0 - 300, y = 27200.0 },
                    { x = 13841.0 - 300, y = 27040.0 },
                    { x = 13888.0 - 300, y = 26947.0 },
                    { x = 13906.0 - 300, y = 26745.0 },
                    --正下
                    { x = 13906.0 - 10, y = 26745.0 - 10 },
                    --左下
                    { x = 13906.0, y = 26745.0 - 10 },
                    { x = 13976.0, y = 26727.0 - 10 },
                    { x = 14035.0, y = 26721.0 - 10 },
                    { x = 14152.0, y = 26677.0 - 10 },
                    { x = 14218.0, y = 26651.0 - 50 },
                    --正下
                    { x = 14218.0 - 10, y = 26651.0 - 50 },
                    { x = 14434.0 - 10, y = 26477.0 - 50 },
                    { x = 14421.0 - 10, y = 25969.0 - 10 },
                    { x = 14440.0 - 100, y = 25848.0 - 100 },
                    { x = 14490.0 - 100, y = 25792.0 - 100 },
                    { x = 14525.0 - 100, y = 25731.0 - 100 },
                    { x = 14591.0 - 100, y = 25678.0 - 100 },
                    --正左
                    { x = 14685.0 + 10, y = 25686.0 - 10 },
                    --左上
                    { x = 14685.0 + 100, y = 25686.08203125 },
                    { x = 14721.0 + 100, y = 25740.0 },
                    { x = 14734.0 + 300, y = 25818.0 },
                    { x = 14737.0 + 300, y = 25880.626953125 },
                    { x = 14747.0 + 300, y = 25978.41015625 },
                    { x = 14767.0 + 300, y = 26122.0703125 },
                    --正左
                    { x = 14802.0 + 300, y = 26335.0 - 300 },

                    --正下
                    { x = 16516.0 - 300, y = 25744.0 - 300 },
                    --左下
                    { x = 16516.0, y = 25744.0 - 300 },
                    { x = 16731.0, y = 25681.0 - 300 },
                    { x = 16997.0, y = 25690.0 - 300 },
                    { x = 17446.0, y = 25988.0 - 300 },
                    { x = 17841.798828125, y = 25838.0 - 300 },
                    { x = 18208.333984375, y = 25897.0 - 300 },
                    { x = 19110.0, y = 25979.0 - 300 },
                    { x = 20428.0, y = 25670.0 - 300 },
                    { x = 21594.0, y = 25962.0 - 300 },
                    --正左
                    { x = 21594.0 + 300, y = 25962.0 - 300 },
                    --左上
                    { x = 21594.0 + 300, y = 25962.0 },
                    { x = 21739.0 + 300, y = 26281.0 },
                    { x = 21424.0 + 300, y = 27131.83203125 },
                    { x = 21421.0 + 300, y = 27654.0 },
                },
                min_cz = nil,
                --黑砧工坊-副本连接
                overlap = {
                    ['黑砧工坊-副本连接'] = -1900,
                }
            },
            {
                name = '黑砧工坊-右小',
                area = {
                    --右上
                    { x = 15147.0, y = 25508.0 + 300 },
                    --
                    { x = 14983.0 - 100, y = 25634.0 + 100 },
                    { x = 14866.0 - 100, y = 25469.0 + 100 },
                    --右下
                    { x = 14866.0 - 100, y = 25469.0 + 100 },
                    --正下
                    { x = 14906.0 - 300, y = 25239.0 - 300 },
                    --正左
                    { x = 14906.0 + 300, y = 25239.0 - 300 },
                    { x = 15215.0 + 300, y = 25186.0 - 300 },
                    --左上
                    { x = 15147.0 + 300, y = 25508.0 + 300 },

                }
            },
            {
                name = '黑砧工坊-右上',
                area = {
                    --右上
                    { x = 28146.0, y = 27700.0 + 300 },
                    { x = 27178.4609375, y = 27881.0 + 300 },
                    { x = 26373.60546875, y = 27815.0 + 300 },
                    { x = 24229.224609375, y = 27563.0 + 300 },
                    --正右
                    { x = 24229.0 - 300, y = 27563.0 + 300 },
                    --右下
                    { x = 24229.0 - 300, y = 27563.890625 },
                    { x = 23646.0 - 300, y = 26559.0 },
                    { x = 23467.0 - 300, y = 25836.0 },
                    { x = 23395.0 - 300, y = 25436.0 },
                    --正下
                    { x = 23395.0 - 300, y = 25436.0 - 300 },
                    { x = 24866.0 - 300, y = 24027.0 - 300 },
                    --左下
                    { x = 24866.0, y = 24027.0 - 300 },
                    { x = 24967.0, y = 24027.0 - 300 },
                    { x = 25014.58203125, y = 24027.0 - 300 },
                    { x = 25164.0, y = 24067.0 - 300 },
                    { x = 25432.0, y = 24041.0 - 300 },

                    --正左
                    { x = 25432.0 + 300, y = 24041.0 - 300 },
                    --左上
                    { x = 25432.0 + 300, y = 24041.0 },
                    --正上
                    { x = 25427.0 + 300, y = 24373.0 + 300 },
                    { x = 25178.0 + 300, y = 24781.0 + 300 },
                    --正下
                    { x = 26719.0 - 300, y = 26283.0 - 300 },
                    --左下
                    { x = 26726.10546875, y = 26288.0 - 300 },
                    { x = 26832.0, y = 26286.0 - 300 },
                    { x = 26939.0, y = 26285.0 - 300 },
                    { x = 27007.0, y = 26283.0 - 300 },
                    { x = 27116.0, y = 26283.0 - 300 },
                    { x = 27213.0, y = 26283.0 - 300 },
                    { x = 27313.0, y = 26283.0 - 300 },
                    { x = 27351.583984375, y = 26283.0 - 300 },
                    { x = 27507.0, y = 26308.0 - 300 },
                    --正左
                    { x = 27507.0 + 300, y = 26308.0 - 300 },
                    --左上
                    { x = 27507.0 + 300, y = 26308.0 },
                    --正左
                    { x = 28188.0 + 300, y = 27435.0 - 300 },
                    --正上
                    { x = 28146.0 + 300, y = 27700.0 + 300 },

                }
            },
        },

        ['伟大之城'] = {
            {
                name = '伟大之城-主城',
                area = {
                    { x = 10471 + 20000, y = 11960 + 20000 },
                    { x = 10471 - 20000, y = 11960 + 20000 },
                    { x = 10471 - 20000, y = 11960 - 20000 },
                    { x = 10471 + 20000, y = 11960 - 20000 },
                },
                overlap = {
                    ['伟大之城-升降机'] = 0, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['伟大之城-连接黑砧工坊'] = 0,
                },
            },
            {
                name = '伟大之城-升降机',
                area = {
                    { x = 7040.0, y = 15781.0 },--true 无区域 战：false
                    { x = 7051.0, y = 16117.0 },--true 无区域 战：false
                    { x = 6676.0, y = 16117.0 },--true 无区域 战：false
                    { x = 6687.0 - 30, y = 16069.0 },--true 无区域 战：false
                    { x = 6687.0 - 10, y = 15915.0 - 10 },--true 无区域 战：false
                    { x = 6687.0 - 20, y = 15757.0 - 20 },--true 无区域 战：false
                    { x = 7043.0 + 10, y = 15755.0 - 10},--true 无区域 战：false
                },
            },
            {
                name = '伟大之城-连接黑砧工坊',
                area = {
                    { x = 6594.0 + 50, y = 15368.0 - 50 },--false 伟大之城-主城 战：false
                    { x = 6630.0 + 10, y = 15716.0 + 10 },--false 伟大之城-主城 战：false
                    { x = 6626.0 + 20, y = 16176.0 + 20 },--false 伟大之城-主城 战：false
                    { x = 6592.0 + 50, y = 16865.0 + 50 },--false 伟大之城-主城 战：false
                    { x = 6025.0 + 50, y = 20160.0 + 50 },--false 伟大之城-主城 战：false
                    { x = 5675.0, y = 21013.0 + 500 },--false 伟大之城-主城 战：false
                    { x = 4873.0 - 500, y = 21121.0 + 500 },--false 伟大之城-主城 战：false
                    { x = 4763.0 - 500, y = 20455.0 + 500 },--false 伟大之城-主城 战：false
                    { x = 5133.0 - 200, y = 18712.0 + 200 },--false 伟大之城-主城 战：false
                    { x = 5118.0 - 300, y = 15197.0 + 300 },--false 伟大之城-主城 战：false
                    { x = 5118.0 + 50, y = 15197.0 - 50 },--false 伟大之城-主城 战：false
                },
            },
        },
        -------------------------------------------------------------------------------------
        -- 费顿
        ['哀叹沼泽'] = {
            { name = '哀叹沼泽-呼啸森林',
              area = {
                  --正左
                  { x = 4001.0 + 30, y = 3773.0 - 30 },
                  { x = 4153.0 + 30, y = 3961.0 - 30 },
                  --左上
                  { x = 4153.0 + 300, y = 3961.0 },
                  { x = 4549.0 + 300, y = 4993.0 },
                  { x = 4553.0 + 300, y = 5568.5556640625 },
                  --正上
                  { x = 4553.0 + 300, y = 5568.0 + 300 },
                  --左下
                  { x = 4395.0, y = 7088.0 - 300 },
                  --正左
                  { x = 4395.0 + 300, y = 7088.0 - 300 },
                  --左上
                  { x = 4395.0 + 300, y = 7088.0 },
                  { x = 4501.0 + 300, y = 7843.8559570312 },
                  --右上
                  { x = 4501.0, y = 7843.0 + 300 },
                  { x = 4215.0, y = 8001.0 + 300 },
                  --正右
                  { x = 4134.0 - 300, y = 7978.0 + 300 },
                  { x = 3649.0 - 300, y = 7899.0 + 300 },
                  { x = 2358.0 - 300, y = 7089.0 + 300 },
                  { x = 779.0 - 300, y = 4834.0 + 300 },
                  { x = 322.0 - 300, y = 3079.0 + 300 },
                  { x = -818.0 - 300, y = 1174.0 + 300 },
                  { x = -1770.0 - 300, y = 651.0 + 300 },
                  { x = -1767.0 - 300, y = 148.0 + 300 },
                  --右下
                  { x = -1767.0 - 300, y = 148.85385131836 },
                  --正下
                  { x = -1767.0 - 300, y = 148.0 - 300 },
                  --左下
                  { x = -1234.0, y = -296.0 - 300 },
                  { x = -767.30926513672, y = -679.0 - 300 },
                  { x = 1378.6739501953, y = -1670.0 - 300 },
                  { x = 2383.478515625, y = -1966.0 - 300 },
                  --正左
                  { x = 7127.0 + 300, y = -1619.0 - 300 },
                  --左上
                  { x = 7127.0 + 300, y = -1619.1256103516 },
                  { x = 7177.0 + 300, y = -1227.1685791016 },
                  { x = 6864.0 + 300, y = -781.23059082031 },
                  { x = 5763.0 + 300, y = 475.0 },
                  --正上
                  { x = 5763.0 + 300, y = 475.0 + 300 },
                  { x = 4677.0 + 300, y = 1383.0 + 300 },

                  --正下
                  { x = 3727.0 - 300, y = 3589.0 - 300 },
                  --正左

                  { x = 3727.0 + 30, y = 3589.0 - 30 },
                  { x = 3787.0 + 30, y = 3619.0 - 30 },
                  { x = 3944.0 + 30, y = 3729.0 - 30 },
                  { x = 4003.0 + 30, y = 3778.0 - 30 },
              },

            },
            { name = '哀叹沼泽-沼泽大板块',
              area = {
                  --正上
                  { x = 4125.0 + 300, y = 3686.0 + 300 },
                  { x = 4504.0 + 300, y = 3654.0 + 300 },
                  --右下
                  { x = 5830.0 - 300, y = 4651.0390625 },
                  { x = 5482.0 - 300, y = 5296.0258789062 },
                  { x = 5389.0 - 300, y = 5860.2797851562 },
                  { x = 5036.0 - 300, y = 6899.0 },
                  { x = 5011.0 - 300, y = 7499.0 },

                  { x = 5088.0, y = 8438.0 },
                  --正右
                  { x = 5088.0 - 300, y = 8438.0 + 300 },
                  --正下
                  { x = 4708.0 - 300, y = 8940.0 - 300 },
                  { x = 4427.0 - 300, y = 9129.0 - 300 },
                  { x = 4246.0 - 300, y = 9170.0 - 300 },
                  --右下
                  { x = 4246.0 - 300, y = 9170.0 },
                  { x = 4274.0 - 300, y = 9943.0 },
                  { x = 4436.0 - 300, y = 11143.298828125 },
                  --左下
                  { x = 3630.0, y = 12654.0 - 300 },
                  --正左
                  { x = 2159.0 + 300, y = 12702.0 - 300 },
                  --正下
                  { x = 2159.0 - 300, y = 12702.0 - 300 },
                  { x = 2039.0 - 300, y = 12860.0 - 300 },
                  { x = 1871.0 - 300, y = 13082.0 - 300 },
                  --正左
                  { x = 862.0 + 300, y = 13706.0 - 300 },
                  --左下
                  { x = 862.0, y = 13706.0 - 300 },
                  --正下
                  { x = 862.0 - 300, y = 13706.0 - 300 },
                  { x = 618.0 - 300, y = 13711.0 - 300 },
                  --右下
                  { x = 618.0 - 300, y = 13711.0 },
                  { x = 569.0 - 300, y = 14135.0 },
                  { x = 480.0 - 300, y = 14532.315429688 },
                  { x = 206.0 - 300, y = 15319.0 },
                  { x = 32.0 - 300, y = 15596.0 },
                  { x = 234.0 - 300, y = 16730.0 },
                  { x = 554.0 - 300, y = 17651.033203125 },
                  { x = 263.0 - 300, y = 18279.0 },
                  --正右
                  { x = 263.0 - 300, y = 18279.0 + 300 },
                  { x = 574.0 - 300, y = 18590.0 + 300 },
                  { x = 780.0 - 300, y = 18837.0 + 300 },
                  { x = 837.0 - 300, y = 18965.0 + 300 },
                  --左下
                  { x = 374.0, y = 19674.0 - 300 },
                  { x = 85.0, y = 19785.0 - 300 },
                  { x = -492.0, y = 20502.0 - 300 },
                  { x = -975.57135009766, y = 20422.0 - 300 },
                  { x = -1541.9154052734, y = 20228.0 - 300 },
                  { x = -2123.7788085938, y = 20218.0 - 300 },
                  --正下
                  { x = -2123.0 - 300, y = 20218.0 - 300 },
                  --右下
                  { x = -2123.0 - 300, y = 20218.419921875 },
                  { x = -2215.0 - 300, y = 20503.787109375 },
                  { x = -1911.0 - 300, y = 21049.400390625 },
                  --正右
                  { x = -1911.0 - 300, y = 21049.0 + 300 },
                  --右上
                  { x = -1911.3581542969, y = 21049.0 + 300 },
                  { x = -1515.0, y = 21167.0 + 300 },
                  { x = -787.84820556641, y = 21282.0 + 300 },
                  { x = -22.0, y = 21540.0 + 300 },
                  { x = 836.48553466797, y = 21668.0 + 300 },
                  { x = 4188.0, y = 24333.0 + 300 },
                  { x = 5458.4599609375, y = 24399.0 + 300 },
                  { x = 6563.0, y = 24684.0 + 300 },
                  { x = 8128.5854492188, y = 24651.0 + 300 },
                  { x = 12630.0, y = 24456.0 + 300 },
                  { x = 15321.186523438, y = 24245.0 + 300 },
                  { x = 16821.14453125, y = 23584.0 + 300 },
                  { x = 18592.232421875, y = 23985.0 + 300 },
                  { x = 19061.146484375, y = 23358.0 + 300 },
                  { x = 22925.892578125, y = 22106.0 + 300 },
                  { x = 24171.00390625, y = 21539.0 + 300 },
                  --正上
                  { x = 24171.0 + 300, y = 21539.0 + 300 },
                  --左上
                  { x = 24170.0 + 300, y = 21542.025390625 },
                  { x = 24217.0 + 300, y = 20829.70703125 },
                  { x = 23427.0 + 300, y = 17911.013671875 },
                  { x = 23600.0 + 300, y = 16603.978515625 },
                  --正左
                  { x = 23601.0 + 300, y = 16605.0 - 300 },
                  { x = 23555.0 + 300, y = 16191.0 - 300 },
                  { x = 22818.0 + 300, y = 15229.0 - 300 },
                  { x = 21042.0 + 300, y = 14265.0 - 300 },
                  --左下
                  { x = 21042.890625, y = 14265.0 - 300 },
                  { x = 17168.845703125, y = 15565.0 - 300 },
                  --正下
                  { x = 17067.0 - 300, y = 15638.0 - 300 },
                  { x = 14963.0 - 300, y = 17414.0 - 300 },
                  { x = 14125.0 - 300, y = 17884.0 - 300 },
                  { x = 14159.0 - 300, y = 17918.0 - 300 },
                  { x = 13623.0 - 300, y = 18468.0 - 300 },
                  --右下
                  { x = 13327.0 - 300, y = 19118.34375 },
                  { x = 13173.0 - 300, y = 20369.677734375 },
                  { x = 13103.0 - 300, y = 21198.08203125 },
                  --左下
                  { x = 12731.0, y = 22982.0 - 300 },
                  { x = 10847.405273438, y = 22841.0 - 300 },
                  { x = 8056.0864257812, y = 22646.0 - 300 },
                  { x = 7669.0, y = 22492.0 - 50 },
                  { x = 7441.0, y = 22509.0 - 50 },
                  { x = 6905.05859375, y = 22734.0 - 300 },
                  { x = 6230.0, y = 22930.0 - 300 },
                  { x = 5751.0, y = 23179.0 - 300 },
                  --正左
                  { x = 4920.0 + 300, y = 21954.0 - 300 },
                  { x = 4580.0 + 300, y = 21360.0 - 300 },
                  { x = 3970.0 + 300, y = 21004.0 - 300 },
                  --正上
                  { x = 3329.0 + 300, y = 20050.0 + 300 },
                  { x = 3891.0 + 300, y = 18874.0 + 300 },
                  { x = 4093.0 + 300, y = 18667.0 + 300 },
                  --左上
                  { x = 4093.0 + 50, y = 18667.32421875 },
                  { x = 4093.0 + 1, y = 18667.0 - 1 },
                  { x = 4088.0 + 1, y = 18506.0 - 1 }, --true
                  { x = 4072.0 + 1, y = 18565.0 - 1 }, --true
                  { x = 4100.0 + 1, y = 18368.0 - 1 }, --true



                  { x = 3640.0 + 300, y = 16297.608398438 },
                  { x = 3630.0 + 300, y = 15181.059570312 },
                  --右下
                  { x = 8829.0 - 300, y = 15443.095703125 },
                  --正右
                  { x = 8829.0 - 300, y = 15443.0 + 300 },
                  { x = 9166.0 - 300, y = 15711.0 + 300 },
                  --右上
                  { x = 9172.4482421875, y = 15711.0 + 300 },
                  { x = 9574.9736328125, y = 15645.0 + 300 },
                  { x = 9792.0732421875, y = 15504.0 + 300 },
                  { x = 10441.0, y = 15303.0 + 300 },
                  { x = 11379.70703125, y = 14884.0 + 300 },
                  { x = 13089.440429688, y = 14944.0 + 300 },
                  { x = 14226.0, y = 14521.0 + 300 },
                  --正上
                  { x = 14226.0 + 300, y = 14521.0 + 300 },
                  { x = 20870.0 + 300, y = 11815.0 + 300 },
                  { x = 22732.0 + 300, y = 10070.0 + 300 },
                  { x = 23353.0 + 300, y = 9733.0 + 300 },
                  --左上
                  { x = 23353.0 + 300, y = 9733.0 },
                  { x = 23419.0 + 300, y = 8917.55859375 },
                  { x = 23276.0 + 300, y = 8338.0 },
                  { x = 23475.0 + 300, y = 7820.1708984375 },
                  { x = 23604.0 + 300, y = 6140.1674804688 },
                  { x = 23829.0 + 300, y = 5072.0 },
                  { x = 23678.0 + 300, y = 2638.1286621094 },
                  { x = 23471.0 + 300, y = 1492.0 },
                  --正左
                  { x = 23471.0 + 300, y = 1492.0 - 300 },
                  { x = 22550.0 + 300, y = 283.0 - 300 },
                  { x = 20794.0 + 300, y = -1007.0 - 300 },
                  { x = 19332.0 + 300, y = -1852.0 - 300 },
                  --左下
                  { x = 19332.38671875, y = -1852.0 - 300 },
                  { x = 17718.357421875, y = -1716.0 - 300 },
                  { x = 15802.365234375, y = -1191.0 - 300 },
                  { x = 15262.737304688, y = -1321.0 - 300 },
                  { x = 14144.0390625, y = -1556.0 - 300 },
                  { x = 12701.805664062, y = -968.0 - 300 },
                  { x = 6463.6040039062, y = 1635.0 - 300 },
                  { x = 5999.7412109375, y = 1752.0 - 300 },
                  --正下
                  { x = 5988.0 - 300, y = 1754.0 - 300 },
                  { x = 4499.0 - 300, y = 2627.0 - 300 },
                  { x = 3933.0 - 300, y = 3140.0 - 300 },
                  --右下
                  { x = 3933.0 - 300, y = 3140.2438964844 },
                  { x = 3878.0 - 300, y = 3576.0 },
                  --正右
                  { x = 3878.0 - 50, y = 3576.0 + 50 },
                  { x = 4112.0 - 50, y = 3689.0 + 50 },

              },
              overlap = {
                  ['哀叹沼泽-半魔人居住地小'] = 1000,
                  ['哀叹沼泽-守望者栖息地'] = 2047,
              },
            },

            { name = '哀叹沼泽-守望者栖息地',
              area = {
                  --左上
                  { x = 14368.0 + 300, y = 8750.0244140625 }, --false
                  { x = 14462.0 + 300, y = 9632.0771484375 },
                  { x = 13275.0 + 300, y = 11727.0 },
                  { x = 13141.0 + 300, y = 12467.15234375 },
                  --正上
                  { x = 13141.0 + 300, y = 12467.0 + 300 },
                  { x = 12611.0 + 300, y = 12798.0 + 300 },
                  { x = 12131.0 + 300, y = 13000.0 + 300 },
                  --右上
                  { x = 12131.614257812, y = 13000.0 + 300 },
                  { x = 11202.0, y = 12358.0 + 300 },
                  --正右
                  { x = 11225.0 - 300, y = 12250.0 + 300 },
                  { x = 11016.0 - 300, y = 11598.0 + 300 },
                  --右下
                  { x = 11016.0 - 300, y = 11598.90625 },
                  { x = 11710.0 - 300, y = 7811.33203125 },
                  --正下
                  { x = 11710.0 - 300, y = 7811.0 - 300 },
                  --左下
                  { x = 11710.073242188, y = 7811.0 - 300 },
                  { x = 12417.397460938, y = 7173.0 - 300 },
                  { x = 12874.631835938, y = 7144.0 - 300 },

              },
              min_cz = 1024,
            },

            { name = '哀叹沼泽-半魔人居住地小',
              area = {
                  --正上
                  { x = 20970.0+50, y = 4865.0+50 },--true
                  { x = 20553.0+50, y = 5112.0+50 },--true
                  --正右
                  { x = 20553.0-50, y = 5112.0+50 },
                  { x = 20377.0-50, y = 4980.0+50 },
                  --右下
                  { x = 20413.0-50, y = 4858.0 },
                  --正右
                  { x = 20134.0-50, y = 4490.0+50 },
                  { x = 20061.0-50, y = 4157.0+50 },
                  { x = 19882.0-50, y = 3803.0+50 },
                  --右下
                  { x = 19882.0-50, y = 3803.2980957031 },
                  --正下
                  { x = 19882.0-50, y = 3803.0-50 },
                  { x = 20280.0-50, y = 3732.0-50 },
                  --左下
                  { x = 20280.0, y = 3732.0-50 },
                  --正左
                  { x = 20280.0+50, y = 3732.0-50 },
                  { x = 20381.0+50, y = 3859.0-50 },
                  { x = 20485.0+50, y = 4035.0-50 },

                  { x = 20616.0+50, y = 4242.0-50 },

                  { x = 20777.0+50, y = 4239.0-50 },

                  { x = 20866.0+50, y = 4298.0-50 },
                  { x = 20866.0+50, y = 4543.0-50 },
                  { x = 20897.0+50, y = 4639.0-50 },
                  { x = 20926.0+50, y = 4739.0-50 },
                  { x = 20958.0+50, y = 4877.0-50 },
                  --左上
                  { x = 20958.0+50, y = 4877.0444335938 },
              },
              min_cz = 2047,
            },

            { name = '哀叹沼泽-电梯',
              area = {
                  { x = 4093.0 - 300, y = 18660.0 - 300 },
                  { x = 4241.0 - 300, y = 18425.0 - 300 }, --false
                  { x = 5236.0 - 300, y = 18056.0 - 300 }, --false
                  { x = 5369.0 - 300, y = 18022.0 - 300 }, --false

                  { x = 5369.0 + 100, y = 18022.0 - 100 }, --false

                  { x = 5369.0 + 10, y = 18022.099609375 }, --false
                  { x = 5416.0 + 10, y = 18179.435546875 }, --false


                  { x = 5416.0 + 300, y = 18179.0 + 300 }, --false
                  { x = 5051.0 + 300, y = 18375.0 + 300 }, --false
                  { x = 4894.0 + 300, y = 18470.0 + 300 }, --false
                  { x = 4745.0 + 300, y = 18516.0 + 300 }, --false
                  { x = 4612.0 + 300, y = 18556.0 + 300 }, --false
                  { x = 4544.0 + 300, y = 18563.0 + 300 }, --false
                  { x = 4469.0 + 300, y = 18569.0 + 300 }, --false
                  { x = 4340.0 + 300, y = 18581.0 + 300 }, --false
                  { x = 4100.0, y = 18368.0 + 300 },

                  { x = 4100.0 + 10, y = 18368.0 - 10 },
                  { x = 4095.0 + 10, y = 18403.0 - 10 },
                  { x = 4093.0 + 10, y = 18455.0 - 10 },
                  { x = 4100.0 + 10, y = 18482.0 - 10 },
                  { x = 4083.0 + 20, y = 18509.0 - 20 },
                  { x = 4099.0 + 10, y = 18544.0 - 10 },
                  { x = 4099.0 + 10, y = 18549.0 - 10 },
                  { x = 4098.0 + 10, y = 18559.0 - 10 },
                  { x = 4097.0 + 10, y = 18567.0 - 10 },
                  { x = 4097.0 + 10, y = 18583.0 - 10 },
                  { x = 4096.0 + 10, y = 18597.0 - 10 },
                  { x = 4093.0 + 10, y = 18660.0 - 10 },


              },
            },
            { name = '哀叹沼泽-绝望沼泽',
              area = {
                  --右下
                  { x = 5516.0 - 10, y = 18350.0 },
                  { x = 5502.0 - 10, y = 18269.177734375 },
                  { x = 5479.0 - 10, y = 18203.53125 },
                  { x = 5452.0 - 10, y = 18146.654296875 },
                  --正右
                  { x = 5452.0 - 10, y = 18146.0 + 10 },
                  { x = 5435.0 - 10, y = 18111.0 + 10 },
                  { x = 5420.0 - 10, y = 18080.0 + 10 },
                  { x = 5397.0 - 10, y = 18031.0 + 10 },
                  { x = 5378.0 - 10, y = 17992.0 + 10 },
                  { x = 5378.0 - 10, y = 17992.0 + 10 },


                  --右下
                  { x = 5378.0 - 300, y = 17992.0 },
                  --正下
                  { x = 5378.0 - 300, y = 17992.0 - 300 },
                  { x = 5440.0 - 300, y = 17950.0 - 300 },
                  { x = 5569.0 - 300, y = 17864.0 - 300 },
                  { x = 5623.0 - 300, y = 17828.0 - 300 },
                  --左下
                  { x = 6217.0, y = 17836.0 - 300 },
                  { x = 7738.0, y = 17768.0 - 300 },
                  { x = 8943.267578125, y = 17178.0 - 300 },
                  { x = 9331.0, y = 17009.0 - 300 },
                  { x = 9831.0, y = 16876.0 - 300 },
                  { x = 10664.0546875, y = 17123.0 - 300 },
                  --正左
                  { x = 11190.0 + 300, y = 17407.0 - 300 },
                  { x = 11393.0 + 300, y = 17878.0 - 300 },
                  --左上
                  { x = 11393.0 + 300, y = 17878.82421875 },
                  { x = 11479.0 + 300, y = 18600.0 },
                  { x = 11243.0 + 300, y = 19183.6328125 },
                  { x = 11100.0 + 300, y = 20362.00390625 },
                  --正上
                  { x = 11259.0 + 300, y = 20355.0 + 300 },
                  { x = 10986.0 + 300, y = 20989.0 + 300 },
                  { x = 10018.0 + 300, y = 21604.0 + 300 },
                  --右上
                  { x = 8948.0, y = 21866.0 + 300 },
                  { x = 8101.0, y = 21665.0 + 300 },
                  --正左
                  { x = 7619.0 + 300, y = 22399.0 - 300 },
                  --正上
                  { x = 7619.0 + 50, y = 22399.0 + 50 },
                  { x = 7554.0 + 50, y = 22397.0 + 50 },
                  { x = 7463.0 + 50, y = 22393.0 + 50 },
                  { x = 7404.0 + 50, y = 22391.0 + 50 },
                  --正右
                  { x = 7404.0 - 300, y = 22391.0 + 300 },
                  --右下
                  { x = 7404.0 - 300, y = 22391.0 },
                  { x = 7284.0 - 300, y = 21993.0 },
                  { x = 6915.0 - 300, y = 21392.5234375 },
                  { x = 6699.0 - 300, y = 20933.0 },
                  --正右
                  { x = 5413.0 - 300, y = 20437.0 + 300 },
                  --右下
                  { x = 5413.0 - 300, y = 20437.0 },
                  { x = 5326.0 - 300, y = 19414.0 },
                  { x = 5540.0 - 300, y = 18876.287109375 },
                  { x = 5516.0 - 300, y = 18350.0 },


              },
            },


        },

        ['阴沉峭壁'] = {
            { name = '阴沉峭壁-门口',
              area = {
                  --正上
                  { x = 16795.0 + 50, y = 3381.0 + 50, },
                  { x = 16388.0 + 50, y = 3756.0 + 50 },
                  { x = 15990.0 + 50, y = 4091.0 + 50 },

                  --右上
                  { x = 16000.0, y = 4170.0 + 10 },
                  { x = 15912.0, y = 4173.0 + 10 },
                  { x = 15827.0, y = 4176.0 + 10, },
                  { x = 15756.0, y = 4178.0 + 10, },
                  { x = 15688.0, y = 4181.0 + 10, },
                  { x = 15441.0, y = 4182.0 + 50 },
                  { x = 14881.0, y = 4039.0 + 50 },
                  --正右
                  { x = 14881.0 - 50, y = 4039.0 + 50 },
                  { x = 14086.0 - 50, y = 1800.0 + 50 },
                  --右下
                  { x = 14086.0 - 500, y = 1800.0 },
                  { x = 14245.0 - 500, y = 1006.0 },
                  --正下
                  { x = 14245.0 - 500, y = 1006.0 - 500 },
                  --左下
                  { x = 14609.0, y = 974.0 - 50 },
                  { x = 15098.0, y = 812.0 - 50 },
                  --正左
                  { x = 15098.0 + 50, y = 812.0 - 50 },
                  { x = 15486.0 + 50, y = 1697.0 - 50 },
                  { x = 15958.0 + 50, y = 2307.0 - 50 },
                  { x = 16831.0 + 50, y = 3124.0 - 50 },
                  --左上
                  { x = 16831.0 + 50, y = 3124.0 },
                  { x = 16795.0 + 50, y = 3381.0 },


              }
            },
            { name = '阴沉峭壁-电梯',
              area = {
                  { x = 16141.0 + 10, y = 4730.0 + 10 },
                  { x = 15603.0 - 10, y = 4730.0 + 10 },
                  { x = 15603.0 - 10, y = 4208.0 - 10 },
                  { x = 16141.0 + 10, y = 4208.0 - 10 },
              }
                --电梯       --name[升降机] res_id[10A6E5] dist[120]
            },
            { name = '阴沉峭壁-圣疗院广场',
              area = {
                  --正左
                  { x = 23987.0 + 50, y = 9683.0 - 50 }, --false
                  --左上
                  { x = 23987.0 + 50, y = 9683.0 },
                  { x = 23952.0 + 50, y = 9850.0 },
                  --正上
                  { x = 23952.0 + 50, y = 9850.0 + 50 },
                  { x = 23926.0 + 50, y = 9942.0 + 50 },
                  { x = 23869.0 + 50, y = 9998.0 + 50 },
                  { x = 23830.0 + 50, y = 10037.0 + 50 },
                  { x = 23742.0 + 50, y = 10125.0 + 50 },
                  { x = 23656.0 + 50, y = 10211.0 + 50 },
                  { x = 23570.0 + 50, y = 10297.0 + 50 },
                  { x = 23475.0 + 50, y = 10357.0 + 50 },
                  --左上
                  { x = 23462.0 + 50, y = 10438.0 },
                  { x = 23476.0 + 50, y = 10501.0 },
                  { x = 23474.0 + 50, y = 10584.0 },
                  { x = 23472.0 + 50, y = 10672.0 },
                  { x = 23468.0 + 50, y = 10799.0 },
                  { x = 23465.0 + 50, y = 10943.997070312 },
                  { x = 23458.0 + 50, y = 11072.0 },
                  --正上
                  { x = 23458.0 + 50, y = 11072.0 + 50 },
                  --右上
                  { x = 23453.0, y = 11053.0 + 50 },
                  { x = 23128.0, y = 11014.0 + 50 },
                  { x = 22303.0, y = 11007.0 + 50 },
                  { x = 21218.0, y = 11011.0 + 50 },
                  { x = 20230.0, y = 11055.0 + 50 },
                  { x = 18494.0, y = 11042.0 + 50 },
                  { x = 16343.0, y = 9266.0 + 50 },
                  { x = 15386.0, y = 9266.0 + 50 },
                  --左上
                  { x = 13494.0 + 50, y = 9762.0 },
                  --正上
                  { x = 13494.0 + 50, y = 9762.0 + 50 },
                  --右上
                  { x = 13494.0, y = 9762.0 + 50 },
                  { x = 13408.0, y = 9753.0 + 50 },
                  { x = 13268.0, y = 9791.0 + 50 },
                  { x = 13072.0, y = 9799.0 + 50 },
                  { x = 12656.0, y = 9753.0 + 50 },
                  { x = 12158.0, y = 9761.0 + 50 },
                  { x = 11743.0, y = 9752.0 + 50 },
                  { x = 11398.0, y = 9736.0 + 50 },
                  { x = 11090.0, y = 9767.0 + 50 },
                  --正右
                  { x = 11090.0 - 50, y = 9767.0 + 50 },
                  --右下
                  { x = 11090.0 - 50, y = 9767.0 },
                  { x = 11090.0 - 50, y = 9116.0 },
                  { x = 11090.0 - 50, y = 8295.0 },
                  { x = 11096.0 - 50, y = 7463.0 },
                  { x = 10907.0 - 50, y = 6931.0 },
                  { x = 11101.0 - 50, y = 6307.0 },
                  { x = 11090.0 - 50, y = 5543.0 },
                  { x = 11090.0 - 50, y = 5075.0 },
                  --正下
                  { x = 11090.0 - 50, y = 5075.0 - 50 },
                  --左下
                  { x = 11090.0, y = 5075.0 - 50 },
                  { x = 11410.0, y = 4819.0 - 50 },
                  { x = 11925.0, y = 4867.0 - 50 },
                  { x = 12702.0, y = 4853.0 - 50 },
                  { x = 13494.0, y = 4819.0 - 50 },
                  --正左
                  { x = 13494.0 + 50, y = 4819.0 - 50 },
                  --左上
                  { x = 13494.0 + 50, y = 4819.0 },
                  --正下
                  { x = 15434.0 - 50, y = 4847.0 - 50 },
                  --左下（电梯）

                  { x = 15434.0, y = 4847.0 - 20 },
                  --  { x = 15636.0, y = 4801.0-20 },
                  { x = 15624.0, y = 4776.0 - 20 }, --false
                  { x = 15754.0, y = 4771.0 - 20 },
                  { x = 15925.0, y = 4771.0 - 20 },
                  { x = 16091.0, y = 4771.0 - 20 },
                  { x = 16166.0, y = 4835.0 - 20 },


                  --正左
                  { x = 16166.0 + 50, y = 4835.0 - 50 },
                  --正下
                  { x = 18258.0 - 50, y = 5001.0 - 50 },
                  --左下
                  { x = 18258.0, y = 5001.0 - 50 },
                  { x = 18497.0, y = 4969.0 - 50 },
                  { x = 18681.0, y = 4968.0 - 50 },
                  { x = 18779.0, y = 4894.0 - 50 },
                  { x = 19191.0, y = 4963.0 - 50 },
                  { x = 19246.0, y = 4880.0 - 50 },
                  { x = 19884.0, y = 4842.0 - 50 },
                  { x = 20326.0, y = 4843.0 - 50 },
                  { x = 20452.0, y = 5075.0 - 50 },
                  --左上
                  { x = 20582.0 + 50, y = 5260.0 },
                  --左下
                  { x = 23987.0, y = 9683.0 - 50 },

              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口一',
              area = {
                  --正左
                  { x = 13943.0 + 30, y = 10243.0 - 30 },
                  --左上
                  { x = 13943.0 + 30, y = 10243.0 },
                  { x = 13953.0 + 30, y = 10336.327148438 },
                  --正上
                  { x = 13953.0 + 30, y = 10336.0 + 30 },
                  { x = 13837.0 + 30, y = 10494.0 + 30 },
                  --右上
                  { x = 13780.0, y = 10482.0 + 30 },
                  { x = 13627.0, y = 10445.0 + 30 },
                  { x = 13427.0, y = 10450.0 + 30 },
                  { x = 13340.0, y = 10467.0 + 30 },
                  { x = 13074.0, y = 10462.0 + 30 },
                  --正右
                  { x = 13074.0 - 30, y = 10462.0 + 30 },
                  --右下
                  { x = 13072.0 - 30, y = 10462.0 },
                  { x = 13063.0 - 30, y = 10387.0 },
                  --正下
                  { x = 13063.0 - 30, y = 10387.0 - 30 },
                  --左下
                  { x = 13063.0, y = 10387.0 - 30 },
                  { x = 13214.0, y = 10383.0 - 30 },
                  { x = 13359.0, y = 10380.0 - 30 },
                  { x = 13580.0, y = 10373.0 - 30 },
                  --正下
                  { x = 13826.0 - 30, y = 10243.0 - 30 },
                  --左下
                  { x = 13826.0, y = 10243.0 - 30 },
              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口二',
              area = {
                  --左下
                  { x = 14024.0, y = 10450.0 - 50 },
                  { x = 14290.0, y = 10463.0 - 50 },
                  --正左
                  { x = 14290.0 + 50, y = 10463.0 - 50 },
                  { x = 14415.0 + 50, y = 10577.0 - 50 },
                  --左上
                  { x = 14415.0 + 50, y = 10577.083007812 },
                  { x = 14374.0 + 50, y = 10791.0 },
                  { x = 14209.0 + 50, y = 11239.0 },
                  --正上
                  { x = 14209.0 + 50, y = 11239.0 + 50 },
                  --右上
                  { x = 14209.0, y = 11239.0 + 50 },
                  { x = 14081.0, y = 11239.0 + 50 },
                  { x = 11570.0, y = 11055.0 + 50 },
                  --左上
                  { x = 9312.0 + 50, y = 13325.0 },
                  { x = 9334.0 + 50, y = 14407.0 },
                  --正上
                  { x = 9334.0 + 50, y = 14407.0 + 50 },
                  --右上
                  { x = 9334.0, y = 14407.0 + 50 },
                  { x = 9152.0, y = 14407.0 + 50 },
                  { x = 8930.0, y = 14407.0 + 50 },
                  --正右
                  { x = 8930.0 - 50, y = 14407.0 + 50 },
                  --右下
                  { x = 8930.0 - 50, y = 14407.0 },
                  { x = 8786.0 - 50, y = 13799.0 },
                  { x = 8786.0 - 50, y = 13491.0 },
                  { x = 8904.0 - 50, y = 12044.0 },
                  { x = 8907.0 - 50, y = 11779.989257812 },
                  --正下
                  { x = 8907.0 - 100, y = 11779.0 - 100 },
                  { x = 10073.0 - 100, y = 10607.0 - 100 },
                  { x = 10253.0 - 100, y = 10441.0 - 100 },
                  --左下
                  { x = 10253.0, y = 10441.0 - 50 },
                  { x = 10479.40234375, y = 10449.0 - 50 },
                  { x = 11428.4296875, y = 10449.0 - 50 },
                  { x = 11648.219726562, y = 10449.0 - 50 },
                  { x = 12256.7109375, y = 10670.0 - 50 },
                  { x = 12662.0, y = 10643.0 - 10 },
                  --左下（小）
                  { x = 12850.0, y = 10596.0 - 10 },
                  { x = 12978.0, y = 10574.0 - 10 },
                  { x = 13204.0, y = 10561.0 - 10 },
                  { x = 13338.0, y = 10554.0 - 10 },
                  { x = 13559.0, y = 10565.0 - 10 },
                  { x = 13720.0, y = 10591.0 - 10 },
                  --正下（小）
                  { x = 13852.0 - 10, y = 10569.0 - 10 },
                  { x = 13885.0 - 10, y = 10527.0 - 10 },
                  { x = 14019.0 - 10, y = 10451.0 - 10 },

              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口三',
              area = {
                  --正下
                  { x = 17298.0 - 50, y = 12916.0 - 50 },
                  { x = 17498.0 - 50, y = 12760.0 - 50 },
                  --左下
                  { x = 17498.837890625, y = 12760.0 - 50 },
                  { x = 17740.0, y = 12755.0 - 50 },
                  --正左
                  { x = 17740.0 + 50, y = 12755.0 - 50 },
                  { x = 17901.0 + 50, y = 12933.0 - 50 },
                  --左上
                  { x = 17901.0 + 50, y = 12933.0 },
                  { x = 17896.0 + 50, y = 13164.0 },
                  --正上
                  { x = 17896.0 + 50, y = 13164.0 + 50 },
                  { x = 17577.0 + 50, y = 13234.0 + 50 },
                  --右上
                  { x = 17577.099609375, y = 13234.0 + 50 },
                  --左上
                  { x = 11974.0 + 50, y = 17047.0 },
                  --正上
                  { x = 11974.0 + 50, y = 17047.0 + 50 },
                  --右上
                  { x = 11974.0, y = 17047.0 + 50 },
                  { x = 11815.0, y = 17047.0 + 50 },
                  { x = 9930.0, y = 15808.0 + 50 },
                  { x = 9821.0, y = 15850.0 + 50 },
                  --右下
                  { x = 9739.0 - 50, y = 15653.0 },
                  --右上
                  { x = 9226.0, y = 15609.0 + 50 },
                  { x = 9124.0, y = 15629.0 + 50 },
                  { x = 9006.0, y = 15642.0 + 50 },
                  { x = 8880.0, y = 15648.0 + 50 },
                  { x = 8804.0, y = 15652.0 + 50 },
                  --正右
                  { x = 8804.0 - 50, y = 15652.0 + 50 },
                  --右下
                  { x = 8804.0 - 50, y = 15652.0 },
                  { x = 8806.0 - 50, y = 15526.0 },
                  { x = 8810.0 - 50, y = 15380.0 },
                  { x = 8813.0 - 50, y = 15256.0 },
                  { x = 8818.0 - 50, y = 15011.0 },
                  --正下
                  { x = 8818.0 - 50, y = 15011.0 - 50 },
                  --左下
                  { x = 8818.0, y = 15011.0 - 50 },
                  { x = 8957.0, y = 15001.0 - 50 },
                  { x = 9105.0, y = 14999.0 - 50 },

                  { x = 9393.0, y = 15011.0 - 50 },
                  { x = 10575.166015625, y = 15283.000976562 },
                  --正下
                  { x = 11630.0 - 50, y = 13688.0 - 50 },
                  --左下
                  { x = 11753.0, y = 13612.0 - 50 },
                  { x = 11989.0, y = 13619.0 - 50 },
                  { x = 13944.0, y = 12814.0 - 50 },
                  { x = 14179.0, y = 12746.0 - 50 }, --false
                  { x = 14334.0, y = 12807.0 - 50 },


              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口四',
              area = {
                  --左上
                  { x = 9398.0 + 50, y = 15921.0 },
                  { x = 9377.0 + 50, y = 16207.0 },
                  --正上
                  { x = 9377.0 + 50, y = 16207.0 + 50 },
                  --右上
                  { x = 9377.0, y = 16207.0 + 50 },
                  { x = 9188.4931640625, y = 16203.0 + 50 },
                  { x = 8450.9033203125, y = 16295.0 + 50 },
                  { x = 7094.0, y = 16523.0 + 50 },
                  { x = 6870.9252929688, y = 16522.0 + 50 },
                  --正右
                  { x = 6870.0 - 50, y = 16522.0 + 50 },
                  --右下
                  { x = 6870.0 - 50, y = 16522.318359375 },
                  { x = 6811.0 - 50, y = 16384.0 },
                  { x = 6821.0 - 50, y = 16191.0 },
                  { x = 6810.0 - 50, y = 16076.0 },
                  { x = 6818.0 - 50, y = 16013.0 },
                  { x = 6898.0 - 50, y = 15687.0 },
                  --右上
                  { x = 6751.0, y = 15591.0 + 50 },
                  { x = 6695.9990234375, y = 15591.0 + 50 },
                  { x = 6628.0, y = 15640.0 + 50 },
                  { x = 6544.9892578125, y = 15642.0 + 50 },
                  { x = 6494.0, y = 15640.0 + 50 },
                  --正右
                  { x = 6494.0 - 50, y = 15640.0 + 50 },
                  --右下
                  { x = 6494.0 - 50, y = 15640.0 },
                  { x = 6502.0 - 50, y = 15595.0 },
                  { x = 6506.0 - 50, y = 15550.0 },
                  { x = 6510.0 - 50, y = 15504.0 },
                  { x = 6514.0 - 50, y = 15448.0 },
                  { x = 6478.0 - 50, y = 15395.0 },
                  --正下
                  { x = 6478.0 - 50, y = 15395.0 - 50 },
                  --左下
                  { x = 6478.0, y = 15395.0 - 50 },
                  { x = 6581.0, y = 15395.0 - 50 },
                  { x = 6707.0, y = 15395.0 - 50 },
                  { x = 6829.0, y = 15395.0 - 50 },
                  --右下
                  { x = 6913.0 - 50, y = 15309.0 },
                  { x = 6898.0 - 50, y = 15171.0 },
                  { x = 6898.0 - 50, y = 15052.0 },
                  { x = 6898.0 - 50, y = 14853.0 },
                  --右上
                  { x = 6598.0, y = 14682.0 + 50 },
                  { x = 6491.0, y = 14683.0 + 50 },
                  --正右
                  { x = 6491.0 - 50, y = 14683.0 + 50 },
                  --右下
                  { x = 6491.0 - 50, y = 14683.0 },
                  { x = 6504.0 - 50, y = 14619.0 },
                  { x = 6514.0 - 50, y = 14499.0 },
                  { x = 6478.0 - 50, y = 14435.0 },
                  --正下
                  { x = 6478.0 - 50, y = 14435.0 - 50 },
                  --左下
                  { x = 6481.0, y = 14446.0 - 50 },
                  { x = 6557.0, y = 14432.0 - 50 },
                  { x = 6655.0, y = 14428.0 - 50 },
                  { x = 6744.0, y = 14432.0 - 50 },
                  --右下
                  { x = 6898.0 - 50, y = 14195.0 },
                  --左下
                  { x = 6909.515625, y = 14195.0 - 50 },
                  { x = 7119.0, y = 14370.0 - 50 },
                  { x = 7302.0, y = 14499.0 - 50 },
                  --正左
                  { x = 7302.0 + 50, y = 14499.0 - 50 },
                  --左上
                  { x = 7302.0 + 50, y = 14499.014648438 },
                  { x = 7298.0 + 50, y = 14643.412109375 },
                  --左下
                  { x = 8392.203125, y = 15939.0 - 50 },
                  { x = 8563.4130859375, y = 15912.0 - 50 },
                  { x = 8696.0, y = 15907.0 - 50 },
                  { x = 8839.0, y = 15907.0 - 50 },
                  { x = 8973.0, y = 15891.0 - 50 },
                  { x = 9094.0, y = 15891.0 - 50 },
                  { x = 9398.0, y = 15921.0 - 50 },
                  --正左
                  { x = 9398.0 + 50, y = 15921.0 - 50 },

              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口五',
              area = {
                  --左上
                  { x = 7629.0 + 50, y = 13408.0 },
                  { x = 7623.0 + 50, y = 13617.0 },
                  --右上
                  { x = 7478.0, y = 13703.0 + 50 },
                  { x = 7131.0, y = 13711.0 + 50 },
                  { x = 6871.0, y = 13841.0 + 50 },
                  --左上
                  { x = 6518.0 + 10, y = 14069.075195312 },
                  { x = 6437.0 + 10, y = 14491.0 },
                  { x = 6406.0 + 10, y = 14784.0 },
                  { x = 6473.0 + 10, y = 15235.0 },
                  { x = 6493.0 + 10, y = 15335.0 },
                  { x = 6439.0 + 10, y = 15455.0 },
                  { x = 6442.0 + 10, y = 15588.0 },
                  { x = 6452.0 + 10, y = 15704.0 },
                  { x = 6504.0 + 10, y = 15846.0 },
                  { x = 6515.0 + 10, y = 16071.0 }, --false
                  { x = 6473.0 + 10, y = 16125.0 },
                  { x = 6087.0 + 50, y = 16664.0 },
                  --正上
                  { x = 6087.0 + 50, y = 16664.0 + 50 },
                  --右上
                  { x = 6087.0, y = 16664.0 + 50 },
                  { x = 6011.0, y = 16673.0 + 50 },
                  --右下
                  { x = 6011.0 - 50, y = 16673.0 },
                  { x = 6016.0 - 50, y = 16448.0 },
                  { x = 6010.0 - 50, y = 16141.533203125 },
                  { x = 6007.0 - 50, y = 15744.0 },
                  { x = 6017.0 - 50, y = 14332.997070312 },
                  --左上
                  { x = 4134.0 + 50, y = 14276.833007812 },
                  --正上
                  { x = 4134.0 + 50, y = 14276.0 + 50 },
                  --右上
                  { x = 4133.431640625, y = 14267.0 + 50 },

                  { x = 3926.0, y = 14268.0+50 },
                  --正右
                  { x = 3926.0 - 50, y = 14268.0 + 50 },
                  --右下
                  { x = 3926.0 - 50, y = 14268.0 },
                  { x = 3937.0 - 50, y = 13915.0 },
                  { x = 3928.0 - 50, y = 13068.0 },
                  --正下
                  { x = 3928.0 - 50, y = 13068.0 - 50 },
                  --左下
                  { x = 3928.1040039062, y = 13068.0 - 50 },
                  { x = 4262.0, y = 13073.0 - 50 },
                  { x = 6002.0, y = 13395.0 - 50 },
                  { x = 7629.0, y = 13408.0 - 50 },
                  --正左
                  { x = 7629.0 + 50, y = 13408.0 - 50 },
              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口六',
              area = {
                  --左上
                  { x = 4342.0 + 30, y = 15395.0 },
                  { x = 4342.0 + 30, y = 15652.748046875 },
                  --正上
                  { x = 4342.0 + 30, y = 15652.0 + 30 },
                  --右上
                  { x = 4342.0, y = 15652.0 + 30 },

                  { x = 3791.0, y = 15666.0 + 30 },
                  { x = 3682.0, y = 15561.0 + 30 },
                  --正右
                  { x = 3682.0 - 30, y = 15561.0 + 30 },
                  --右下
                  { x = 3682.0 - 30, y = 15561.0 },
                  { x = 3682.0 - 30, y = 15395.0 },
                  --正下
                  { x = 3682.0 - 30, y = 15395.0 - 30 },
                  --左下
                  { x = 3682.0, y = 15395.0 - 30 },
                  { x = 4342.0, y = 15395.0 - 30 },
                  --正左
                  { x = 4342.0 + 30, y = 15395.0 - 30 },
              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口七',
              area = {
                  --左上
                  { x = 3964.0 + 30, y = 15731.0 },
                  { x = 3993.0 + 30, y = 16501.0 },
                  { x = 3959.0 + 30, y = 16887.0 },
                  --正上
                  { x = 3959.0 + 30, y = 16887.0 + 30 },
                  --右上
                  { x = 3959.0, y = 16887.0 + 30 },
                  { x = 3795.0, y = 16864.0 + 30 },
                  --右下
                  { x = 3795.0 - 30, y = 16864.0 },
                  { x = 3827.0 - 30, y = 16588.5546875 },
                  { x = 3823.0 - 30, y = 16217.0 },
                  { x = 3826.0 - 30, y = 15731.0 },
                  --正下
                  { x = 3826.0 - 30, y = 15731.0 - 30 },
                  --左下
                  { x = 3826.0, y = 15731.0 - 30 },
                  { x = 3964.0, y = 15731.0 - 30 },
              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口八',
              area = {
                  --左上
                  { x = 4418.0 + 50, y = 16450.0 },
                  { x = 4390.0 + 50, y = 17026.0 },
                  --正上
                  { x = 4390.0 + 50, y = 17026.0 + 50 },
                  --右上
                  { x = 4390.0, y = 17026.0 + 50 },
                  { x = 4282.0, y = 17017.0 + 50 },
                  --正右
                  { x = 4282.0 - 50, y = 17017.0 + 50 },
                  --右下
                  { x = 4282.0 - 50, y = 17017.0 },
                  { x = 4273.0 - 50, y = 16915.0 },
                  { x = 4245.0 - 50, y = 16746.333984375 },
                  { x = 4242.0 - 50, y = 16627.0 },
                  { x = 4146.0 - 50, y = 16567.0 },
                  { x = 4146.0 - 50, y = 16450.0 },
                  --正下
                  { x = 4146.0 - 30, y = 16450.0 - 30 },
                  --左下
                  { x = 4146.0, y = 16450.0 - 50 },
                  { x = 4234.0, y = 16442.0 - 50 },
                  { x = 4341.0, y = 16442.0 - 50 },
                  { x = 4416.0, y = 16449.0 - 50 },
                  --正左
                  { x = 4416.0 + 50, y = 16449.0 - 50 },
              }
            },
            { name = '阴沉峭壁-暗影圣疗院入口九',
              area = {
                  --左上
                  { x = 5798.0 + 10, y = 17267.0 },
                  { x = 5798.0 + 10, y = 17543.0 },
                  --正上
                  { x = 5798.0 + 10, y = 17543.0 + 10 },
                  --右上
                  { x = 5798.0, y = 17543.0 + 50 },
                  { x = 5550.0, y = 17543.0 + 50 }, --false
                  --{ x = 5641.822265625, y = 17519.0+10 },
                  { x = 5287.2866210938, y = 17479.0 + 10 },
                  { x = 4934.0, y = 17543.0 + 10 },
                  { x = 4706.0, y = 17543.0 + 10 },
                  --正右
                  { x = 4706.0 - 10, y = 17543.0 + 10 },
                  --右下

                  { x = 4706.0 - 20, y = 17543.0 },
                  { x = 4706.0 - 20, y = 17267.0 },
                  --正下
                  { x = 4706.0 - 10, y = 17267.0 - 10 },
                  --左下
                  { x = 4706.0, y = 17267.0 - 10 },
                  { x = 4937.0, y = 17267.0 - 10 },
                  { x = 5551.0, y = 17267.0 - 10 },
                  { x = 5798.0, y = 17267.0 - 10 },
                  --正左
                  { x = 5798.0 + 10, y = 17267.0 - 10 },


              }
            },
            { name = '阴沉峭壁-暗影圣疗院',
              area = {
                  --左上
                  { x = 11702.0 + 50, y = 19538.0 },
                  { x = 11702.0 + 50, y = 19751.0 },
                  { x = 11414.0 + 50, y = 19930.0 },
                  { x = 9575.0 + 50, y = 20681.0 },
                  --正上
                  { x = 9575.0 + 50, y = 20678.0 + 50 },
                  --右上
                  { x = 9575.2724609375, y = 20678.0 + 50 },
                  --左上
                  { x = 5465.0 + 50, y = 22269.0 },
                  --正上
                  { x = 5465.0 + 50, y = 22269.0 + 50 },
                  { x = 5278.0 + 50, y = 22319.0 + 50 },
                  --正右
                  { x = 5315.0 - 50, y = 22314.0 + 50 },
                  { x = 5261.0 - 50, y = 22300.0 + 50 },
                  { x = 5212.0 - 50, y = 22246.0 + 50 },
                  { x = 5110.0 - 50, y = 22139.0 + 50 },
                  { x = 4984.0 - 50, y = 22204.0 + 50 },
                  { x = 4756.0 - 50, y = 21955.0 + 50 },
                  --正下
                  { x = 4766.0 - 50, y = 21944.0 - 50 },
                  { x = 4786.0 - 50, y = 21852.0 - 50 },
                  { x = 4898.0 - 50, y = 21712.0 - 50 },
                  { x = 5995.0 - 50, y = 20483.0 - 50 },
                  --正右
                  { x = 6075.0 - 50, y = 18823.0 + 50 },
                  --右下
                  { x = 6075.0 - 50, y = 18823.0 },
                  { x = 6078.0 - 50, y = 18236.0 },
                  { x = 6018.0 - 50, y = 17863.0 },
                  { x = 6018.0 - 50, y = 17750.0 },
                  --正下
                  { x = 6018.0 - 50, y = 17750.0 - 50 },
                  --左下
                  { x = 6018.0, y = 17750.0 - 50 },
                  { x = 6327.0, y = 17763.0 - 50 },
                  { x = 6839.0, y = 17765.0 - 50 },
                  { x = 8514.0, y = 18339.0 - 50 },
                  { x = 9446.0, y = 18339.0 - 50 },
                  --正左
                  { x = 9446.0 + 50, y = 18339.0 - 50 },
                  { x = 11414.0 + 50, y = 19372.0 - 50 },
                  { x = 11702.0 + 50, y = 19540.0 - 50 },

              }
            },
            { name = '阴沉峭壁-圣疗外围一',
              area = {
                  --正上
                  { x = 5229.0 + 10, y = 22542.0 + 10 },
                  { x = 5134.0 + 10, y = 22813.0 + 10 },
                  { x = 4874.0 + 50, y = 23120.0 + 50 }, --false
                  { x = 4565.0 + 10, y = 23372.0 + 10 },
                  --正右
                  { x = 4444.0 - 10, y = 23344.0 + 10 },
                  { x = 4075.0 - 10, y = 22976.0 + 10 },
                  { x = 4010.0 - 10, y = 22605.0 + 10 },
                  --正下
                  { x = 4010.0 - 10, y = 22605.0 - 10 },
                  { x = 4335.0 - 10, y = 22287.0 - 10 },
                  --正左
                  { x = 4737.0 + 10, y = 22271.0 - 10 },
                  { x = 4846.0 + 10, y = 22269.0 - 10 },
                  { x = 5069.0 + 10, y = 22265.0 - 10 },
                  { x = 5162.0 + 10, y = 22332.0 - 10 },
                  { x = 5231.0 + 10, y = 22536.0 - 10 },

              }
            },
            { name = '阴沉峭壁-圣疗外围二',
              area = {
                  --正上
                  { x = 6168.0 + 10, y = 25510.0 + 10 },
                  --右上
                  { x = 6168.9990234375, y = 25510.0 + 10 },
                  { x = 5693.0, y = 25511.0 + 10 },
                  --正右
                  { x = 5693.0 - 10, y = 25511.0 + 10 },
                  --右下
                  { x = 5693.0 - 10, y = 25511.0 },
                  { x = 5630.0 - 10, y = 24088.0 },
                  { x = 5579.0 - 10, y = 23916.0 },
                  --正下
                  { x = 5579.0 - 10, y = 23916.0 - 10 },
                  { x = 5661.0 - 10, y = 23833.0 - 10 },
                  { x = 6156.0 - 10, y = 23812.0 - 10 },
                  --正左
                  { x = 6156.0 + 10, y = 23812.0 - 10 },
                  --左上
                  { x = 6156.0 + 10, y = 23812.0 },
                  { x = 6157.0 + 10, y = 24037.80078125 },
                  { x = 6214.0 + 10, y = 24249.0 },
                  { x = 6239.0 + 10, y = 24584.859375 },
                  { x = 6326.0 + 10, y = 24755.0 },
                  { x = 6326.0 + 10, y = 25082.0 },
                  { x = 6262.0 + 10, y = 25159.0 },
                  { x = 6213.0 + 10, y = 25286.0 },
                  { x = 6226.0 + 10, y = 25408.177734375 },
                  { x = 6169.0 + 10, y = 25511.0 },


              }
            },
            { name = '阴沉峭壁-圣疗外围三',
              area = {
                  --正上
                  { x = 7219.0 + 100, y = 25671.0 + 100 },
                  --右上
                  { x = 7219.0, y = 25671.0 + 100 },
                  { x = 6866.0, y = 25671.0 + 100 },
                  --正右
                  { x = 6866.0 - 100, y = 25671.0 + 100 },
                  --右下
                  { x = 6866.0 - 100, y = 25671.0 },
                  { x = 6866.0 - 100, y = 25450.314453125 },
                  --右上
                  { x = 6591.0, y = 25415.0 + 20 },
                  { x = 6534.0, y = 25465.0 + 20 },
                  { x = 6270.0, y = 25464.0 + 20 },
                  --正右
                  { x = 6270.0 - 20, y = 25464.0 + 20 },
                  --右下
                  { x = 6270.0 - 20, y = 25464.0 },
                  { x = 6279.0 - 20, y = 25411.0 },
                  { x = 6290.0 - 20, y = 25265.0 },
                  { x = 6254.0 - 20, y = 25219.0 },
                  --正下
                  { x = 6254.0 - 20, y = 25219.0 - 20 },
                  --左下
                  { x = 6254.0, y = 25219.0 - 20 },
                  { x = 6482.0, y = 25219.0 - 20 },
                  { x = 6766.0, y = 25265.0 - 20 },
                  --右下
                  { x = 6870.0 - 20, y = 25095.0 },
                  { x = 6866.0 - 20, y = 24605.0 },
                  --右上
                  { x = 6680.0, y = 24390.0 + 20 },
                  { x = 6486.0, y = 24452.0 + 20 },
                  { x = 6270.0, y = 24440.0 + 20 },
                  --正右
                  { x = 6270.0 - 20, y = 24440.0 + 20 },
                  --右下
                  { x = 6270.0 - 20, y = 24440.0 },
                  { x = 6279.0 - 20, y = 24391.0 },
                  { x = 6290.0 - 20, y = 24248.0 },
                  { x = 6254.0 - 20, y = 24195.0 },
                  --正下
                  { x = 6254.0 - 20, y = 24195.0 - 20 },
                  --左下
                  { x = 6254.0, y = 24195.0 - 20 },
                  { x = 6493.0, y = 24195.0 - 20 },
                  { x = 6669.0, y = 24235.0 - 20 },
                  --右下
                  { x = 6866.0 - 100, y = 23827.0 },
                  --正下
                  { x = 6866.0 - 100, y = 23827.0 - 100 },
                  --左下
                  { x = 6866.0, y = 23827.0 - 100 },
                  { x = 7497.4360351562, y = 23717.0 - 100 },
                  { x = 9443.607421875, y = 23539.0 - 100 },
                  --正左
                  { x = 9429.0 + 100, y = 23553.0 - 100 },
                  --左上
                  { x = 9441.0 + 100, y = 23557.93359375 },
                  { x = 9638.0 + 100, y = 23827.0 },
                  { x = 9638.0 + 100, y = 24023.0 },
                  { x = 9443.0 + 100, y = 24649.08984375 },
                  --正上
                  { x = 9443.0 + 100, y = 24649.0 + 100 },
                  --右上
                  { x = 9446.060546875, y = 24646.0 + 100 },
                  { x = 9369.0, y = 24652.0 + 100 },
                  { x = 9253.2001953125, y = 24656.0 + 100 },
                  { x = 9169.0, y = 24661.0 + 100 },
                  --左上
                  { x = 7216.0 + 100, y = 24521.060546875 },
                  { x = 7219.0 + 100, y = 25671.0 },
              }
            },
            { name = '阴沉峭壁-圣疗外围四',
              area = {
                  --右上
                  { x = 9590.0, y = 27223.0 + 100 },
                  { x = 9154.0, y = 27223.0 + 100 },
                  --正右
                  { x = 9154.0 - 100, y = 27223.0 + 100 },
                  --右下
                  { x = 9154.0 - 100, y = 27223.0 },
                  { x = 9154.0 - 100, y = 25763.0 },
                  --正下
                  { x = 9154.0 - 100, y = 25763.0 - 100 },
                  --左下
                  { x = 9154.0, y = 25763.0 - 100 },
                  { x = 9457.0, y = 25763.0 - 100 },
                  --正左
                  { x = 9457.0 + 100, y = 25763.0 - 100 },
                  --左上
                  { x = 9457.0 + 100, y = 25763.0 },
                  { x = 9622.0 + 100, y = 27074.0 },
                  { x = 9590.0 + 100, y = 27223.0 },
                  --正上
                  { x = 9590.0 + 100, y = 27223.0 + 100 },

              }
            },
            { name = '阴沉峭壁-圣疗外围',
              area =  {
                  --左上
                  { x = 9382.0 + 100, y = 27539.0 },
                  { x = 9378.0 + 100, y = 28055.0 },
                  --左下
                  { x = 10173.0, y = 28595.0 - 100 },
                  { x = 11346.0, y = 28623.0 - 100 },
                  { x = 12434.0, y = 28092.0 - 100 },
                  { x = 12981.0, y = 28099.0 - 100 },
                  { x = 14200.0, y = 27398.0 - 100 },
                  { x = 16203.0, y = 28147.0 - 100 },
                  { x = 18246.0, y = 28076.0 - 100 },
                  --正左
                  { x = 18246.0 + 100, y = 28076.0 - 100 },
                  --左上
                  { x = 18246.0 + 50, y = 28076.0 },
                  { x = 18260.0 + 50, y = 28599.0 },
                  { x = 18214.0 + 50, y = 28675.0 },
                  { x = 18246.0 + 50, y = 29128.0 },
                  --左下
                  { x = 19759.0, y = 29366.0 - 100 },
                  { x = 19847.0, y = 29411.0 - 100 },
                  --正左
                  { x = 19847.0 + 100, y = 29411.0 - 100 },
                  --左上
                  { x = 19847.0 + 100, y = 29411.0 },
                  { x = 19859.0 + 100, y = 29793.0 },
                  { x = 19750.0 + 100, y = 30231.0 },
                  { x = 19590.0 + 100, y = 30576.0 },
                  --右下
                  { x = 20290.0 - 100, y = 30743.0 },
                  { x = 20290.0 - 100, y = 30259.0 },
                  --正下
                  { x = 20290.0 - 100, y = 30259.0 - 100 },
                  --左下.
                  { x = 20290.0, y = 30259.0 - 100 },
                  --右下
                  { x = 20687.0 - 100, y = 30167.13671875 },
                  { x = 20679.0 - 100, y = 29603.0 },
                  { x = 20689.0 - 100, y = 29287.0 },
                  { x = 20689.0 - 100, y = 29027.0 },
                  { x = 20821.0 - 100, y = 28594.0 },
                  { x = 20906.0 - 100, y = 28428.0 },
                  --正下
                  { x = 20906.0 - 100, y = 28428.0 - 100 },
                  { x = 21287.0 - 100, y = 27937.0 - 100 },
                  --正右
                  { x = 21521.0 - 100, y = 26901.0 + 100 },
                  --右下
                  { x = 21521.0 - 100, y = 26901.0 },
                  { x = 21444.0 - 100, y = 26794.49609375 },
                  { x = 21442.0 - 100, y = 26176.0 },
                  --正下
                  { x = 21442.0 - 100, y = 26176.0 - 100 },
                  --左下
                  { x = 21442.0, y = 26176.0 - 100 },
                  { x = 21993.0, y = 26133.0 - 100 },
                  { x = 23343.0, y = 26087.0 - 100 },
                  --正左
                  { x = 23343.0 + 100, y = 26087.0 - 100 },
                  { x = 23456.0 + 100, y = 26201.0 - 100 },
                  --左上
                  { x = 23456.0 + 50, y = 26201.0 },
                  { x = 23474.0 + 50, y = 26396.0 },
                  { x = 23468.0 + 50, y = 26647.0 },
                  { x = 23463.0 + 50, y = 26895.0 },
                  --正左
                  { x = 23528.0 + 100, y = 26995.0 - 100 },
                  { x = 23873.0 + 100, y = 27327.0 - 100 },
                  --左上
                  { x = 23873.0 + 100, y = 27327.0 },
                  { x = 23846.0 + 100, y = 27562.0 },
                  --正上
                  { x = 23846.0 + 100, y = 27562.0 + 100 },

                  --左上
                  { x = 23271.0 + 50, y = 28956.0 },
                  { x = 23049.0 + 50, y = 30035.0 },
                  { x = 23043.0 + 50, y = 30263.0 },
                  { x = 22854.0 + 50, y = 31527.0 },
                  { x = 22800.0 + 50, y = 31575.0 },
                  --正上
                  { x = 22760.0 + 100, y = 31701.0 + 100 },
                  --右上
                  { x = 22755.7890625, y = 31783.0 + 100 },
                  --正上
                  { x = 19174.0 + 100, y = 33191.0 + 100 },
                  { x = 17351.0 + 100, y = 34247.0 + 100 },
                  --右上
                  { x = 17351.0, y = 34247.0 + 100 },
                  { x = 16402.0, y = 34199.0 + 100 },
                  { x = 16006.0, y = 34247.0 + 100 },
                  { x = 15425.0, y = 34247.0 + 100 },
                  { x = 14614.0, y = 34247.0 + 100 },
                  { x = 14034.0, y = 34247.0 + 100 },
                  { x = 13167.0, y = 34143.0 + 100 },
                  --正右
                  { x = 13167.0 - 100, y = 34143.0 + 100 },
                  { x = 12861.0 - 100, y = 33943.0 + 100 },
                  --右下
                  { x = 12861.0 - 100, y = 33943.0 },
                  { x = 12751.0 - 100, y = 33732.76171875 },
                  { x = 12759.0 - 100, y = 33406.3828125 },
                  { x = 12322.0 - 100, y = 32858.0 },

                  --正上
                  { x = 9400.0 + 100, y = 29010.0 + 100 },
                  --右上
                  { x = 9400.0, y = 29010.0 + 100 },
                  { x = 9158.0, y = 28998.0 + 100 },
                  --正右
                  { x = 9158.0 - 100, y = 28998.0 + 100 },
                  { x = 8993.0 - 100, y = 28819.0 + 100 },
                  --右下
                  { x = 8993.0 - 100, y = 28819.916015625 },
                  { x = 8981.0 - 100, y = 28567.0 },
                  { x = 9177.0 - 100, y = 27539.0 },
                  --正下
                  { x = 9177.0 - 100, y = 27539.0 - 100 },
                  --左下
                  { x = 9177.0, y = 27539.0 - 100 },
                  { x = 9382.0, y = 27539.0 - 100 },
                  --正左
                  { x = 9382.0 + 100, y = 27539.0 - 100 },
              },
                --圣疗外围 z坐标0
              min_cz = 0,
              overlap = {
                  ['阴沉峭壁-圣疗外围内三'] = 1280,
              },
            },
            { name = '阴沉峭壁-圣疗外围内一',
              area = {
                  --正上
                  { x = 18822.0 + 10, y = 28551.0 + 10 }, --false
                  --右上
                  { x = 18822.0, y = 28551.0 + 10 },
                  { x = 18551.0, y = 28660.0 + 10 }, --false
                  { x = 18397.0, y = 28663.0 + 10 },
                  --正右
                  { x = 18397.0 - 10, y = 28663.0 + 10 },
                  --右下
                  { x = 18397.0 - 10, y = 28663.0 },
                  { x = 18338.0 - 10, y = 28615.0 }, --false
                  { x = 18338.0 - 10, y = 28451.0 }, --false
                  { x = 18400.0 - 10, y = 28339.0 },
                  --正下
                  { x = 18400.0 - 10, y = 28339.0 - 10 },
                  { x = 18642.0 - 10, y = 28208.0 - 10 }, --true
                  --左下
                  { x = 18642.0, y = 28208.0 - 10 },
                  { x = 18790.0, y = 28198.0 - 10 }, --true
                  --正左
                  { x = 18790.0 + 10, y = 28198.0 - 10 },
                  --左上
                  { x = 18790.0 + 10, y = 28198.0 },
                  { x = 18822.0 + 10, y = 28233.0 }, --false
                  { x = 18822.0 + 10, y = 28551.0 },
              }
            },
            { name = '阴沉峭壁-圣疗外围内二',
              area = {
                  --右上
                  { x = 20435.0, y = 29799.0 + 100 },
                  { x = 20066.0, y = 29799.0 + 100 },
                  --正右
                  { x = 20066.0 - 100, y = 29799.0 + 100 },
                  --右下
                  { x = 20066.0 - 100, y = 29799.0 },
                  { x = 20036.0 - 100, y = 29462.560546875 },
                  { x = 20001.0 - 100, y = 29143.0 },
                  { x = 19980.0 - 100, y = 28777.892578125 },
                  { x = 19953.0 - 100, y = 28382.0 },
                  { x = 19931.0 - 100, y = 28065.0 },
                  { x = 19890.0 - 100, y = 27619.0 },
                  --正下
                  { x = 19890.0 - 100, y = 27619.0 - 100 },
                  --左下
                  { x = 19890.0, y = 27619.0 - 100 },
                  { x = 20134.0, y = 27619.0 - 100 },
                  --正左
                  { x = 20134.0 + 100, y = 27619.0 - 100 },
                  { x = 20440.0 + 100, y = 27938.0 - 100 },
                  --左上
                  { x = 20440.0 + 50, y = 27938.0 },
                  { x = 20438.0 + 50, y = 28345.974609375 },
                  { x = 20450.0 + 50, y = 28535.0 },
                  { x = 20361.0 + 50, y = 29092.37109375 },
                  { x = 20421.0 + 50, y = 29539.0 },
                  { x = 20435.0 + 50, y = 29799.0 },
                  --正上
                  { x = 20435.0 + 50, y = 29799.0 + 50 },


              }
            },
            { name = '阴沉峭壁-圣疗外围内三',
              area = {
                  --正上
                  { x = 14119.0 + 50, y = 30932.0 + 50 },
                  --右上
                  { x = 14119.0, y = 30932.0 + 50 },
                  { x = 13666.0, y = 30935.0 + 50 },
                  --正右
                  { x = 13666.0 - 50, y = 30935.0 + 50 },
                  --右下
                  { x = 13666.0 - 50, y = 30935.0 },
                  { x = 13666.0 - 50, y = 30787.0 },
                  { x = 13697.0 - 50, y = 30551.0 },
                  --正下
                  { x = 13697.0 - 50, y = 30551.0 - 50 },
                  --左下
                  { x = 13697.0, y = 30551.0 - 50 },
                  { x = 13922.0, y = 30531.0 - 50 },
                  { x = 14162.0, y = 30544.0 - 50 },
                  { x = 14342.0, y = 30627.0 - 50 },
                  --正左
                  { x = 14342.0 + 50, y = 30627.0 - 50 },
                  --左上
                  { x = 14342.0 + 50, y = 30627.0 },
                  { x = 14339.0 + 50, y = 30680.0 },
                  { x = 14116.0 + 50, y = 30935.0 },


              },
              min_cz = 1280,
            },
            { name = '阴沉峭壁-圣疗城郭',
              area = {
                  --正上
                  { x = 27347.0 + 100, y = 26679.0 + 100 },
                  --右上
                  { x = 27347.80859375, y = 26679.0 + 100 },
                  { x = 27002.91796875, y = 26814.0 + 100 },
                  { x = 24441.4921875, y = 27236.0 + 100 },
                  { x = 24305.0, y = 27239.0 + 100 },
                  --正右
                  { x = 24043.0 - 50, y = 27035.0 + 50 },
                  { x = 23554.0 - 50, y = 26832.0 + 50 },
                  --右下
                  { x = 23554.0 - 30, y = 26832.0 },
                  { x = 23554.0 - 30, y = 26684.0 },
                  { x = 23554.0 - 30, y = 26552.0 },
                  { x = 23554.0 - 30, y = 26291.0 },
                  --正下
                  { x = 23554.0 - 50, y = 26291.0 - 50 },
                  { x = 23873.0 - 50, y = 26078.0 - 50 },
                  { x = 24080.0 - 50, y = 25767.0 - 50 },
                  --左下
                  { x = 24080.0, y = 25767.0 - 10 },
                  --正下
                  { x = 24245.0 - 10, y = 25777.0 - 10 },
                  --右下
                  { x = 24269.0 - 10, y = 25677.0 },
                  { x = 24279.0 - 10, y = 25443.0 },
                  --正下
                  { x = 24279.0 - 10, y = 25443.0 - 10 },
                  --左下
                  { x = 24279.0, y = 25443.0 - 10 },
                  { x = 24417.0, y = 25443.0 - 10 },
                  --正左
                  { x = 24417.0 + 10, y = 25443.0 - 10 },
                  --左上
                  { x = 24417.0 + 10, y = 25443.0 },
                  --正左
                  { x = 24448.0 + 10, y = 25779.0 - 10 },
                  --左下
                  { x = 24498.0, y = 25777.0 - 10 },
                  { x = 24573.0, y = 25771.0 - 10 },
                  --正左
                  { x = 24621.0 + 10, y = 25768.0 - 10 },
                  { x = 24591.0 + 10, y = 26052.0 - 10 },
                  { x = 25122.0 + 10, y = 26304.0 - 10 },
                  --左下
                  { x = 25122.0, y = 26304.0 - 10 },
                  { x = 25350.0, y = 26269.0 - 10 },
                  { x = 25505.0, y = 26291.0 - 10 },
                  { x = 26063.0, y = 26291.0 - 100 },
                  { x = 27270.0, y = 26351.0 - 100 },
                  --正左
                  { x = 27270.0 + 100, y = 26351.0 - 100 },
                  --左上
                  { x = 27270.0 + 100, y = 26351.5546875 },
                  { x = 27347.0 + 100, y = 26679.0 + 100 },
              }
            },
            { name = '阴沉峭壁-圣疗城郭一',
              area = {
                  --正上
                  { x = 25354.0 + 10, y = 26055.0 + 10 },
                  { x = 25357.0 + 10, y = 26199.0 + 10 },
                  --右上
                  { x = 25298.0, y = 26199.0 + 10 },
                  --正右
                  { x = 25298.0 - 10, y = 26199.0 + 10 },
                  { x = 25131.0 - 10, y = 26081.0 + 10 },
                  { x = 24817.0 - 10, y = 25771.0 + 10 },
                  { x = 24724.0 - 10, y = 25672.0 + 10 },
                  --右上
                  { x = 24724.0, y = 25672.0 + 10 },
                  { x = 24544.0, y = 25684.0 + 10 },
                  --正右
                  { x = 24544.0 - 10, y = 25684.0 + 10 },
                  --右下
                  { x = 24558.0 - 10, y = 25683.0 },
                  { x = 24538.0 - 10, y = 25628.0 }, --false
                  { x = 24570.0 - 10, y = 25493.927734375 },
                  { x = 24594.0 - 10, y = 25367.3984375 },
                  --右上
                  { x = 24406.0, y = 25298.0 + 10 },
                  { x = 24299.0, y = 25289.0 + 10 },
                  --左上
                  { x = 24102.0 + 10, y = 25423.474609375 },
                  { x = 24112.0 + 10, y = 25677.212890625 },
                  --正上
                  { x = 24112.0 + 10, y = 25677.0 + 10 },
                  --右上
                  { x = 24112.0, y = 25677.0 + 10 },
                  { x = 23966.0, y = 25682.0 + 10 },
                  --正右
                  { x = 23966.0 - 10, y = 25682.0 + 10 },
                  { x = 23841.0 - 10, y = 25570.0 + 10 },
                  ---右下
                  { x = 23841.0 - 100, y = 25570.0 },
                  { x = 23952.0 - 100, y = 25036.0 },
                  { x = 23462.0 - 100, y = 23309.0 },
                  { x = 23474.0 - 100, y = 22097.0 },
                  { x = 23296.0 - 100, y = 19079.0 },
                  { x = 23268.0 - 100, y = 18223.0 },
                  ---正下
                  { x = 23268.0 - 100, y = 18223.0 - 100 },
                  { x = 23911.0 - 100, y = 17599.0 - 100 },
                  ---左下
                  { x = 23911.0, y = 17599.0 - 100 },
                  { x = 24439.0, y = 17587.0 - 100 },
                  --正左
                  { x = 24439.0 + 10, y = 17587.0 - 10 },
                  --左上
                  { x = 24439.0 + 10, y = 17587.0 },
                  { x = 24543.0 + 10, y = 17759.228515625 },
                  --正上
                  { x = 24548.0 + 10, y = 17780.0 + 10 }, --false
                  --{ x = 24543.0+10, y = 17759.0+10 },
                  --右上
                  { x = 24548.0, y = 17780.0 + 10 },
                  { x = 23986.0, y = 17767.0 + 10 },
                  --正上
                  { x = 23986.0 + 10, y = 17767.0 + 10 },
                  { x = 23552.0 + 10, y = 18215.0 + 10 },
                  --左上
                  { x = 23471.0 + 10, y = 18336.8984375 },
                  { x = 23478.0 + 10, y = 18654.994140625 }, --false
                  { x = 23463.0 + 10, y = 18983.0 },
                  --正左
                  { x = 23541.0 + 10, y = 19091.0 - 10 },
                  { x = 24104.0 + 10, y = 19651.0 - 10 },
                  --左上
                  { x = 24104.0 + 10, y = 19651.0 },
                  ---左上
                  { x = 24790.0 + 10, y = 20464.0 },
                  { x = 25278.0 + 10, y = 21889.27734375 },
                  { x = 25284.0 + 10, y = 23303.0 },
                  { x = 25350.0 + 10, y = 26038.0546875 },
                  --正左
                  { x = 25350.0 + 10, y = 26038.0 - 10 },
              }
            },
            { name = '阴沉峭壁-圣疗城郭二',
              area = {
                  --正上
                  { x = 28395.0 + 10, y = 19127.0 + 10 },
                  { x = 28185.0 + 10, y = 19367.0 + 10 },
                  --右上
                  { x = 28185.0, y = 19367.0 + 10 },
                  { x = 27634.0, y = 19353.0 + 10 },
                  { x = 24632.0, y = 19443.0 + 10 },
                  --正上
                  { x = 24629.0 + 10, y = 19442.0 + 10 },
                  --右上
                  { x = 24629.0, y = 19442.0 + 10 },
                  { x = 24504.0, y = 19433.0 + 10 },
                  --左上
                  { x = 24419.0 + 10, y = 19469.0 },
                  { x = 24407.0 + 10, y = 19627.0 },
                  { x = 24418.0 + 10, y = 19767.0 },
                  --正上
                  { x = 24418.0 + 10, y = 19767.0 + 10 },
                  --右上
                  { x = 24418.0, y = 19767.0 + 10 },
                  { x = 24289.0, y = 19767.0 + 10 },
                  --正右
                  { x = 24289.0 - 10, y = 19767.0 + 10 },
                  --右下
                  { x = 24289.0 - 10, y = 19767.0 },
                  { x = 24279.0 - 10, y = 19485.0 },
                  --右上
                  { x = 24185.0, y = 19434.0 + 10 },
                  { x = 24082.0, y = 19443.0 + 10 },
                  --正右
                  { x = 24082.0 - 10, y = 19443.0 + 10 },
                  { x = 24064.0 - 10, y = 19316.0 + 10 },
                  { x = 23958.0 - 10, y = 19210.0 + 10 },
                  { x = 23554.0 - 10, y = 18929.0 + 10 },
                  --右下
                  { x = 23554.0 - 10, y = 18929.0 },
                  { x = 23554.0 - 10, y = 18665.0 },
                  { x = 23554.0 - 10, y = 18387.0 },
                  --正下
                  { x = 23554.0 - 10, y = 18387.0 - 10 },
                  { x = 23964.0 - 10, y = 18074.0 - 10 },
                  --左下
                  { x = 23964.0, y = 18074.0 - 10 },
                  { x = 24287.0, y = 17971.0 - 10 },
                  { x = 24609.0, y = 17971.0 - 10 },
                  --正左
                  { x = 24609.0 + 10, y = 17971.0 - 10 },
                  { x = 25069.0 + 10, y = 18403.0 - 10 },
                  --左下
                  { x = 25069.0, y = 18403.0 - 10 },
                  { x = 25634.0, y = 18387.0 - 10 },
                  { x = 27129.0, y = 18387.0 - 10 },
                  --正下
                  { x = 27214.0 - 10, y = 18231.0 - 10 },
                  { x = 27476.0 - 10, y = 17965.0 - 10 },

                  --左下
                  { x = 27634.0, y = 17863.0 - 10 },
                  { x = 27751.0, y = 17873.0 - 10 },
                  --右下
                  { x = 27826.0 - 10, y = 17801.0 },
                  { x = 27831.0 - 10, y = 17539.0 },
                  --正下
                  { x = 27831.0 - 10, y = 17539.0 - 10 },
                  --左下
                  { x = 27831.0, y = 17539.0 - 10 },
                  { x = 27969.0, y = 17539.0 - 10 },
                  --正左
                  { x = 27969.0 + 10, y = 17539.0 - 10 },
                  --左上
                  { x = 27969.0 + 10, y = 17539.0 },
                  { x = 27965.0 + 10, y = 17769.38671875 },
                  --左下
                  { x = 28073.0, y = 17871.0 - 10 },
                  { x = 28172.0, y = 17864.0 - 10 },
                  --正左
                  { x = 28172.0 + 10, y = 17864.0 - 10 },
                  { x = 28567.0 + 10, y = 18359.0 - 10 },
                  --左上
                  { x = 28567.0 + 10, y = 18359.0 },
                  { x = 28396.0 + 10, y = 19133.76171875 },

              }
            },
            { name = '阴沉峭壁-圣疗城郭三',
              area = {
                  --正上
                  { x = 28294.0 + 10, y = 17585.0 + 10 },

                  { x = 28272.0 + 10, y = 17726.0 + 10 }, --false
                  { x = 28230.0 + 10, y = 17768.0 + 10 },
                  --右上
                  { x = 28230.0, y = 17768.0 + 10 },
                  { x = 28160.0, y = 17777.0 + 10 },
                  --正右
                  { x = 28160.0 - 10, y = 17777.0 + 10 },
                  --右下
                  { x = 28160.0 - 10, y = 17777.0 },
                  { x = 28162.0 - 10, y = 17538.0 },
                  --右上
                  { x = 28022.0, y = 17460.0 + 10 },
                  { x = 27795.0, y = 17463.0 + 10 },
                  --左上
                  { x = 27702.0 + 10, y = 17587.0 },
                  { x = 27702.0 + 10, y = 17779.0 },
                  --正上
                  { x = 27702.0 + 10, y = 17779.0 + 10 },
                  --右上
                  { x = 27702.0, y = 17779.0 + 10 },
                  { x = 27553.0, y = 17768.0 + 10 },
                  --正上
                  { x = 27504.0 + 10, y = 17772.0 + 10 },
                  { x = 27470.0 + 10, y = 17847.0 + 10 },
                  { x = 27289.0 + 10, y = 18035.0 + 10 },
                  { x = 27139.0 + 10, y = 18183.0 + 10 },
                  --右上
                  { x = 27139.0, y = 18183.0 + 10 },
                  { x = 26939.0, y = 18187.0 + 10 },
                  --正右
                  { x = 26939.0 - 10, y = 18187.0 + 10 },
                  --正下
                  { x = 26946.0 - 10, y = 18136.0 - 10 },
                  { x = 27468.0 - 10, y = 17623.0 - 10 },
                  ---右下
                  { x = 27492.0 - 100, y = 17204.904296875 },
                  { x = 26982.0 - 100, y = 15388.733398438 },
                  { x = 26994.0 - 100, y = 14236.0 },
                  { x = 27519.0 - 100, y = 13015.0 },
                  --正下
                  { x = 27519.0 - 10, y = 13015.0 - 10 },
                  ---左下
                  { x = 27519.0, y = 13015.0 - 100 },
                  { x = 27844.0, y = 12687.0 - 100 },
                  { x = 28290.0, y = 13008.0 - 100 },
                  --正左
                  { x = 28290.0 + 10, y = 13008.0 - 10 },
                  --左上
                  { x = 28290.0 + 10, y = 13008.0 },
                  { x = 28342.0 + 10, y = 13134.0 },
                  { x = 28342.0 + 10, y = 13271.0 },
                  { x = 28294.0 + 10, y = 13611.991210938 },
                  --左下

                  { x = 28434.0, y = 13715.0 - 10 },
                  { x = 28555.69140625, y = 13717.0 - 10 },
                  --正左
                  { x = 28555.0 + 10, y = 13717.0 - 10 },
                  { x = 28758.0 + 10, y = 13897.0 - 10 },
                  --左上
                  { x = 28758.0 + 10, y = 13897.0 },
                  { x = 28804.0 + 10, y = 14115.0 },
                  { x = 28791.0 + 10, y = 14433.0 },
                  --左下
                  { x = 29046.0, y = 14568.0 - 10 },
                  { x = 29228.62109375, y = 14570.0 - 10 },
                  { x = 29605.076171875, y = 14453.0 - 10 },
                  { x = 30071.142578125, y = 14433.0 - 100 },
                  ---正左
                  { x = 30071.0 + 100, y = 14433.0 - 100 },
                  { x = 30380.0 + 100, y = 14788.0 - 100 },
                  --正上
                  { x = 30380.0 + 10, y = 14788.0 + 10 },
                  { x = 30136.0 + 10, y = 14892.0 + 10 },
                  --左上
                  { x = 28294.0 + 10, y = 17585.0 },
              }
            },
            { name = '阴沉峭壁-圣疗城郭四',
              area = {
                  --正上
                  { x = 29670.0 + 50, y = 13178.0 + 50 },
                  { x = 29315.0 + 50, y = 13688.0 + 50 },
                  { x = 29157.0 + 50, y = 13847.0 + 50 },
                  --右上
                  { x = 29157.0, y = 13847.0 + 50 },
                  { x = 29033.0, y = 13859.0 + 50 },
                  --正右
                  { x = 29033.0 - 50, y = 13859.0 + 50 },
                  { x = 28950.0 - 50, y = 13676.0 + 50 },
                  { x = 28711.0 - 50, y = 13483.0 + 50 },
                  --右下
                  { x = 28711.0 - 50, y = 13483.0 },
                  --正下
                  { x = 28711.0 - 50, y = 13483.0 - 50 },
                  { x = 28890.0 - 50, y = 13250.0 - 50 },
                  { x = 29074.0 - 50, y = 12996.0 - 50 },
                  --右下
                  { x = 29506.0 - 50, y = 12678.0 },
                  { x = 29506.0 - 50, y = 12419.0 },
                  { x = 29509.0 - 50, y = 12141.0 },
                  { x = 29522.0 - 50, y = 11869.0 },
                  { x = 29508.0 - 50, y = 11595.0 },
                  { x = 29521.0 - 50, y = 10966.0 },
                  --正下
                  { x = 29521.0 - 50, y = 10966.0 - 50 },
                  --左下
                  { x = 29521.0, y = 10966.0 - 50 },
                  { x = 29661.0, y = 10931.0 - 50 },
                  --正左
                  { x = 29661.0 + 50, y = 10931.0 - 50 },
                  --左上
                  { x = 29654.0 + 50, y = 10931.0 },
                  { x = 29680.0 + 50, y = 11237.0 },
                  { x = 29670.0 + 50, y = 11652.0 },
                  { x = 29669.0 + 50, y = 11876.0 },
                  { x = 29669.0 + 50, y = 12159.0 },
                  { x = 29667.0 + 50, y = 13178.0 },
              }
            },
            { name = '阴沉峭壁-圣疗城郭五',
              area = {
                  --左上
                  { x = 29889.0+50, y = 10508.0 },
                  { x = 29891.0+50, y = 10855.0 },
                  { x = 29815.0+50, y = 11100.0 },
                  { x = 29740.0+50, y = 11174.0 },
                  --正右
                  { x = 29740.0-50, y = 11174.0+50 },
                  --右下
                  { x = 29737.0-10, y = 11173.0 },
                  { x = 29723.0-10, y = 11019.0 },
                  { x = 29723.0-10, y = 10782.392578125 },
                  { x = 29720.0-10, y = 10550.19921875 },
                  { x = 29730.0-10, y = 10323.0 },
                  --正下
                  { x = 29730.0-10, y = 10323.0-10 },
                  --正左
                  { x = 29730.0+50, y = 10323.0-50 },
                  { x = 29886.0+50, y = 10509.0-50 },

              }
            },
            { name = '阴沉峭壁-圣疗城郭六',
              area = {
                  --正上
                  { x = 28639.0+100, y = 11015.0+100 },
                  { x = 28175.0+100, y = 11543.0+100 },
                  { x = 27969.0+100, y = 11847.0+100 },
                  --右上
                  { x = 27969.0, y = 11847.0+100 },
                  { x = 27841.0, y = 11847.0+100 },
                  { x = 26473.0, y = 10998.0+100 },
                  { x = 25389.0, y = 10998.0+100 },
                  { x = 24606.0, y = 11320.0+100 },
                  { x = 24065.0, y = 11429.0+100 },
                  --正右
                  { x = 24066.0-100, y = 11430.0+100 },
                  { x = 23684.0-100, y = 11027.0+100 },
                  ---右下
                  { x = 23684.0-10, y = 11027.038085938 },
                  { x = 23554.0-10, y = 10734.961914062 },
                  { x = 23554.0-10, y = 10659.0 },--false
                  { x = 23673.0-10, y = 10461.0 },
                  ---正下
                  { x = 23673.0-10, y = 10461.0-10 },
                  { x = 23998.0-10, y = 10136.0-10 },
                  --左下
                  { x = 23998.0, y = 10136.0-10 },
                  { x = 24793.0, y = 10248.0-10 },
                  --左下
                  { x = 25422.0, y = 10483.0-10 },
                  { x = 27614.552734375, y = 10083.0-10 },
                  { x = 28176.041015625, y = 10068.0-10 },
                  --正左
                  { x = 28176.0+10, y = 10068.0-10 },
                  { x = 28609.0+10, y = 10499.02-10 },
                  --左上
                  { x = 28675.0+100, y = 10553.0 },
                  { x = 28639.0+100, y = 11015.0 },


              }
            },
        },

        ['无名峡谷'] = {
            { name = '无名峡谷-赛克利亚营地',
              area = {
                  --正上
                  { x = -3532.0 + 100, y = 10055.0 + 100 },
                  { x = -3828.0 + 100, y = 10742.0 + 100 },
                  { x = -5230.0 + 100, y = 11951.0 + 100 },
                  { x = -6019.0 + 100, y = 12476.0 + 100 },
                  { x = -6124.0 + 100, y = 12798.0 + 100 },
                  --右上
                  { x = -6124.3286132812, y = 12798.0 + 100 },
                  { x = -6297.0, y = 12770.0 + 100 },
                  --正右
                  { x = -6393.0 - 50, y = 12641.0 + 50 },
                  { x = -6520.0 - 50, y = 12421.0 + 50 },
                  --右下
                  { x = -6520.0 - 100, y = 12421.733398438 },
                  { x = -6530.0 - 100, y = 12327.0 },
                  { x = -6489.0 - 100, y = 12227.0 },
                  --正下
                  { x = -6283.0 - 100, y = 12085.0 - 100 },

                  { x = -6181.0 - 100, y = 12015.0 - 100 },
                  { x = -5975.0 - 100, y = 11952.0 - 100 },
                  { x = -5856.0 - 100, y = 11879.0 - 100 },
                  --正右
                  { x = -5696.0 - 100, y = 11485.0 + 100 },
                  { x = -5767.0 - 100, y = 11310.0 + 100 },
                  { x = -5811.0 - 100, y = 11256.0 + 100 },
                  { x = -5929.0 - 100, y = 11029.0 + 100 },
                  { x = -6170.0 - 100, y = 10845.0 + 100 },
                  { x = -6264.0 - 100, y = 10602.0 + 100 },

                  --正下
                  { x = -6264.0 - 100, y = 10602.0 - 100 },
                  { x = -5844.0 - 100, y = 10459.0 - 100 },
                  { x = -5071.0 - 100, y = 9915.0 - 100 },
                  --正右
                  { x = -4641.0 - 100, y = 8781.0 + 100 },
                  --右下
                  { x = -4641.0 - 100, y = 8781.0 },
                  { x = -4032.0 - 100, y = 7414.0 },
                  --正上
                  { x = -6672.0 + 100, y = 6942.0 + 100 },
                  --正右
                  { x = -6944.0 - 100, y = 7035.0 + 100 },
                  --正右
                  { x = -7018.0 - 100, y = 6612.0 + 100 },
                  { x = -8891.0 - 100, y = 5188.0 + 100 },
                  { x = -9671.0 - 100, y = 5227.0 + 100 },
                  { x = -10773.0 - 100, y = 4549.0 + 100 },
                  --左上
                  { x = -12267.0 + 100, y = 5974.0 },

                  { x = -12368.0 + 100, y = 6001.3369140625 },
                  { x = -12543.0 + 100, y = 5992.3193359375 },
                  --正上
                  { x = -12882.0 + 100, y = 5901.0 + 100 },
                  --左上
                  { x = -13485.0 + 100, y = 5996.0 },
                  { x = -13508.0 + 100, y = 6154.220703125 },
                  { x = -13533.0 + 100, y = 6219.0 },
                  --正上
                  { x = -13533.0 + 100, y = 6219.0 + 100 },
                  { x = -13554.0 + 100, y = 6274.0 + 100 },
                  --右下
                  { x = -13554.0 - 100, y = 6274.0 },
                  --左上
                  { x = -15355.0 + 100, y = 6470.8403320312 },
                  --右上
                  { x = -15500.0, y = 6433.0 + 100 },
                  { x = -15578.0, y = 6406.0 + 100 },
                  { x = -15658.0, y = 6406.0 + 100 },
                  { x = -15713.736328125, y = 6415.0 + 100 },
                  --正右
                  { x = -15713.0 - 100, y = 6420.0 + 100 },
                  { x = -15829.0 - 100, y = 6296.0 + 100 },
                  { x = -15916.0 - 100, y = 6224.0 + 100 },
                  { x = -16030.0 - 50, y = 6107.0 + 50 },
                  { x = -16064.0 - 50, y = 6064.0 + 50 },
                  --右下
                  { x = -16025.0 - 50, y = 5410.3491210938 },
                  --正上
                  { x = -19474.0 + 100, y = 4208.0 + 100 },
                  { x = -20213.0 + 100, y = 4829.0 + 100 },
                  --右下
                  { x = -20213.0 - 50, y = 4829.0 },
                  { x = -20201.0 - 50, y = 4776.0 },
                  { x = -20217.0 - 50, y = 4674.0 },
                  { x = -20227.0 - 50, y = 4575.0 },
                  { x = -20232.0 - 50, y = 4518.5307617188 },
                  { x = -20249.0 - 50, y = 4407.0 },
                  { x = -20263.0 - 50, y = 4354.0 },
                  { x = -20233.0 - 50, y = 4158.0 },
                  --正右
                  { x = -20280.0 - 50, y = 3988.0 + 50 },
                  --右上
                  { x = -20456.51953125, y = 3977.0 + 50 },
                  { x = -20879.279296875, y = 4190.0 + 50 },
                  { x = -21753.0, y = 4117.0 + 50 },
                  { x = -22951.623046875, y = 5159.0 + 50 },
                  --正上
                  { x = -22951.0 + 100, y = 5159.0 + 100 },
                  { x = -22951.0 + 100, y = 5159.0 + 100 },
                  { x = -23547.0 + 100, y = 5100.0 + 100 },
                  { x = -25047.0 + 100, y = 5039.0 + 100 },
                  { x = -25951.0 + 100, y = 4811.0 + 100 },
                  --正右
                  { x = -25947.0 - 100, y = 4664.0 + 100 },
                  --左下
                  { x = -25947.578125, y = 4664.0 - 100 },
                  { x = -25598.0, y = 4208.0 - 100 },
                  { x = -25028.0, y = 3928.0 - 100 },
                  { x = -24357.0, y = 3826.0 - 100 },
                  { x = -23456.0, y = 3706.0 - 100 },
                  { x = -21627.0, y = 2805.0 - 100 },
                  { x = -21092.0, y = 2824.0 - 100 },
                  { x = -19305.931640625, y = 3024.0 - 100 },
                  { x = -18111.296875, y = 2934.0 - 100 },
                  { x = -15945.0, y = 2154.0 - 100 },

                  { x = -15067.923828125, y = 1954.0 - 100 }, --false

                  { x = -14205.0, y = 2079.0 - 100 },
                  { x = -7720.0, y = 4330.0 - 100 },
                  { x = -6241.0, y = 4871.0 - 100 },
                  { x = -5628.0, y = 4820.0 - 100 }, --false
                  --正左
                  { x = -3549.0 + 100, y = 6013.0 - 100 },
                  { x = -2956.0 + 100, y = 6573.0 - 100 },
                  { x = -2469.0 + 100, y = 7342.0 - 100 },
                  --左上
                  { x = -2469.0 + 100, y = 7342.0 },
                  { x = -2550.0 + 100, y = 7918.3334960938 },
                  { x = -2621.0 + 100, y = 8640.2138671875 },
                  { x = -2675.0 + 100, y = 8808.0 },
                  { x = -3553.0 + 100, y = 10081.0 },

              }
            },
            { name = '无名峡谷-赛克利亚营地右小台阶',
              area = {
                  --正上
                  { x = -6403.0 + 50, y = 12749.0 + 50 },
                  { x = -6511.0 + 50, y = 12832.0 + 50 },
                  --右上
                  --正右
                  { x = -6507.0 - 10, y = 12833.0 + 10 },
                  { x = -6611.0 - 10, y = 12736.0 + 10 },
                  { x = -6683.0 - 10, y = 12712.0 + 10 },
                  { x = -6789.0 - 10, y = 12652.0 + 10 },
                  --右下
                  { x = -6805.0 - 10, y = 12587.0 },
                  { x = -6798.0 - 10, y = 12480.0 },
                  { x = -6793.0 - 10, y = 12382.0 },
                  { x = -6799.0 - 10, y = 12307.0 },
                  { x = -6805.0 - 10, y = 12256.850585938 },
                  { x = -6818.0 - 10, y = 12157.0 },
                  { x = -6827.0 - 10, y = 12082.0 },
                  { x = -6836.0 - 10, y = 12013.0 },
                  { x = -6829.0 - 10, y = 11949.427734375 },
                  --正下
                  { x = -6829.0 - 10, y = 11949.0 - 10 },
                  { x = -6731.0 - 10, y = 11812.0 - 10 },
                  --左下
                  { x = -6731.0, y = 11812.0 - 10 },
                  { x = -6645.0, y = 11781.0 - 10 },
                  { x = -6580.0, y = 11762.0 - 10 },
                  { x = -6495.0, y = 11754.0 - 10 },
                  { x = -6445.0, y = 11780.0 - 10 },
                  --正左
                  { x = -6445.0 + 10, y = 11780.0 - 10 },
                  --正上
                  { x = -6445.0 + 10, y = 11780.0 + 10 },
                  { x = -6464.0 + 10, y = 11938.0 + 10 },
                  { x = -6586.0 + 10, y = 12073.0 + 10 },
                  --左上
                  { x = -6586.0 + 10, y = 12073.0 },
                  { x = -6595.0 + 10, y = 12109.0 },
                  { x = -6623.0 + 10, y = 12231.0 },
                  { x = -6639.0 + 10, y = 12308.0 },
                  { x = -6645.0 + 10, y = 12349.118164062 },
                  { x = -6620.0 + 10, y = 12432.0 },
                  --正左
                  { x = -6607.0 + 10, y = 12486.0 - 10 },
                  { x = -6604.0 + 10, y = 12511.0 - 10 },
                  { x = -6495.0 + 10, y = 12658.0 - 10 },
                  { x = -6468.0 + 10, y = 12724.0 - 10 },
                  --左上
                  { x = -6468.0 + 50, y = 12724.0 },
                  --

              }
            },
            { name = '无名峡谷-赛克利亚营地下方',
              area = {
                  --正上
                  { x = -2718.0 + 100, y = 16916.0 + 100 },
                  --左上
                  { x = -5092.0 + 100, y = 19023.0 },
                  --正上
                  { x = -5092.0 + 100, y = 19023.0 + 100 },
                  { x = -5330.0 + 100, y = 19209.0 + 100 },
                  --右上
                  { x = -5385.0, y = 19225.0 + 100 },
                  { x = -5538.0, y = 19228.0 + 100 },
                  { x = -5703.8588867188, y = 19261.0 + 100 },
                  { x = -5964.27734375, y = 19233.0 + 100 },
                  { x = -6146.0, y = 19240.0 + 100 },
                  { x = -6322.7431640625, y = 19190.0 + 100 },
                  { x = -6515.7700195312, y = 19143.0 + 100 },
                  --正右
                  { x = -6515.0 - 100, y = 19143.0 + 100 },
                  --右下
                  { x = -6515.0 - 100, y = 19143.701171875 },
                  --右上
                  { x = -7792.0, y = 17218.0 + 100 },
                  --正右
                  { x = -7792.0 - 100, y = 17218.0 + 100 },
                  --左上
                  { x = -9077.0 + 100, y = 17303.0 },
                  --正上
                  { x = -9077.0 + 100, y = 17303.0 + 100 },
                  --右上
                  { x = -9077.0, y = 17303.0 + 100 },
                  { x = -9215.0, y = 17398.0 + 100 },
                  { x = -9324.0, y = 17387.0 + 100 },
                  { x = -9417.0, y = 17377.0 + 100 },
                  { x = -9508.78125, y = 17414.0 + 100 },
                  --正右
                  { x = -9508.0 - 100, y = 17414.0 + 100 },
                  { x = -9611.0 - 100, y = 17161.0 + 100 },
                  --右下
                  { x = -9611.0 - 100, y = 17161.970703125 },
                  { x = -9713.0 - 100, y = 16967.26953125 },
                  { x = -9732.0 - 100, y = 16511.251953125 },
                  { x = -9654.0 - 100, y = 16096.0 },
                  --正下
                  { x = -9654.0 - 100, y = 16096.0 - 100 },
                  { x = -8660.0 - 100, y = 14638.0 - 100 },
                  --左下
                  { x = -8665.0, y = 14626.0 - 100 },
                  { x = -8572.0, y = 14610.0 - 100 },
                  { x = -8508.0, y = 14602.0 - 100 },
                  { x = -8440.0, y = 14601.0 - 100 },
                  { x = -8301.0, y = 14434.0 - 100 },
                  { x = -8183.0, y = 14452.0 - 100 },
                  { x = -8024.0, y = 14510.0 - 100 },
                  { x = -7792.0, y = 14526.0 - 100 },
                  --正左
                  { x = -7792.0 + 100, y = 14526.0 - 100 },
                  --左下
                  { x = -7542.0, y = 15058.0 - 50 },
                  { x = -7402.0, y = 14663.0 - 50 },
                  --正下
                  { x = -7230.0 - 50, y = 14525.0 - 50 },
                  { x = -7119.0 - 50, y = 14400.0 - 50 },
                  { x = -7037.0 - 50, y = 14221.0 - 50 },
                  { x = -6825.0 - 50, y = 13917.0 - 50 },
                  --正右
                  { x = -6825.0 - 10, y = 13917.0 + 10 },
                  { x = -7387.0 - 10, y = 13559.0 + 10 },
                  { x = -7479.0 - 10, y = 13165.0 + 10 },
                  { x = -7635.0 - 10, y = 12830.0 + 10 },
                  --右下
                  { x = -7635.0 - 50, y = 12830.16796875 },
                  --正下
                  { x = -7635.0 - 50, y = 12830.0 - 50 },
                  --正右
                  { x = -8059.0 - 100, y = 11567.0 + 100 },
                  { x = -8367.0 - 100, y = 11042.0 + 100 },
                  --右下
                  { x = -8367.0 - 100, y = 11042.0 },
                  --正下
                  { x = -8367.0 - 100, y = 11042.0 - 100 },
                  --正右
                  { x = -7882.0 - 100, y = 10275.0 + 100 },
                  --右下

                  { x = -7882.0 - 100, y = 10275.676757812 },
                  { x = -7979.0 - 100, y = 10008.8046875 },
                  { x = -8037.0 - 100, y = 9725.0 },
                  { x = -7960.0 - 100, y = 9222.1318359375 },
                  { x = -8076.0 - 100, y = 8750.0 },
                  --正下
                  { x = -8076.0 - 100, y = 8750.0 - 100 },
                  --左下
                  { x = -8076.0, y = 8750.0 - 100 },
                  { x = -7830.0, y = 8842.0 - 100 },
                  { x = -7454.0, y = 8564.0 - 100 },
                  { x = -7138.0, y = 8487.0 - 100 },


                  { x = -6793.0, y = 8006.0 - 100 }, --false
                  { x = -6801.0, y = 8028.0 - 100 }, --false

                  --正右
                  { x = -6798.0 - 100, y = 8002.0 + 50 }, --false
                  --右下
                  { x = -6798.0 - 100, y = 8002.0 }, --false
                  --正下
                  { x = -6752.0 - 100, y = 7954.0 - 100 },


                  --左下
                  { x = -6684.0, y = 7934.0 - 100 },
                  { x = -6457.0, y = 8001.0 - 100 },
                  { x = -6250.0, y = 8064.0 - 100 },
                  { x = -5952.0, y = 8317.0 - 100 },
                  --正左
                  { x = -5952.0 + 100, y = 8317.0 - 100 },
                  { x = -5892.0 + 100, y = 8877.0 - 100 },
                  { x = -5598.0 + 100, y = 9426.0 - 100 },
                  --正上
                  { x = -5598.0 + 100, y = 9426.0 + 100 },
                  { x = -5954.0 + 100, y = 9872.0 + 100 },
                  --左上
                  { x = -6693.0 + 100, y = 10308.0 },
                  --正左
                  { x = -6386.0 + 10, y = 10556.0 - 10 },
                  { x = -6407.0 + 10, y = 10977.0 - 10 },
                  { x = -6282.0 + 10, y = 11218.0 - 10 },
                  { x = -6111.0 + 10, y = 11466.0 - 10 },
                  --正上
                  { x = -6113.0 + 10, y = 11481.0 + 10 },
                  --正右
                  { x = -6172.0 - 10, y = 11521.0 + 10 },
                  --右上
                  { x = -6390.7895507812, y = 11458.0 + 10 },
                  --正上
                  { x = -6613.0 + 10, y = 11544.0 + 10 },
                  { x = -6810.0 + 10, y = 11853.0 + 10 },
                  --左上
                  { x = -6900.0 + 10, y = 12095.52734375 },
                  { x = -6895.0 + 10, y = 12328.4765625 },
                  { x = -6887.0 + 10, y = 12556.380859375 },
                  --正左
                  { x = -6887.0 + 10, y = 12556.0 - 10 },
                  { x = -6712.0 + 10, y = 12784.0 - 10 },
                  { x = -6428.0 + 10, y = 13028.0 - 10 },
                  { x = -6204.0 + 10, y = 13263.0 - 10 },
                  --左下
                  { x = -3445.0, y = 13172.0 - 10 },
                  { x = -3056.0, y = 13376.0 - 10 },
                  --正左
                  { x = -3056.0 + 100, y = 13376.0 - 100 },
                  { x = -2402.0 + 100, y = 13922.0 - 100 },
                  { x = -1974.0 + 100, y = 14222.0 - 100 },
                  { x = -1779.0 + 100, y = 14357.0 - 100 },
                  --左上
                  { x = -1779.0 + 100, y = 14357.342773438 },
                  { x = -2718.0 + 100, y = 16916.0 },
              }
            },
            { name = '无名峡谷-赛克利亚营地下方小坑',
              area = {
                  --正上
                  { x = -7224.0 + 100, y = 14206.0 + 100 },
                  { x = -7512.0 + 100, y = 14531.0 + 100 },
                  --右上
                  { x = -7512.0224609375, y = 14531.0 + 100 },
                  { x = -7949.6479492188, y = 14361.0 + 100 },
                  --正右
                  { x = -8148.0 - 100, y = 13957.0 + 100 },
                  { x = -8467.0 - 100, y = 13326.0 + 100 },
                  --正下
                  { x = -8467.0 - 100, y = 13326.0 - 100 },
                  { x = -8133.0 - 100, y = 12876.0 - 100 },
                  { x = -7779.0 - 100, y = 12614.0 - 100 },
                  --正左
                  { x = -7779.0 + 50, y = 12614.0 - 50 },
                  { x = -7727.0 + 50, y = 12698.0 - 100 },
                  { x = -7692.0 + 50, y = 12933.0 - 50 },

                  { x = -7613.0 + 50, y = 13071.0 - 50 },
                  { x = -7584.0 + 50, y = 13408.0 - 50 },
                  { x = -7440.0 + 50, y = 13615.0 - 50 },
                  { x = -7336.0 + 50, y = 13973.0 - 50 },
                  { x = -7224.0 + 50, y = 14206.0 - 50 },
                  --左上
                  { x = -7224.0 + 100, y = 14206.0 },
              }
            },
            { name = '无名峡谷-黑树林',
              area = {

                  --正上
                  { x = -3823.0 + 100, y = 28137.0 + 100 },
                  { x = -4133.0 + 100, y = 28509.0 + 100 },
                  --右上
                  { x = -4133.0, y = 28509.0 + 100 },
                  { x = -6648.2758789062, y = 28510.0 + 100 },
                  { x = -9540.3857421875, y = 28445.0 + 100 },
                  { x = -10476.525390625, y = 28158.0 + 100 },
                  { x = -11239.306640625, y = 27555.0 + 100 },
                  { x = -12953.922851562, y = 27370.0 + 100 },
                  { x = -14374.28515625, y = 27779.0 + 100 },
                  { x = -16504.232421875, y = 28280.0 + 100 },
                  { x = -19154.748046875, y = 27884.0 + 100 },
                  { x = -20788.369140625, y = 28036.0 + 100 },
                  { x = -22397.6953125, y = 27815.0 + 100 },
                  { x = -22989.2109375, y = 27577.0 + 100 },
                  { x = -24452.658203125, y = 27051.0 + 100 },
                  --正右
                  { x = -24452.0 - 100, y = 27051.0 + 100 },
                  { x = -25044.0 - 100, y = 25113.0 + 100 },
                  --右下
                  { x = -25044.0 - 100, y = 25113.177734375 },
                  --正下
                  { x = -25044.0 - 100, y = 25113.0 - 100 },
                  { x = -25027.0 - 100, y = 23973.0 - 100 },
                  { x = -24828.0 - 100, y = 23856.0 - 100 },
                  --左下
                  { x = -24828.37890625, y = 23856.0 - 100 },
                  { x = -24630.6953125, y = 23761.0 - 100 },
                  { x = -24367.322265625, y = 23842.0 - 100 },
                  { x = -24126.0, y = 24010.0 - 100 },
                  { x = -23901.0, y = 24111.0 - 100 },
                  { x = -23214.912109375, y = 23910.0 - 100 },
                  { x = -22870.0, y = 23986.0 - 100 },
                  { x = -22405.0, y = 24001.0 - 100 },
                  { x = -22075.615234375, y = 24034.0 - 100 },
                  { x = -21557.0, y = 24200.0 - 100 },
                  --右下
                  { x = -20953.0 - 100, y = 23798.0 },
                  { x = -20990.0 - 100, y = 23438.0 },
                  { x = -20911.0 - 100, y = 22836.591796875 },
                  { x = -20945.0 - 100, y = 22516.384765625 },
                  { x = -20874.0 - 100, y = 22079.0 },
                  --正下
                  { x = -20871.0 - 100, y = 22115.0 - 100 },
                  { x = -20282.0 - 100, y = 21487.0 - 100 },
                  --右下
                  { x = -19266.0 - 100, y = 20874.408203125 },
                  { x = -19253.0 - 100, y = 20411.111328125 },
                  { x = -19335.0 - 100, y = 20250.0 },
                  { x = -19620.0 - 100, y = 19747.916015625 },
                  --正右
                  { x = -19620.0 - 100, y = 19594.0 + 100 },
                  { x = -20217.0 - 100, y = 19437.0 + 50 },
                  { x = -20313.0 - 100, y = 19236.0 + 50 },
                  { x = -20624.0 - 100, y = 19263.0 + 50 },
                  { x = -20798.0 - 100, y = 18998.0 + 50 },
                  { x = -20990.0 - 100, y = 18745.0 + 50 },
                  { x = -21294.0 - 100, y = 18425.0 + 50 },
                  { x = -21484.0 - 100, y = 18137.0 + 100 },
                  { x = -21585.0 - 100, y = 17811.0 + 100 },
                  { x = -22009.0 - 100, y = 17661.0 + 100 },
                  { x = -22512.0 - 100, y = 17542.0 + 100 },
                  --右下
                  { x = -22425.0 - 100, y = 16906.509765625 },
                  --正下
                  { x = -22425.0 - 100, y = 16906.0 - 100 },
                  --左下
                  { x = -22425.318359375, y = 16906.0 - 100 },
                  { x = -21975.306640625, y = 16761.0 - 100 },
                  { x = -21643.0, y = 16885.0 - 100 },
                  --正左
                  { x = -21643.0 + 100, y = 16885.0 - 100 },
                  { x = -21406.0 + 100, y = 17081.0 - 100 },
                  { x = -21182.0 + 100, y = 17294.0 - 100 },
                  { x = -21017.0 + 100, y = 17851.0 - 100 },
                  { x = -20430.0 + 100, y = 18314.0 - 100 },
                  { x = -20140.0 + 100, y = 18460.0 - 100 },
                  { x = -19973.0 + 100, y = 18894.0 - 100 },
                  { x = -19557.0 + 100, y = 19023.0 - 100 },
                  { x = -19043.0 + 100, y = 19507.0 - 100 },
                  --左上
                  { x = -19043.0 + 100, y = 19507.0 },
                  { x = -19028.0 + 100, y = 19843.0 },
                  { x = -18974.0 + 100, y = 20303.365234375 },
                  { x = -18963.0 + 100, y = 20791.58203125 },
                  { x = -18466.0 + 100, y = 21753.322265625 },
                  { x = -18425.0 + 100, y = 22490.787109375 },
                  { x = -17997.0 + 100, y = 22708.203125 },
                  --左下
                  { x = -17060.0, y = 22866.0 - 100 },
                  { x = -16517.0, y = 22881.0 - 100 },
                  { x = -16141.381835938, y = 22955.0 - 100 },
                  { x = -15597.0, y = 22925.0 - 100 },
                  --正左
                  { x = -15597.0 + 100, y = 22925.0 - 100 },
                  --左下
                  { x = -14080.477539062, y = 23574.0 - 100 },
                  { x = -12587.0, y = 23508.0 - 100 },
                  { x = -12277.0, y = 23365.0 - 100 },
                  --右下
                  { x = -11577.0 - 100, y = 23158.0 },
                  { x = -11306.0 - 100, y = 22608.6640625 },
                  { x = -11032.0 - 100, y = 22231.73828125 },
                  { x = -11170.0 - 100, y = 21608.0 },
                  { x = -11056.0 - 100, y = 21437.392578125 },
                  { x = -10929.0 - 100, y = 20429.0 },
                  { x = -10853.0 - 100, y = 20084.0 },
                  --正右
                  { x = -10893.0 - 100, y = 18725.0 + 100 },
                  { x = -11113.0 - 100, y = 18461.0 + 100 },
                  { x = -11850.0 - 100, y = 17860.0 + 100 },
                  { x = -12212.0 - 100, y = 17510.0 + 100 },
                  --右下
                  { x = -12212.0 - 100, y = 17510.974609375 },
                  { x = -12351.0 - 100, y = 15762.0 },
                  --正下
                  { x = -12351.0 - 100, y = 15762.0 - 100 },
                  { x = -12342.0 - 50, y = 15488.0 - 50 },


                  --左下
                  { x = -12266.0, y = 15512.0 - 100 },
                  --左下
                  { x = -11314.0, y = 15260.0 - 100 },
                  --正下
                  { x = -11314.0 - 100, y = 15260.0 - 100 },
                  --左下
                  { x = -11314.0, y = 15260.0 - 100 },
                  { x = -11181.0, y = 15324.0 - 100 },
                  --正左
                  { x = -11174.0 + 100, y = 15446.0 - 100 },
                  { x = -10937.0 + 100, y = 15779.0 - 100 },
                  { x = -11013.0 + 100, y = 16130.0 - 100 },
                  { x = -10386.0 + 100, y = 17861.0 - 100 },
                  --正下
                  { x = -9535.0 - 100, y = 17616.0 - 100 },
                  --左下
                  { x = -9535.0, y = 17616.0 - 100 },
                  { x = -9316.7412109375, y = 17653.0 - 100 },
                  { x = -8850.470703125, y = 17663.0 - 100 },
                  { x = -8647.0, y = 17661.0 - 100 },
                  { x = -8419.0, y = 17865.0 - 100 },
                  { x = -8187.0, y = 17894.0 - 100 },
                  --正左
                  { x = -8187.0 + 100, y = 17894.0 - 100 },
                  --正下
                  { x = -6425.0 - 100, y = 19623.0 - 100 },
                  --左下
                  { x = -6425.0078125, y = 19623.0 - 100 },
                  { x = -5968.8051757812, y = 19602.0 - 100 },
                  --正左
                  { x = -5968.0 + 100, y = 19602.0 - 100 },
                  { x = -5729.0 + 100, y = 19815.0 - 100 },
                  --左下
                  { x = -4968.0, y = 19851.0 - 100 },
                  --正下
                  { x = -4337.0 - 100, y = 19495.0 - 100 },
                  --左下
                  { x = -3003.4658203125, y = 19138.0 - 100 },
                  --正左
                  { x = -3003.0 + 100, y = 19138.0 - 100 },
                  --左上
                  { x = -3003.0 + 100, y = 19138.0 },
                  --左上
                  { x = -2890.0 + 100, y = 19798.0 },
                  { x = -2773.0 + 100, y = 21748.357421875 },
                  { x = -2748.0 + 100, y = 23086.609375 },
                  { x = -3027.0 + 100, y = 23912.0 },
                  { x = -3537.0 + 100, y = 25319.0 },
                  { x = -3702.0 + 100, y = 26310.03125 },
                  { x = -3887.0 + 100, y = 27407.0 },
                  { x = -3937.0 + 100, y = 28049.0 },


              }
            },
            { name = '无名峡谷-黑树林与地图右下连接处',
              area = {
                  --右上
                  { x = -19804.779296875, y = 20532.0 + 100 },
                  { x = -20151.064453125, y = 20648.0 + 100 },
                  { x = -20531.115234375, y = 20748.0 + 100 },
                  { x = -21006.166015625, y = 20911.0 + 100 },
                  --正右
                  { x = -21006.0 - 50, y = 20911.0 + 50 },
                  { x = -21513.0 - 50, y = 20454.0 + 50 },
                  { x = -21977.0 - 50, y = 20293.0 + 50 },
                  { x = -22191.0 - 50, y = 20238.0 + 50 },
                  { x = -22426.0 - 50, y = 20127.0 + 50 },
                  { x = -22501.0 - 50, y = 20032.0 + 50 },
                  { x = -22664.0 - 50, y = 19666.0 + 50 },
                  { x = -22585.0 - 50, y = 19196.0 + 50 },
                  { x = -22697.0 - 50, y = 18383.0 + 50 },
                  --右下
                  { x = -22697.0 - 100, y = 18383.0 },
                  --正下+
                  { x = -22697.0 - 100, y = 18383.0 - 100 },
                  --左下
                  { x = -22619.0, y = 18281.0 - 100 },
                  --正左
                  { x = -22246.0 + 50, y = 18318.0 - 50 },
                  { x = -21938.0 + 50, y = 18836.0 - 50 },
                  { x = -21286.0 + 50, y = 19012.0 - 50 },
                  { x = -21103.0 + 50, y = 19116.0 - 50 },
                  { x = -20931.0 + 50, y = 19192.0 - 50 },
                  { x = -20633.0 + 50, y = 19423.0 - 50 },
                  { x = -20425.0 + 50, y = 19934.0 - 50 },
                  { x = -20245.0 + 50, y = 20101.0 - 50 },
                  { x = -19773.0 + 50, y = 20291.0 - 50 },
                  { x = -19661.0 + 50, y = 20532.0 - 50 },
                  --正上
                  { x = -19804.0 + 100, y = 20532.0 + 100 },

              }
            },
            { name = '无名峡谷-地图右下',
              area = {
                  --正左
                  { x = -22157.0 + 100, y = 20331.0 - 100 },
                  { x = -21941.0 + 100, y = 21701.0 - 100 },
                  --左上
                  { x = -21941.0 + 100, y = 21701.0 },
                  { x = -21849.0 + 100, y = 22408.0 },
                  { x = -22137.0 + 100, y = 23173.83203125 },
                  --右上
                  { x = -22161.0, y = 23206.0 + 100 },
                  { x = -22576.0, y = 23218.0 + 100 },
                  { x = -23404.16796875, y = 23133.0 + 100 },
                  { x = -23612.279296875, y = 23178.0 + 100 },
                  { x = -23816.48828125, y = 23184.0 + 100 },
                  --正右
                  { x = -23816.0 - 50, y = 23184.0 + 50 },
                  --右下
                  { x = -23816.0 - 50, y = 23184.154296875 },
                  { x = -23869.0 - 50, y = 23024.0 },
                  { x = -23866.0 - 50, y = 22885.3671875 },
                  { x = -23899.0 - 100, y = 22666.0 },
                  { x = -23903.0 - 100, y = 22350.333984375 },
                  --正右
                  { x = -24246.0 - 100, y = 22288.0 + 100 },
                  --右下
                  { x = -24246.0 - 100, y = 22288.0 },
                  --左上
                  { x = -24919.0 + 100, y = 22494.0 },
                  --右上
                  { x = -24919.0, y = 22494.0 + 100 },
                  { x = -25088.25390625, y = 22513.0 + 100 },
                  { x = -25467.763671875, y = 22408.0 + 100 },
                  --正右
                  { x = -25467.0 - 100, y = 22408.0 + 100 },
                  { x = -25760.0 - 100, y = 22018.0 + 100 },
                  { x = -26378.0 - 100, y = 20913.0 + 100 },
                  { x = -26608.0 - 100, y = 18894.0 + 100 },
                  { x = -27205.0 - 100, y = 18466.0 + 100 },
                  { x = -27197.0 - 100, y = 17670.0 + 100 },
                  { x = -27001.0 - 100, y = 16549.0 + 100 },
                  --右下
                  { x = -27001.0 - 100, y = 16549.0 },
                  { x = -26986.0 - 100, y = 15998.209960938 },
                  { x = -26874.0 - 100, y = 15404.66015625 },
                  { x = -26979.0 - 100, y = 14989.0 },
                  { x = -26743.0 - 100, y = 13854.0 },
                  --正下
                  { x = -26743.0 - 100, y = 13854.0 - 100 },
                  --左下
                  { x = -26743.0, y = 13854.0 - 100 },
                  { x = -26095.0, y = 13782.0 - 100 },
                  --正左
                  { x = -26095.0 + 100, y = 13782.0 - 100 },
                  --左上
                  { x = -26095.0 + 100, y = 13782.0 },
                  { x = -26064.0 + 100, y = 14054.0 },
                  { x = -26121.0 + 100, y = 14277.0 },
                  { x = -26260.0 + 100, y = 14726.0 },
                  { x = -26291.0 + 100, y = 15526.0 },
                  --正左
                  { x = -25094.0 + 100, y = 17122.0 - 100 },
                  { x = -24713.0 + 100, y = 17513.0 - 100 },
                  --左下
                  { x = -22917.0, y = 19759.0 - 100 },
                  --正左
                  { x = -22917.0 + 50, y = 19759.0 - 50 },
                  { x = -22849.0 + 50, y = 19895.0 - 50 },
                  { x = -22689.0 + 50, y = 20070.0 - 50 },
                  { x = -22576.0, y = 20226.0 - 20 },
                  { x = -22504.0, y = 20232.0 - 20 },
                  { x = -22433.041015625, y = 20209.0 - 20 },
                  { x = -22352.0, y = 20242.0 - 20 },
                  { x = -22157.0, y = 20331.0 - 20 },
                  --左上
                  { x = -22188.0 + 100, y = 20319.5625 },
                  { x = -22359.0 + 100, y = 20603.09375 },
                  --正左
                  { x = -21947.0 + 100, y = 21693.0 - 100 },


              }
            },
            { name = '无名峡谷-地图右下右下处',
              area = {
                  { x = -25333.0 + 100, y = 14495.0 + 100 },
                  { x = -25555.2578125, y = 14510.0 + 100 }, --false

                  { x = -25800.0 - 100, y = 14156.0 + 100 },
                  { x = -25901.0 - 100, y = 13692.0 - 100 },
                  { x = -25278.0 + 100, y = 13946.0 - 100 },

              }
            },
            { name = '无名峡谷-地图右下左处',
              area = {
                  --右上
                  { x = -24271.5859375, y = 23584.0 + 50 },
                  { x = -24336.892578125, y = 23548.0 + 50 },
                  { x = -24552.4375, y = 23421.0 + 50 },
                  { x = -24900.0390625, y = 23360.0 + 50 },
                  { x = -25284.0859375, y = 23305.0 + 50 },
                  --正右
                  { x = -25284.0 - 50, y = 23305.0 + 50 },
                  --右下
                  { x = -25284.0 - 50, y = 23305.7890625 },
                  { x = -25457.0 - 50, y = 22999.96875 },
                  --正下
                  { x = -25457.0 - 50, y = 22999.0 - 50 },
                  { x = -25273.0 - 50, y = 22765.0 - 50 },
                  --左下
                  { x = -25273.0, y = 22765.0 - 50 },
                  { x = -25167.0, y = 22841.0 - 50 },
                  { x = -24890.21875, y = 22915.0 - 50 },
                  { x = -24497.6484375, y = 22927.0 - 50 },
                  --正下
                  { x = -24027.0 - 50, y = 22653.0 - 50 },
                  --正左
                  { x = -24027.0 + 50, y = 22653.0 - 50 },
                  --左上
                  { x = -24027.0 + 50, y = 22653.0 },
                  { x = -24010.0 + 50, y = 22788.74609375 },
                  { x = -23995.0 + 50, y = 22976.982421875 },
                  { x = -23930.0 + 50, y = 23229.0 },
                  --正上
                  { x = -23930.0 + 50, y = 23229.0 + 50 },
                  { x = -24271.0 + 50, y = 23584.0 + 50 },
              }
            },
            { name = '无名峡谷-半魔人居住地',
              area = {
                  --正上
                  { x = -11631.0 + 100, y = 21977.0 + 100 },
                  --右上
                  { x = -11820.0, y = 22071.0 + 100 },
                  { x = -12544.0, y = 21871.0 + 100 },
                  { x = -12914.0, y = 21885.0 + 100 },
                  { x = -13425.0, y = 22032.0 + 100 },
                  { x = -14140.0, y = 21988.0 + 100 },
                  { x = -14877.0, y = 21418.0 + 100 },
                  --正上
                  { x = -15862.0 + 100, y = 22031.0 + 100 },
                  --右上
                  { x = -15923.0, y = 22243.0 + 100 },
                  { x = -16159.0, y = 22286.0 + 100 },
                  --正右
                  { x = -16309.0 - 100, y = 22139.0 + 100 },
                  { x = -16548.0 - 100, y = 21790.0 + 100 },
                  --右上
                  { x = -17381.0, y = 21709.0 + 100 },
                  --正右
                  { x = -17381.0 - 100, y = 21709.0 + 100 },
                  { x = -17581.0 - 100, y = 21625.0 + 100 },
                  { x = -17980.0 - 100, y = 21421.0 + 100 },
                  --右下
                  { x = -17980.0 - 100, y = 21421.0 },
                  { x = -18087.0 - 100, y = 20898.0 },
                  --正下
                  { x = -18087.0 - 100, y = 20898.0 - 100 },
                  --正上
                  { x = -18682.0 + 100, y = 19313.0 + 100 },
                  --正右
                  { x = -18682.0 - 100, y = 19313.0 + 100 },
                  { x = -18812.0 - 100, y = 19111.0 + 100 },
                  { x = -19142.0 - 100, y = 18592.0 + 100 },
                  { x = -19583.0 - 100, y = 18453.0 + 100 },
                  { x = -20607.0 - 100, y = 16943.0 + 100 },
                  { x = -21155.0 - 100, y = 16966.0 + 100 },
                  { x = -21505.0 - 100, y = 16724.0 + 100 },
                  { x = -21630.0 - 100, y = 16431.0 + 100 },
                  { x = -21730.0 - 100, y = 16124.0 + 100 },
                  { x = -21938.0 - 100, y = 15715.0 + 100 },
                  --正左
                  { x = -22830.0 + 100, y = 16449.0 - 100 },
                  --左上
                  { x = -22830.0 + 100, y = 16449.0 },
                  --正上
                  { x = -22830.0 + 100, y = 16449.0 + 100 },
                  { x = -23180.0 + 100, y = 16826.0 + 100 },
                  --右上
                  { x = -23180.0, y = 16826.0 + 100 },
                  --正右
                  { x = -23216.0 - 100, y = 16813.0 + 100 },
                  { x = -23533.0 - 100, y = 16419.0 + 100 },
                  { x = -23867.0 - 100, y = 16141.0 + 100 },
                  { x = -24372.0 - 100, y = 15435.0 + 100 },
                  { x = -24850.0 - 100, y = 15138.0 + 100 },
                  { x = -25084.0 - 100, y = 14822.0 + 100 },
                  { x = -25102.0 - 100, y = 14656.0 + 100 },
                  --右下
                  { x = -25102.0 - 100, y = 14656.0 },
                  --正下
                  { x = -25102.0 - 100, y = 14656.0 - 100 },
                  { x = -25099.0 - 100, y = 14558.0 - 100 },
                  { x = -25062.0 - 100, y = 14489.0 - 100 },
                  { x = -24932.0 - 100, y = 14228.0 - 100 },
                  { x = -24713.0 - 100, y = 14003.0 - 100 },
                  { x = -24603.0 - 100, y = 13899.0 - 100 },
                  --正右
                  { x = -24619.0 - 100, y = 13361.0 + 100 },
                  { x = -24843.0 - 100, y = 13176.0 + 100 },
                  { x = -24937.0 - 100, y = 13090.0 + 100 },
                  --右下
                  { x = -24937.0 - 100, y = 13090.0 },
                  --正下
                  { x = -24937.0 - 100, y = 13090.0 - 100 },
                  { x = -24758.0 - 100, y = 12899.0 - 100 },
                  --右上
                  { x = -25646.0, y = 9778.0 + 100 },
                  --正右
                  { x = -25646.0 - 100, y = 9778.0 + 100 },
                  --右下
                  { x = -25646.0 - 100, y = 9778.0 },
                  { x = -25594.0 - 100, y = 9245.0 },
                  --正下
                  { x = -25594.0 - 100, y = 9245.0 - 100 },
                  { x = -23648.0 - 100, y = 7978.0 - 100 },
                  { x = -22087.0 - 100, y = 6112.0 - 100 },
                  { x = -21311.0 - 100, y = 5653.0 - 100 },
                  { x = -20827.0 - 100, y = 5579.0 - 100 },
                  --正左
                  { x = -20827.0 + 50, y = 5579.0 - 50 },
                  { x = -20704.0 + 50, y = 5649.0 - 50 },
                  { x = -20629.0 - 10, y = 5738.0 + 10 }, --true

                  { x = -20517.0 + 50, y = 5853.0 - 10 },
                  { x = -20379.0 + 10, y = 5986.0 - 10 }, --false
                  { x = -20385.0 + 50, y = 6071.0 - 10 },
                  --左下
                  { x = -19973.0, y = 6185.0 - 50 },
                  { x = -19858.0, y = 6189.0 - 50 },
                  { x = -19659.0, y = 6181.0 - 50 },
                  { x = -19418.0, y = 6070.0 - 100 },
                  { x = -19110.0, y = 6024.0 - 100 },
                  { x = -18313.0, y = 5751.0 - 100 },
                  { x = -17922.0, y = 5854.0 - 100 },
                  { x = -17350.0, y = 5853.0 - 100 },
                  { x = -17058.0, y = 5984.0 - 100 },
                  { x = -16361.0, y = 6033.0 - 100 },
                  --正左

                  { x = -16361.0 + 100, y = 6033.0 - 100 },
                  { x = -16085.0 + 50, y = 6242.0 - 50 },
                  { x = -15778.0 + 50, y = 6508.0 - 50 },
                  { x = -15613.0 + 50, y = 6616.0 - 50 },
                  { x = -15299.0 + 50, y = 6680.0 - 50 },
                  --左下
                  { x = -15017.0, y = 6805.0 - 100 },
                  { x = -14877.0, y = 6802.0 - 100 },
                  { x = -14693.0, y = 6778.0 - 100 },
                  { x = -14498.0, y = 6786.0 - 100 },
                  { x = -14134.0, y = 7135.0 - 100 },
                  { x = -13606.0, y = 7196.0 - 100 },
                  --正左
                  { x = -13606.0 + 100, y = 7196.0 - 100 },
                  --左上
                  { x = -13606.0 + 100, y = 7196.0 },
                  { x = -13655.0 + 100, y = 7320.0 },
                  { x = -13629.0 + 100, y = 7400.0 },
                  { x = -13684.0 + 100, y = 7503.0 },
                  { x = -13754.0 + 100, y = 7553.0 },
                  --正上
                  { x = -13754.0 + 100, y = 7553.0 + 100 },
                  --右上
                  { x = -13754.0, y = 7553.0 + 100 },
                  { x = -13911.0, y = 7586.0 + 100 },
                  { x = -14108.0, y = 7615.0 + 100 },
                  { x = -14478.0, y = 7563.0 + 100 },
                  { x = -14747.0, y = 7601.0 + 100 },
                  { x = -14928.0, y = 7530.0 + 100 },
                  { x = -15982.0, y = 7264.0 + 100 },
                  { x = -16454.0, y = 6937.0 + 100 },
                  { x = -16813.0, y = 6297.0 + 100 },
                  { x = -17826.0, y = 6327.0 + 100 },
                  { x = -18343.0, y = 6401.0 + 100 },
                  { x = -18471.0, y = 6545.0 + 100 },
                  { x = -18766.0, y = 6608.0 + 100 },
                  { x = -19490.0, y = 6755.0 + 100 },
                  { x = -19924.0, y = 6776.0 + 100 },
                  { x = -20038.0, y = 6827.0 + 100 },
                  { x = -20104.0, y = 6849.0 + 100 },
                  { x = -20196.0, y = 6863.0 + 100 },
                  { x = -20269.0, y = 6855.0 + 100 },
                  { x = -20713.0, y = 6222.0 + 100 },
                  --左上
                  { x = -21502.0 + 100, y = 6800.0 },
                  { x = -21288.0 + 100, y = 7488.0 },
                  { x = -21245.0 + 100, y = 8818.0 },
                  --正下
                  { x = -19976.0 - 100, y = 9314.0 - 100 },
                  { x = -19388.0 - 100, y = 8895.0 - 100 },
                  --左下
                  { x = -19096.0, y = 8866.0 - 100 },
                  { x = -18832.0, y = 8853.0 - 100 },
                  { x = -18455.0, y = 8993.0 - 100 },
                  { x = -17713.0, y = 9151.0 - 100 },
                  { x = -17269.0, y = 9111.0 - 100 },
                  { x = -16837.0, y = 9203.0 - 100 },
                  { x = -16359.0, y = 9294.0 - 100 },
                  { x = -15913.0, y = 9335.0 - 100 },
                  { x = -15506.0, y = 9534.0 - 100 },
                  { x = -15008.0, y = 9736.0 - 100 },
                  --正左
                  { x = -15008.0 + 100, y = 9736.0 - 100 },
                  --左上
                  { x = -15008.0 + 100, y = 9736.0 },
                  { x = -14717.0 + 100, y = 10369.0 },
                  { x = -14256.0 + 100, y = 11103.0 },
                  { x = -13991.0 + 100, y = 12195.0 },
                  { x = -13879.0 + 100, y = 12493.0 },
                  { x = -13646.0 + 100, y = 13480.0 },
                  --正左
                  { x = -13444.0 + 100, y = 14111.0 - 100 },
                  { x = -13245.0 + 100, y = 14463.0 - 100 },
                  { x = -12883.0 + 100, y = 14829.0 - 100 },
                  { x = -12613.0 + 100, y = 15042.0 - 100 },
                  { x = -12452.0 + 100, y = 15179.0 - 100 },
                  { x = -12383.0 + 100, y = 15378.0 - 100 },
                  --左上
                  { x = -12383.0 + 50, y = 15378.0 },
                  --正上
                  { x = -12383.0 + 50, y = 15378.0 + 50 },
                  { x = -12677.0 + 50, y = 15568.0 + 50 },
                  --右上
                  { x = -12677.0, y = 15568.0 + 50 },
                  --正右
                  { x = -12677.0 - 100, y = 15568.0 + 100 },
                  { x = -13029.0 - 100, y = 15454.0 + 100 },
                  { x = -13200.0 - 100, y = 15266.0 + 100 },
                  { x = -13620.0 - 100, y = 14840.0 + 100 },
                  { x = -14217.0 - 100, y = 13995.0 + 100 },
                  { x = -14278.0 - 100, y = 13084.0 + 100 },
                  { x = -14809.0 - 100, y = 12676.0 + 100 },
                  { x = -15236.0 - 100, y = 11926.0 + 100 },
                  { x = -15415.0 - 100, y = 11433.0 + 100 },
                  { x = -15615.0 - 100, y = 11010.0 + 100 },
                  { x = -15849.0 - 100, y = 10643.0 + 100 },
                  { x = -15963.0 - 50, y = 10461.0 + 50 },
                  { x = -16114.0 - 20, y = 10268.0 + 20 },
                  { x = -16460.0 - 20, y = 9948.0 + 20 },
                  { x = -16534.0 - 50, y = 9859.0 + 50 }, --true

                  { x = -16763.0 - 50, y = 9833.0 + 50 },
                  --右上
                  { x = -16888.0, y = 9602.0 + 100 },
                  { x = -17110.0, y = 9419.0 + 100 },
                  { x = -17444.0, y = 9373.0 + 100 },
                  { x = -17804.0, y = 9410.0 + 100 },
                  { x = -18152.0, y = 9408.0 + 100 },
                  { x = -18649.0, y = 9388.0 + 100 },
                  { x = -19055.0, y = 9225.0 + 100 },
                  --正下
                  { x = -18845.0 - 100, y = 10052.0 - 100 },
                  { x = -18718.0 - 100, y = 10011.0 - 100 },
                  --左下
                  { x = -18716.0, y = 10010.0 - 100 },
                  { x = -18570.0, y = 10095.0 - 100 },
                  { x = -18252.0, y = 10159.0 - 100 },
                  { x = -17911.0, y = 10165.0 - 50 },
                  { x = -17785.0, y = 10070.0 - 50 },
                  { x = -17547.0, y = 10098.0 - 50 },
                  { x = -17352.0, y = 10212.0 - 50 },
                  { x = -17068.0, y = 10340.0 - 50 },
                  { x = -16971.0, y = 10368.0 - 50 },
                  { x = -16859.0, y = 10515.0 - 50 },
                  --正左
                  { x = -16859.0 + 50, y = 10515.0 - 50 },
                  --左下
                  { x = -16689.0, y = 11023.0 - 100 },
                  --正左
                  { x = -16261.0 + 100, y = 11153.0 - 100 },
                  { x = -15845.0 + 100, y = 11482.0 - 100 },
                  { x = -15792.0 + 100, y = 11935.0 - 100 },
                  --左上
                  { x = -15792.0 + 100, y = 11935.0 },
                  { x = -16001.0 + 100, y = 12466.982421875 },
                  { x = -15898.0 + 100, y = 13560.375976562 },
                  --正左
                  { x = -15767.0 + 100, y = 14172.0 - 100 },
                  { x = -15545.0 + 100, y = 14568.0 - 100 },
                  { x = -15306.0 + 100, y = 15010.0 - 100 },
                  { x = -15049.0 + 100, y = 15484.0 - 100 },
                  { x = -14636.0 + 100, y = 16248.0 - 100 },
                  { x = -13916.0 + 100, y = 17137.0 - 100 },
                  { x = -13139.0 + 100, y = 17854.0 - 100 },
                  { x = -12908.0 + 100, y = 18224.0 - 100 },
                  { x = -12677.0 + 100, y = 18466.0 - 100 },
                  --左上
                  { x = -12677.0 + 100, y = 18466.0 },
                  { x = -12777.0 + 100, y = 18720.0 },
                  { x = -12915.0 + 100, y = 19247.0 },
                  { x = -13121.0 + 100, y = 19753.0 },
                  --正左
                  { x = -12248.0 + 100, y = 20978.0 - 100 },
                  { x = -11956.0 + 100, y = 21463.0 - 100 },
                  { x = -11644.0 + 100, y = 21740.0 - 100 },
                  --左上
                  { x = -11644.0 + 100, y = 21740.0 },
                  --正上
                  { x = -11644.0 + 100, y = 21740.0 },


              }
            },
            { name = '无名峡谷-半魔人居休息处左下一',
              area = {
                  --正右
                  { x = -16299.0 - 20, y = 10597.0 + 20 },
                  { x = -16530.0 - 20, y = 10572.0 + 20 },
                  { x = -16737.0 - 20, y = 10489.0 + 20 },
                  { x = -16978.0 - 20, y = 10297.0 + 20 },
                  { x = -17149.0 - 20, y = 10228.0 + 20 },
                  { x = -17338.0 - 20, y = 10015.0 + 20 },
                  { x = -17540.0 - 50, y = 10023.0 + 50 },
                  { x = -17721.0 - 50, y = 9981.0 + 50 },
                  { x = -17785.0 - 50, y = 9878.0 + 50 },
                  { x = -18009.0 - 50, y = 9770.0 + 50 },
                  { x = -18276.0 - 50, y = 9880.0 + 50 },
                  { x = -18410.0 - 50, y = 9892.0 + 50 },

                  --正下
                  { x = -18410.0 - 50, y = 9892.0 - 50 },
                  { x = -18296.0 - 50, y = 9602.0 - 50 }, --false
                  { x = -18277.0, y = 9598.0 - 50 }, --false
                  { x = -18296.0 + 50, y = 9602.0 - 50 }, --false

                  --正左
                  --{ x = -18352.0+50, y = 9655.0-50 },
                  { x = -18201.0 + 50, y = 9642.0 - 50 },
                  -- { x = -17876.0+50, y = 9605.0-50 },
                  { x = -17084.0 + 20, y = 9606.0 - 20 }, --false

                  { x = -17825.0, y = 9543.0 - 50 }, --false
                  { x = -17825.0 + 20, y = 9543.0 - 20 },
                  { x = -17546.0 + 20, y = 9776.0 - 20 },
                  { x = -17221.0 + 20, y = 9624.0 - 20 },
                  { x = -17161.0 + 20, y = 9631.0 - 50 },
                  { x = -16885.0 + 20, y = 9811.0 - 20 },
                  { x = -16765.92578125, y = 9986.65234375 - 30 }, --true
                  { x = -16606.0 + 20, y = 9912.0 - 20 },
                  { x = -16534.0 + 20, y = 10098.0 - 20 },
                  { x = -16411.0 + 20, y = 10263.0 - 20 },
                  { x = -16266.0 + 20, y = 10277.0 - 20 },
                  { x = -16200.0 + 20, y = 10446.0 - 20 },
                  { x = -16232.0 + 20, y = 10606.0 - 20 },
                  --正上
                  { x = -16232.0 + 50, y = 10606.0 + 50 },
                  { x = -16299.0 + 50, y = 10597.0 + 50 },
              }
            },
            { name = '无名峡谷-半魔人居休息处左下二',
              area = {
                  --右上
                  { x = -14318.3046875, y = 8378.0 + 100 },
                  --正上
                  { x = -15395.0 + 100, y = 8950.0 + 100 },
                  --正右
                  { x = -15457.0 - 100, y = 8958.0 + 100 },
                  { x = -16384.0 - 100, y = 8087.0 + 100 },
                  --右上
                  { x = -17129.0, y = 7996.0 + 50 },
                  { x = -18245.0, y = 7750.0 + 50 },
                  { x = -18421.0, y = 7755.0 + 50 },
                  { x = -18622.0, y = 7742.0 + 50 },
                  { x = -18656.0, y = 7846.0 + 50 },
                  { x = -19213.0, y = 7845.0 + 50 },
                  { x = -19491.0, y = 7494.0 + 100 },
                  { x = -20151.0, y = 7567.0 + 100 },
                  { x = -20537.0, y = 7433.0 + 100 },
                  --正右
                  { x = -20537.0 - 100, y = 7433.0 + 100 },
                  --右下
                  { x = -20537.0 - 100, y = 7433.0 },
                  { x = -20555.0 - 100, y = 7170.0 },
                  --正下
                  { x = -20555.0 - 100, y = 7170.0 - 100 },
                  --左下
                  { x = -20467.0, y = 7026.0 - 100 },
                  { x = -20263.0, y = 7007.0 - 100 },
                  { x = -19951.0, y = 7069.0 - 100 },
                  { x = -19638.0, y = 7086.0 - 100 },
                  { x = -18485.0, y = 6811.0 - 100 },
                  { x = -17791.0, y = 6840.0 - 100 },
                  { x = -17217.0, y = 7035.0 - 100 },
                  { x = -16257.0, y = 7451.0 - 100 },
                  { x = -16053.0, y = 7570.0 - 100 },
                  { x = -15701.0, y = 7663.0 - 100 },
                  { x = -14726.0, y = 7852.0 - 100 },
                  { x = -14373.0, y = 7843.0 - 100 },
                  --正左
                  { x = -14373.0 + 100, y = 7843.0 - 100 },
                  --左上
                  { x = -14373.0 + 100, y = 7843.0 + 100 },
                  { x = -14248.0 + 100, y = 7980.0 + 100 },
                  { x = -14268.0 + 100, y = 8122.0 + 100 },
                  { x = -14291.0 + 100, y = 8307.0 + 100 },
                  { x = -14316.0 + 100, y = 8380.0 + 100 },


              },
              overlap = {
                  ['无名峡谷-半魔人居休息处左下二瞭望塔'] = 0,
              },
            },
            { name = '无名峡谷-半魔人居休息处左下二瞭望塔',
              area = {
                  { x = -18341.0 + 50, y = 8054.0 + 50 },
                  { x = -18553.0 - 50, y = 8054.0 + 50 },
                  { x = -18553.0 - 50, y = 7842.0 - 50 },
                  { x = -18341.0 + 50, y = 7842.0 - 50 },
              },
              min_cz  = 15800,
            },
            { name = '无名峡谷-半魔人居休息处连接营地处下',
              area = {
                  --正上
                  { x = -20228.0+50, y = 5238.0+50 },
                  { x = -20222.0+50, y = 5148.0+50 },
                  { x = -20629.0+50, y = 5738.0+50 },
                  --正右
                  { x = -20629.0-50, y = 5738.0+50 },
                  --右下
                  { x = -20629.0-50, y = 5738.0 },
                  { x = -20621.0-50, y = 5652.0 },
                  { x = -20620.0-50, y = 5542.0 },
                  { x = -20629.0-50, y = 5451.0 },
                  --正右
                  { x = -20671.0-50, y = 5384.0+50 },
                  { x = -20718.0-50, y = 5338.0+50 },
                  { x = -20763.0-50, y = 5289.0+50 },
                  { x = -20795.0-50, y = 5258.0+50 },
                  { x = -20934.0-50, y = 5300.0+50 },
                  { x = -20971.0-50, y = 5254.0+50 },

                  --正下
                  { x = -20971.0-50, y = 5254.0-50 },
                  { x = -20918.0-50, y = 5042.0-50 },
                  { x = -20775.0-50, y = 4923.0-50 },
                  { x = -20781.0-50, y = 4734.0-50 },
                  { x = -20680.0-50, y = 4626.0-50 },
                  { x = -20601.0-50, y = 4578.0-50 },--false
                  { x = -20342.0-50, y = 4671.0-50 },
                  --正左
                  { x = -20342.0+50, y = 4671.0-50 },
                  --左上
                  { x = -20342.0+50, y = 4671.0 },
                  { x = -20275.0+50, y = 4860.0 },
                  { x = -20242.0+50, y = 5013.0893554688 },
                  { x = -20223.0+50, y = 5167.6513671875 },
                  { x = -20228.0+50, y = 5238.0 },



              }
            },
            { name = '无名峡谷-左中连接处',
              area = {




                  --右上
                  { x = -8773.0, y = 10751.0+100 },
                  --左上
                  { x = -9765.0+100, y = 11390.0 },
                  { x = -9685.0+100, y = 12710.0 },
                  { x = -9605.0+100, y = 13697.375976562 },
                  { x = -9524.0+50, y = 13951.0 },
                  { x = -10159.0+50, y = 15161.0 },
                  --正上
                  { x = -10161.0+50, y = 15165.0+50 },
                  { x = -10505.0+50, y = 15301.0+50 },
                  --右上
                  { x = -11139.0, y = 15195.0+50 },
                  { x = -11246.54296875, y = 15152.0+50 },
                  { x = -11387.534179688, y = 15102.0+50 },
                  { x = -11477.895507812, y = 15081.0+100 },
                  --正右
                  { x = -11477.0-100, y = 15081.0+100 },
                  { x = -11581.0-100, y = 14944.0+100 },
                  { x = -13183.0-100, y = 12751.0+100 },
                  { x = -13402.0-100, y = 12368.0+100 },
                  --右下
                  { x = -13402.0-100, y = 12368.0 },
                  { x = -13114.0-100, y = 11460.0 },
                  { x = -13525.0-100, y = 10901.0 },
                  { x = -13646.0-100, y = 10432.0 },
                  { x = -13829.0-100, y = 9044.296875 },
                  --正右
                  { x = -14009.0-100, y = 8451.0+100 },
                  --右下
                  { x = -14009.0-100, y = 8451.4892578125 },
                  { x = -14011.0-100, y = 8371.591796875 },
                  { x = -14016.0-100, y = 8264.0 },
                  { x = -14010.0-100, y = 8159.0 },
                  { x = -14023.0-100, y = 8060.0 },
                  { x = -13957.0-100, y = 8011.0 },
                  --正下
                  { x = -13957.0-100, y = 8011.0-100 },
                  --左下
                  { x = -13957.0, y = 8011.0-100 },
                  { x = -13817.0, y = 7826.0-100 },
                  --正下
                  { x = -13459.0-100, y = 7894.0-100 },
                  --右下
                  { x = -13431.0-100, y = 7697.0 },
                  { x = -13497.0-100, y = 7462.0 },
                  { x = -13476.0-100, y = 7337.0 },
                  { x = -13497.0-100, y = 7280.0 },
                  --正下
                  { x = -13497.0-100, y = 7280.0-100 },
                  --右上
                  { x = -13309.077148438, y = 6471.0+100 },
                  --正右
                  { x = -13309.0-100, y = 6471.0+100 },
                  --右下
                  { x = -13309.0-50, y = 6471.1318359375 },
                  { x = -13359.0-50, y = 6341.0 },
                  --正下
                  { x = -13359.0-100, y = 6341.0-100 },
                  --左下
                  { x = -13359.0, y = 6341.0-100 },
                  { x = -13113.0, y = 6247.0-100 },
                  { x = -12866.0, y = 6196.0-100 },
                  { x = -12698.0, y = 6301.0-100 },
                  --正左
                  { x = -12698.0+100, y = 6301.0-100 },
                  --左上
                  { x = -12713.0+100, y = 6283.5771484375 },
                  { x = -12738.0+100, y = 6425.2885742188 },
                  --左下
                  { x = -12192.0, y = 6924.0-100 },
                  { x = -11733.0, y = 6973.0-100 },
                  { x = -11415.0, y = 6952.0-50 },
                  { x = -10570.0, y = 6279.0-50 },
                  { x = -10031.0, y = 6304.0-50 },
                  { x = -9719.0, y = 6305.0-50 },
                  { x = -7777.0, y = 7096.0-50 },
                  --正左
                  { x = -7777.0+50, y = 7096.0-50 },
                  { x = -7140.0+50, y = 7684.0-50 },
                  { x = -7067.0+50, y = 8011.0-50 },
                  --左上
                  { x = -7067.0+100, y = 8011.0 },
                  { x = -7137.0+100, y = 8115.2827148438 },
                  { x = -7302.0+100, y = 8367.9521484375 },
                  { x = -7473.0+100, y = 8414.0 },
                  --右上
                  { x = -7585.0, y = 8300.0+100 },
                  { x = -8197.0, y = 8009.0+100 },


                  { x = -8662.0+50, y = 8873.0-40 },--true
                  { x = -8533.0+50, y = 9580.0-40 },--false
                  { x = -8408.0+50, y = 9500.0-40 },--false
                  { x = -8408.0+100, y = 9500.0 },--false
                  { x = -8408.0+100, y = 9500.0+100 },--false
              }
            },
        },

        ['红月印迹'] = {
            { name = '红月印迹-碎片山丘',
              area = {
                  --正左
                  { x = 9228.0 + 10, y = -1595.0 - 10 },
                  --左上
                  { x = 9228.0 + 100, y = -1595.9274902344 },
                  { x = 9194.0 + 100, y = -1419.3405761719 },
                  { x = 9091.0 + 100, y = -1349.0 },
                  --右上
                  { x = 9091.0, y = -1349.0 + 100 },
                  { x = 8326.0, y = -1061.0 + 100 },
                  --正上
                  { x = 8100.0 + 100, y = -710.0 + 100 },
                  --正左
                  { x = 8001.0 + 100, y = -333.0 - 100 },
                  { x = 8381.0 + 100, y = -179.0 - 100 },
                  { x = 8376.0 + 100, y = 184.0 - 100 },
                  { x = 8789.0 + 100, y = 603.0 - 100 },
                  { x = 9152.0 + 100, y = 713.0 - 100 },
                  --左上
                  { x = 9152.0 + 100, y = 713.0 },
                  { x = 8991.0 + 100, y = 1001.0 },
                  --正上
                  { x = 8991.0 + 100, y = 1001.0 + 100 },
                  { x = 8605.0 + 100, y = 1355.0 + 100 },
                  --右上
                  { x = 8605.0, y = 1355.0 + 100 },
                  { x = 8463.8203125, y = 1325.0 + 100 },
                  { x = 8289.0, y = 1298.0 + 100 },
                  --右下
                  { x = 8289.0 - 10, y = 1298.0 },
                  { x = 8283.0 - 10, y = 1156.0 },
                  { x = 8257.0 - 10, y = 1031.0 },
                  { x = 8251.0 - 10, y = 909.0 },
                  --正右
                  { x = 8251.0 - 100, y = 909.0 + 100 },
                  { x = 8162.0 - 100, y = 817.0 + 100 },
                  { x = 8060.0 - 100, y = 785.0 + 100 },
                  { x = 7819.0 - 100, y = 511.0 + 100 },
                  --右下
                  { x = 7819.0 - 100, y = 511.0 },
                  { x = 7826.0 - 100, y = 173.0 },
                  --右上
                  { x = 7476.0, y = -68.0 + 100 },
                  { x = 6987.0, y = -43.0 + 100 },
                  { x = 6515.8227539062, y = -235.0 + 100 },
                  { x = 5560.0, y = -165.0 + 100 },
                  { x = 4743.0, y = -613.0 + 100 },
                  { x = 4123.0, y = -835.0 + 100 },
                  --左上
                  { x = 3193.0 + 100, y = -409.0 },
                  { x = 3472.0 + 100, y = 386.0 },
                  { x = 4057.0 + 100, y = 1079.0 },
                  --正左
                  { x = 5145.0 + 100, y = 1752.0 - 100 },
                  { x = 5539.0 + 100, y = 2275.0 - 100 },
                  --左下
                  { x = 5895.11328125, y = 2939.0 - 100 },
                  --正下
                  { x = 6453.0 - 100, y = 2356.0 - 100 },
                  { x = 6571.0 - 100, y = 2249.0 - 100 },
                  --正左
                  { x = 6571.0 + 100, y = 2249.0 - 100 },
                  { x = 7188.0 + 100, y = 2492.0 - 100 },
                  --左上
                  { x = 7296.0 + 100, y = 2720.0 },
                  --正上
                  { x = 7296.0 + 100, y = 2720.0 + 100 },
                  { x = 6398.0 + 100, y = 3700.0 + 100 },
                  { x = 6016.0 + 100, y = 4050.0 + 100 },
                  { x = 5684.0 + 100, y = 4232.0 + 100 },
                  --左上
                  { x = 5237.0 + 100, y = 4709.0 },
                  { x = 5436.0 + 100, y = 5138.0 },
                  { x = 5529.0 + 100, y = 5553.0 },
                  { x = 5737.0 + 100, y = 5967.7866210938 },
                  { x = 5832.0 + 100, y = 6669.408203125 },
                  { x = 5266.0 + 100, y = 8142.4047851562 },
                  --正上
                  { x = 5269.0 + 100, y = 8154.0 + 100 },
                  { x = 5156.0 + 100, y = 8378.0 + 100 },
                  { x = 4806.0 + 100, y = 8805.0 + 100 },
                  { x = 3910.0 + 100, y = 9350.0 + 100 },
                  --右上
                  { x = 3856.0, y = 9382.0 + 100 },
                  { x = 3147.0, y = 9348.0 + 100 },
                  { x = 2708.0, y = 9436.0 + 100 },
                  { x = 2418.4831542969, y = 9647.0 + 100 },
                  { x = 2106.3752441406, y = 9760.0 + 100 },
                  { x = 1382.0, y = 9628.0 + 100 },
                  { x = 1131.0, y = 9762.0 + 100 },
                  { x = 357.00668334961, y = 9783.0 + 100 },
                  { x = -513.0, y = 9826.0 + 100 },
                  { x = -1588.0, y = 9314.0 + 100 },
                  { x = -2723.3178710938, y = 8658.0 + 100 },
                  --正右
                  { x = -2723.0 - 100, y = 8658.0 + 100 },
                  { x = -231.0 - 10000, y = 2782.0 + 10000 },
                  --右下
                  { x = -231.0 - 10000, y = 2782.2863769531 },
                  --正下
                  { x = 187.0 - 1000, y = 1733.0 - 1000 },
                  { x = 1229.0 - 1000, y = -1219.0 - 1000 },
                  { x = 2002.0 - 1000, y = -1903.0 - 1000 },
                  { x = 2391.0 - 1000, y = -2256.0 - 1000 },
                  --左下
                  { x = 3432.3305664062, y = -2420.0 - 100 },
                  { x = 4498.9692382812, y = -2641.0 - 100 },
                  { x = 5258.6142578125, y = -2203.0 - 100 },
                  { x = 6229.4130859375, y = -1743.0 - 100 },
                  --正下
                  { x = 7237.0 - 100, y = -1595.0 - 100 },
                  { x = 7971.0 - 100, y = -1997.0 - 100 },
                  { x = 8323.0 - 100, y = -2068.0 - 100 },
                  --正左
                  { x = 8323.0 + 10, y = -2068.0 - 10 },
                  { x = 8788.0 + 10, y = -1811.0 - 10 },
                  { x = 9001.0 + 10, y = -1721.0 - 10 },
                  { x = 9217.0 + 10, y = -1654.0 - 10 },

              }
            },
            { name = '红月印迹-碎片山丘上边',
              area = {
                  --左上
                  { x = 7180.0 + 100, y = 6358.4033203125 },
                  { x = 7206.0 + 100, y = 6658.0 },
                  { x = 7137.0 + 100, y = 7042.0 },
                  { x = 7113.0 + 100, y = 7249.5874023438 },
                  { x = 6831.0 + 100, y = 7698.0 },
                  { x = 6640.0 + 100, y = 8736.0 },
                  { x = 6477.0 + 100, y = 8931.0 },
                  { x = 5366.0 + 100, y = 10178.0 },
                  --正上
                  { x = 5366.0 + 100, y = 10178.0 + 100 },
                  --右上
                  { x = 5358.0, y = 10201.0 + 100 },
                  { x = 4255.0, y = 10723.0 + 100 },
                  { x = 3204.0, y = 10742.0 + 100 },
                  { x = 2459.0, y = 10680.0 + 100 },
                  { x = 1449.0, y = 10476.0 + 100 },

                  --正右
                  { x = 1449.0 - 100, y = 10476.0 + 100 },
                  --右下
                  { x = 1449.0 - 100, y = 10476.403320312 },
                  --正下
                  { x = 1441.0 - 100, y = 10407.0 - 100 },
                  { x = 1491.0 - 100, y = 10233.0 - 100 },
                  { x = 1819.0 - 100, y = 9995.0 - 100 },
                  --左下
                  { x = 1819.0, y = 9995.0 - 100 },
                  { x = 2186.0, y = 10122.0 - 100 },
                  { x = 2467.0, y = 10213.0 - 100 },
                  { x = 2921.0, y = 10133.0 - 100 },
                  { x = 3609.0, y = 9889.0 - 100 },
                  { x = 4129.0, y = 9879.0 - 100 },
                  { x = 4665.0, y = 9476.0 - 100 },
                  --正下
                  { x = 4760.0 - 100, y = 9391.0 - 100 },
                  { x = 5168.0 - 100, y = 9227.0 - 100 },
                  { x = 5569.0 - 100, y = 8841.0 - 100 },
                  --右下
                  { x = 5706.0 - 100, y = 7957.0 },
                  { x = 5920.0 - 100, y = 7481.0 },
                  --正下
                  { x = 5920.0 - 100, y = 7481.0 - 100 },
                  { x = 6488.0 - 100, y = 6904.0 - 100 },
                  --正右
                  { x = 6409.0 - 100, y = 6697.0 + 100 },
                  { x = 6246.0 - 100, y = 6525.0 + 100 },
                  { x = 6100.0 - 100, y = 6208.0 + 100 },
                  { x = 5873.0 - 100, y = 5730.0 + 100 },
                  --正下
                  { x = 5875.0 - 100, y = 5719.0 - 100 },
                  { x = 5965.0 - 100, y = 5460.0 - 100 },
                  { x = 5959.0 - 100, y = 5293.0 - 100 },
                  { x = 5977.0 - 100, y = 5137.0 - 100 },
                  { x = 6103.0 - 100, y = 5096.0 - 100 },
                  { x = 6284.0 - 100, y = 4926.0 - 100 },
                  { x = 6401.0 - 100, y = 4913.0 - 100 },
                  --正左
                  { x = 6401.0 + 100, y = 4913.0 - 100 },
                  { x = 6495.0 + 100, y = 5044.0 - 100 },
                  { x = 6455.0 + 100, y = 5327.0 - 100 },
                  --左上
                  { x = 6455.0 + 100, y = 5327.0 },
                  { x = 6432.0 + 100, y = 5743.5463867188 },
                  --正左
                  { x = 6744.0 + 20, y = 6130.0 - 20 },
                  { x = 7089.0+20, y = 6301.0-20, },
                  { x = 7059.0 + 20, y = 6350.0 - 20 },

                  { x = 7183.0 + 20, y = 6359.0 - 20 },


              }
            },
            { name = '红月印迹-碎片山丘上边连接受伤的大地',
              area = {
                  --正左
                  { x = 9118.0 + 100, y = 5278.0 - 100 },
                  { x = 9353.0 + 100, y = 5805.0 - 100 },
                  { x = 9562.0 + 100, y = 6219.0 - 100 },
                  --左上
                  { x = 9562.0 + 100, y = 6219.5732421875 },
                  --正上
                  { x = 9562.0 + 100, y = 6219.0 + 100 },
                  { x = 9200.0 + 100, y = 6601.0 + 100 },
                  --右上
                  { x = 9200.0, y = 6601.0 + 100 },
                  { x = 8856.0, y = 6584.0 + 100 },
                  { x = 8406.0, y = 6213.0 + 100 },
                  { x = 8062.0, y = 6291.0 + 100 },
                  { x = 7237.0, y = 6299.0 + 50 },
                  --正右
                  { x = 7237.0 - 50, y = 6299.0 + 50 },
                  { x = 7097.0 - 50, y = 6218.0 + 50 },
                  { x = 6953.0 - 50, y = 6042.0 + 50 },
                  { x = 6885.0 - 100, y = 5909.0 + 100 },
                  --右下
                  { x = 6870.0 - 100, y = 5874.55859375 },
                  --正下
                  { x = 6870.0 - 100, y = 5874.0 - 100 },
                  { x = 7163.0 - 100, y = 5390.0 - 100 },
                  { x = 7289.0 - 100, y = 5179.0 - 100 },
                  { x = 7650.0 - 100, y = 4984.0 - 100 },
                  --左下
                  { x = 7650.0, y = 4984.0 - 100 },
                  --正左
                  { x = 7650.0 + 100, y = 4984.0 - 100 },
                  { x = 8462.0 + 100, y = 5326.0 - 100 },
                  --左下
                  { x = 8846.0, y = 5380.0 - 10 },
                  { x = 8908.0, y = 5347.0 - 10 },
                  { x = 8976.0, y = 5317.0 - 10 },
                  { x = 9056.0, y = 5290.0 - 10 },
                  { x = 9088.0, y = 5258.0 - 10 }, --false
                  { x = 9115.8486328125, y = 5276.0 - 10 },


              }
            },
            { name = '红月印迹-受伤的大地连接碎片山丘电梯',
              area = {
                  --正左
                  { x = 9111.0 + 10, y = 4869.0 - 10 },
                  --正上
                  { x = 9162.0 + 10, y = 5224.0 + 10 },
                  --右上
                  { x = 9162.0, y = 5246.0 + 10 }, --false
                  { x = 9088.0, y = 5258.0 - 1 }, --true
                  --正右
                  { x = 8801.0 - 10, y = 5298.0 + 10 },
                  --正下
                  { x = 8746.0 - 10, y = 4922.0 - 10 },

              }
            },
            { name = '红月印迹-受伤的大地',
              area = {
                  --正上
                  { x = 21205.0 + 100, y = 7966.0 + 100 },
                  { x = 20920.0 + 100, y = 8416.0 + 100 },
                  --正右
                  { x = 20920.0 - 100, y = 8416.0 + 100 },
                  { x = 20815.0 - 100, y = 8384.0 + 100 },
                  { x = 20411.0 - 100, y = 8225.0 + 100 },
                  { x = 19931.0 - 100, y = 7705.0 + 100 },
                  { x = 19629.0 - 100, y = 7667.0 + 100 },
                  { x = 19578.0 - 100, y = 7644.0 + 100 },
                  { x = 19501.0 - 100, y = 7598.0 + 100 },
                  { x = 19382.0 - 100, y = 7548.0 + 100 },
                  --右上
                  { x = 19257.0, y = 7699.0 + 100 }, --false
                  { x = 19208.0, y = 7628.0 + 100 },
                  --正右
                  { x = 19208.0 - 100, y = 7628.0 + 100 },
                  { x = 18967.0 - 100, y = 7123.0 + 100 },
                  { x = 18815.0 - 100, y = 6947.0 + 100 },
                  { x = 18519.0 - 100, y = 6614.0 + 100 },
                  --右上
                  { x = 18079.0, y = 6629.0 + 100 },
                  { x = 17656.0, y = 6564.0 + 100 },
                  --正右
                  { x = 17186.0 - 100, y = 6104.0 + 100 },
                  { x = 16817.0 - 100, y = 6002.0 + 100 },
                  { x = 16487.0 - 100, y = 5685.0 + 100 },
                  { x = 15898.0 - 100, y = 5417.0 + 100 },
                  { x = 15663.0 - 100, y = 5138.0 + 100 },
                  --左上
                  { x = 15014.0 + 100, y = 5454.8471679688 },
                  --正上
                  { x = 15014.0 + 100, y = 5454.0 + 100 },
                  { x = 14845.0 + 100, y = 5698.0 + 100 },
                  --右上
                  { x = 14850.0, y = 5695.0 + 100 },
                  { x = 14311.0, y = 5772.0 + 100 },
                  --正右
                  { x = 14311.0 - 100, y = 5772.0 + 100 },
                  --右下
                  { x = 14311.0 - 100, y = 5772.0 },
                  --正左
                  { x = 13343.0 + 100, y = 5053.0 - 100 },
                  --左上
                  { x = 13343.0 + 100, y = 5053.0219726562 },
                  { x = 13319.0 + 100, y = 5331.52734375 },
                  { x = 12883.0 + 100, y = 5816.0 },
                  --正上
                  { x = 12883.0 + 100, y = 5816.0 + 100 },
                  --右上
                  { x = 12883.0, y = 5816.0 + 100 },
                  --正右
                  { x = 12883.0 - 100, y = 5816.0 + 100 },
                  --右下
                  { x = 12873.0 - 100, y = 5811.9770507812 },
                  { x = 12857.0 - 100, y = 5771.0 },
                  { x = 12852.0 - 100, y = 5714.0 },
                  { x = 12848.0 - 100, y = 5670.0 },
                  { x = 12835.0 - 100, y = 5609.0 },
                  { x = 12804.0 - 100, y = 5558.0 },
                  { x = 12785.0 - 100, y = 5517.9575195312 },
                  --正右
                  { x = 12774.0 - 100, y = 5553.0 + 100 },
                  { x = 12673.0 - 100, y = 5475.0 + 100 },
                  { x = 12612.0 - 100, y = 5441.0 + 100 },
                  --右上
                  { x = 12499.0, y = 5460.0 + 100 },
                  --正上
                  { x = 12496.0 + 100, y = 5461.0 + 100 },
                  { x = 12427.0 + 100, y = 5571.0 + 100 },
                  --正右
                  { x = 12427.0 - 100, y = 5571.0 + 100 },
                  { x = 12161.0 - 100, y = 5271.0 + 100 },
                  --正左
                  { x = 11123.0 + 100, y = 6123.0 - 100 },
                  --正上
                  { x = 11123.0 + 100, y = 6123.0 + 100 },
                  --左上
                  { x = 10697.0 + 50, y = 6519.0 },
                  { x = 10740.0 + 50, y = 6701.0 },
                  { x = 10820.0 + 50, y = 6936.0 },
                  { x = 10854.0 + 50, y = 7052.0 },
                  --正上
                  { x = 10854.0 + 100, y = 7052.0 + 100 },
                  { x = 10560.0 + 100, y = 7453.0 + 100 },
                  { x = 10482.0 + 100, y = 7576.0 + 100 },
                  --右上
                  { x = 10482.0, y = 7576.0 + 50 },
                  { x = 10367.0, y = 7500.0 + 50 },
                  { x = 10101.0, y = 7621.0 + 50 },
                  { x = 9929.0, y = 7590.0 + 50 },
                  --正右
                  { x = 9929.0 - 100, y = 7590.0 + 50 },
                  --右下
                  { x = 9929.0 - 50, y = 7590.0 + 50 },
                  { x = 9900.0 - 50, y = 7460.0 + 50 },
                  { x = 9880.0 - 50, y = 7373.0 + 50 },
                  { x = 9827.0 - 50, y = 7229.0 + 50 },
                  --正右
                  { x = 9827.0 - 50, y = 7229.0 + 50 },
                  { x = 9779.0 - 50, y = 7192.0 + 50 },
                  --正下
                  { x = 9779.0 - 50, y = 7192.0 - 50 },
                  { x = 9993.0 - 50, y = 7019.0 - 50 },
                  { x = 10048.0 - 50, y = 6805.0 - 50 },
                  --右下
                  { x = 10127.0 - 100, y = 6593.6875 },
                  { x = 10133.0 - 100, y = 6166.6376953125 },
                  --正右
                  { x = 9908.0 - 100, y = 5974.0 + 100 },
                  { x = 9713.0 - 100, y = 5681.0 + 100 },
                  { x = 9508.0 - 100, y = 5327.0 + 100 },
                  { x = 9371.0 - 10, y = 5081.0 + 10 },
                  { x = 9190.0 - 10, y = 5026.0 + 10 },
                  --右下
                  { x = 9190.0 - 5, y = 5026.0 },
                  { x = 9186.0 - 5, y = 4988.0 },
                  { x = 9184.0 - 5, y = 4962.0 },

                  { x = 9166.0 - 5, y = 4899.5366210938 },
                  { x = 9135.0 - 5, y = 4888.0 }, --false
                  { x = 9123.0-5, y = 4884.0+5 },--false
                  { x = 9123.0-5, y = 4880.0+5 },--false

                  { x = 9124.0-5, y = 4875.0+5 },--false

                  { x = 9109.0-5, y = 4864.9184570312 },--false

                  { x = 9104.0 - 5, y = 4856.0 },


                  { x = 9089.0 - 10, y = 4839.0 },
                  --正右
                  { x = 9032.0 - 10, y = 4810.0 + 10 },
                  --右上
                  { x = 9028.5380859375, y = 4818.0 + 10 },--false
                  { x = 8992.998046875, y = 4825.0 + 10 },--false
                  { x = 8960.974609375, y = 4845.0 + 10 },--false


                  { x = 8992.0, y = 4806.0 + 10 },
                  { x = 8983.0, y = 4829.0+10 },--false
                  { x = 8980.0, y = 4853.0 + 10 }, --false
                  { x = 8979.0, y = 4840.0+10 },
                  { x = 8955.51171875, y = 4848.0 + 10 },--false
                  { x = 8955.0+10, y = 4819.0 + 10 },



                  { x = 8946.0+10, y = 4856.0 + 10 }, --false
                  { x = 8928.0+10, y = 4874.0 +10},--false
                  { x = 8893.0+10, y = 4879.0+10 },--false
                  { x = 8885.0+10, y = 4883.0+10 },--false
                  { x = 8882.0+10, y = 4879.0 + 10 },--false
                  { x = 8881.0+10, y = 4846.0 + 10 },
                  { x = 8870.0+10, y = 4865.0+10 },--false
                  { x = 8877.0+10, y = 4883.0+10 },--false
                  { x = 8769.0+10, y = 4893.0+10 },--false
                  { x = 8844.0+10, y = 4885.0+10 },
                  { x = 8822.0+10, y = 4890.0+10 },--false
                  { x = 8821.0+10, y = 4872.0 + 10 },
                  { x = 8807.0, y = 4889.0+5 },
                  { x = 8770.0, y = 4895.0+5 },
                  { x = 8766.0+5, y = 4896.0+5 },
                  { x = 8761.0, y = 4889.0 + 5 },

                  --正上
                  { x = 8737.0 + 5, y = 4911.0 + 5 },
                  { x = 8746.0 - 5, y = 4928.0 - 5 }, --true
                  --左上
                  { x = 8763.0 - 10, y = 5034.5517578125 }, --true
                  { x = 8758.0 - 10, y = 5003.7661132812 }, --true
                  --{ x = 8704.0+50, y = 4947.541015625 },
                  --{ x = 8716.0+100, y = 4999.5151367188 },
                  --{ x = 8718.0+100, y = 5015.0 },
                  --右上
                  { x = 8718.0, y = 5015.0 + 100 },
                  --正右
                  { x = 8718.0 - 100, y = 5015.0 + 100 },
                  { x = 8553.0 - 100, y = 4861.0 + 100 },
                  { x = 8468.0 - 100, y = 4019.0 + 100 },
                  { x = 8242.0 - 100, y = 3301.0 + 100 },
                  { x = 8160.0 - 100, y = 2628.0 + 100 },
                  { x = 7419.0 - 100, y = 2235.0 + 100 },
                  { x = 7127.0 - 100, y = 1882.0 + 100 },
                  --右上
                  { x = 6891.0, y = 1917.0 + 100 },
                  { x = 6139.0, y = 2048.0 + 100 },
                  --正右
                  { x = 6139.0 - 100, y = 2048.0 + 100 },
                  { x = 5878.0 - 100, y = 1922.0 + 100 },
                  { x = 5715.0 - 100, y = 1760.0 + 100 },
                  { x = 5531.0 - 100, y = 1250.0 + 100 },
                  { x = 5035.0 - 100, y = 851.0 + 100 },
                  --右下
                  { x = 5035.0 - 100, y = 851.81646728516 },
                  --正下
                  { x = 5035.0 - 100, y = 851.0 - 100 },
                  { x = 5115.0 - 100, y = 622.0 - 100 },
                  { x = 5235.0 - 100, y = 357.0 - 100 },
                  --左下
                  { x = 5235.0, y = 357.0 - 100 },
                  { x = 6953.0, y = 657.0 - 100 },
                  { x = 7868.0, y = 952.0 - 100 },
                  --正左
                  { x = 7868.0 + 100, y = 952.0 - 100 },
                  --正上
                  { x = 7868.0 + 100, y = 952.0 + 100 },

                  --左上
                  { x = 7809.0 + 100, y = 1363.0 },
                  --左下
                  { x = 8074.0, y = 1424.0 - 100 },
                  --正左
                  { x = 8074.0 + 100, y = 1424.0 - 100 },
                  { x = 8661.0 + 100, y = 1733.0 - 100 },
                  { x = 9055.0 + 100, y = 1907.0 - 100 },
                  --正下
                  { x = 9372.0 - 100, y = 1783.0 - 100 },
                  --右下
                  { x = 9757.0 - 100, y = 1149.0 },
                  --正右
                  { x = 9780.0 - 100, y = 708.0 + 100 },
                  { x = 9387.0 - 100, y = 255.0 + 100 },
                  { x = 9034.0 - 100, y = 6.0 + 100 },
                  --右上
                  { x = 9034.0, y = 6.0 + 100 },
                  { x = 8672.0, y = -105.0 + 100 },
                  --正右
                  { x = 8672.0 - 100, y = -105.0 + 100 },
                  { x = 8551.0 - 100, y = -342.0 + 100 },
                  --正下
                  { x = 8551.0 - 100, y = -342.0 - 100 },
                  --左下
                  { x = 8551.0, y = -342.0 - 100 },
                  { x = 8769.0, y = -352.0 - 100 },
                  { x = 9112.0, y = -336.0 - 100 },
                  --右下
                  { x = 9751.0 - 100, y = -683.64685058594 },
                  { x = 9910.0 - 100, y = -1222.0 },
                  --正右
                  { x = 9762.0 - 100, y = -1501.0 + 100 },
                  { x = 9563.0 - 100, y = -1663.0 + 100 },
                  { x = 9523.0 - 100, y = -1815.0 + 100 },
                  { x = 9393.0 - 100, y = -2065.0 + 100 },
                  --右上
                  { x = 9162.0, y = -2177.0 + 100 },
                  { x = 8916.0, y = -1942.0 + 100 },
                  --正右
                  { x = 8916.0 - 100, y = -1942.0 + 100 },
                  { x = 8773.0 - 100, y = -2132.0 + 100 },
                  { x = 8472.0 - 100, y = -2338.0 + 100 },
                  --右下
                  { x = 8472.0 - 100, y = -2338.0 },
                  --正下
                  { x = 8472.0 - 100, y = -2338.0 - 100 },
                  { x = 8553.0 - 100, y = -2680.0 - 100 },
                  { x = 8857.0 - 100, y = -3097.0 - 100 },
                  --左下
                  { x = 8857.0, y = -3097.0 - 100 },
                  { x = 15217.852539062, y = -3103.0 - 100 },
                  { x = 17747.16796875, y = -2827.0 - 100 },
                  { x = 19430.603515625, y = -1643.0 - 100 },
                  { x = 20233.83984375, y = -713.0 - 100 },
                  --正左
                  { x = 20233.0 + 100, y = -713.0 - 100 },
                  --左上
                  { x = 20233.0 + 100, y = -713.51910400391 },
                  --正上
                  { x = 20261.0 + 100, y = -712.0 + 100 },
                  { x = 19921.0 + 100, y = 28.0 + 100 },
                  { x = 18440.0 + 100, y = 428.0 + 100 },
                  --左下
                  { x = 18420.0, y = 2419.0 - 100 },
                  --正左
                  { x = 18420.0 + 100, y = 2419.0 - 100 },
                  { x = 19056.0 + 100, y = 2940.0 - 100 },
                  { x = 19920.0 + 100, y = 4444.0 - 100 },
                  { x = 20394.0 + 100, y = 5361.0 - 100 },
                  { x = 20727.0 + 100, y = 6508.0 - 100 },
                  { x = 21205.0 + 100, y = 7966.0 - 100 },
              }
            },
            { name = '红月印迹-沉默之环一',
              area = {
                  --正上
                  { x = 21402.0+100, y = 3591.0+100 },
                  { x = 20944.0+100, y = 3689.0+100 },
                  --右上
                  { x = 20813.0, y = 3664.0+100 },
                  { x = 20732.0, y = 3676.0+100 },
                  --正右
                  { x = 20732.0-100, y = 3676.0+100 },
                  { x = 20440.0-100, y = 3401.0+100 },
                  { x = 19594.0-100, y = 2452.0+100 },
                  { x = 19422.0-100, y = 2096.0+100 },
                  { x = 19250.0-100, y = 1681.0+100 },
                  --右下
                  { x = 19250.0-100, y = 1681.0 },
                  --正下
                  { x = 19250.0-100, y = 1681.0-100 },
                  { x = 19664.0-100, y = 1406.0-100 },
                  --左下
                  { x = 19664.0, y = 1406.0-100 },
                  { x = 19902.0, y = 1412.0-100 },
                  { x = 20198.0, y = 1319.0-100 },
                  --正左
                  { x = 20198.0+100, y = 1319.0-100 },
                  { x = 20668.0+100, y = 1707.0-100 },
                  { x = 20799.0+100, y = 1951.0-100 },
                  { x = 20909.0+100, y = 2430.0-100 },
                  { x = 21071.0+100, y = 2702.0-100 },
                  { x = 21218.0+100, y = 3155.0-100 },
                  --左上
                  { x = 21218.0+50, y = 3155.0 },
                  { x = 21461.0-10, y = 3546.0 },--true

              }
            },
            { name = '红月印迹-沉默之环二',
              area = {
                  --正上
                  { x = 22230.0+100, y = 4903.0+100 },
                  --右上
                  { x = 22230.0, y = 4903.0+100 },
                  { x = 21328.0, y = 4931.0+100 },
                  { x = 21041.0, y = 4877.0+100 },
                  --正右
                  { x = 21041.0-100, y = 4877.0+100 },
                  { x = 20945.0-100, y = 4809.0+100 },
                  { x = 20880.0-100, y = 4319.0+100 },
                  --正下
                  { x = 20880.0-100, y = 4319.0-100 },
                  --左下
                  { x = 20880.322265625, y = 4319.0-100 },
                  { x = 21024.017578125, y = 4276.0-100 },
                  { x = 21235.0, y = 4240.0-100 },
                  --正下
                  { x = 21749.0-100, y = 4277.0-100 },
                  --右上
                  { x = 21466.0, y = 3588.0+100 },
                  --正右
                  { x = 21466.0-50, y = 3588.0+50 },
                  --右下
                  { x = 21474.0-50, y = 3586.1477050781 },
                  { x = 21483.0-50, y = 3461.0 },
                  { x = 21426.0-100, y = 3329.0 },
                  { x = 21435.0-100, y = 3191.0 },
                  --正下
                  { x = 21435.0-100, y = 3191.0-100 },
                  { x = 21657.0-100, y = 2813.0-100 },
                  { x = 21817.0-100, y = 2645.0-100 },
                  --正左
                  { x = 21792.0+100, y = 2650.0-100 },
                  { x = 22085.0+100, y = 3035.0-100 },
                  { x = 22284.0+100, y = 3388.0-100 },
                  { x = 22455.0+100, y = 3767.0-100 },
                  --左上
                  { x = 22450.0+100, y = 3784.0 },
                  { x = 22418.0+100, y = 4087.0 },
                  { x = 22407.0+100, y = 4503.0 },
                  { x = 22230.0+100, y = 4903.3486328125 },

              }
            },
            { name = '红月印迹-沉默之环三',
              area = {
                  --正上
                  { x = 23457.0+100, y = 6704.0+100 },--false
                  --右上
                  { x = 23457.0, y = 6704.0+100 },
                  { x = 23179.0, y = 6784.0+100 },
                  { x = 22792.0, y = 6730.0+100 },
                  --正右
                  { x = 22792.0-100, y = 6730.0+100 },
                  { x = 22389.0-100, y = 6405.0+100 },
                  { x = 22139.0-100, y = 6225.0+100 },
                  { x = 21979.0-100, y = 5995.0+100 },
                  { x = 21872.0-100, y = 5717.0+100 },
                  --右下
                  { x = 21872.0-100, y = 5717.0 },
                  --正下
                  { x = 21876.0-100, y = 5723.0-100 },
                  { x = 21947.0-100, y = 5623.0-100 },
                  { x = 22013.0-100, y = 5487.0-100 },
                  { x = 22223.0-100, y = 5403.0-100 },
                  --正左
                  { x = 22234.0+100, y = 5412.0-100 },
                  { x = 22566.0+100, y = 5466.0-100 },
                  { x = 22931.0+100, y = 5422.0-100 },
                  { x = 23216.0+100, y = 5607.0-100 },
                  { x = 23421.0+100, y = 5846.0-100 },
                  { x = 23476.0+100, y = 6202.0-100 },
                  { x = 23398.0+100, y = 6520.0-100 },
                  { x = 23457.0+100, y = 6704.0-100 },






              }
            },
            { name = '红月印迹-遗忘废墟上方',
              area = {
                  --正上
                  { x = 19677.0+100, y = 8322.0+100 },
                  { x = 19397.0+100, y = 9404.0+100 },
                  { x = 19127.0+100, y = 9713.0+100 },
                  { x = 18588.0+100, y = 10643.0+100 },
                  { x = 18403.0+100, y = 11148.0+100 },
                  --正右
                  { x = 18403.0-100, y = 11148.0+100 },
                  { x = 18177.0-100, y = 11031.0+100 },
                  { x = 17807.0-100, y = 10834.0+100 },
                  { x = 17755.0-100, y = 10622.0+100 },
                  --正下
                  { x = 17755.0-100, y = 10634.0-100 },
                  { x = 17665.0-100, y = 10331.0-100 },
                  { x = 17714.0-100, y = 10214.0-100 },
                  { x = 17962.0-100, y = 10226.0-100 },
                  { x = 18289.0-100, y = 8738.0-100 },
                  { x = 18650.0-100, y = 8016.0-100 },
                  --正左
                  { x = 18678.0+100, y = 7943.0-100 },
                  { x = 18886.0+100, y = 7884.0-100 },
                  { x = 19259.0+100, y = 8025.0-100 },
                  { x = 19687.0+100, y = 8312.0-100 },

              }
            },
            { name = '红月印迹-遗忘废墟',
              area = {
                  --左上
                  { x = 18312.0+100, y = 7851.0 },
                  { x = 18335.0+100, y = 8110.0 },
                  { x = 18211.0+100, y = 8345.0 },
                  { x = 17779.0+100, y = 8932.0 },
                  { x = 17073.0+100, y = 9721.0 },
                  { x = 16789.0+100, y = 10018.215820312 },
                  --正上
                  { x = 16789.0+100, y = 10018.0+100 },
                  --右上
                  { x = 16790.0, y = 10018.0+100 },
                  { x = 16402.0, y = 10006.0+100 },
                  { x = 16059.0, y = 9787.0+100 },
                  { x = 15359.0, y = 9451.0+100 },
                  { x = 14811.0, y = 9156.0+100 },
                  { x = 14330.0, y = 9000.0+100 },
                  { x = 13734.0, y = 9182.0+100 },
                  --正右
                  { x = 13734.0-100, y = 9182.0+100 },
                  { x = 13558.0-100, y = 9039.0+100 },
                  { x = 13410.0-100, y = 8546.0+100 },
                  { x = 13027.0-100, y = 8318.0+100 },

                  { x = 12923.0-100, y = 8057.0+100  },
                  { x = 12683.0-100, y = 7866.0+100  },
                  { x = 12200.0-100, y = 7540.0+100  },
                  { x = 11754.0-100, y = 7607.0+100  },
                  { x = 11473.0-100, y = 7533.0+100  },
                  { x = 11012.0-100, y = 7188.0+100  },
                  --右下
                  { x = 11012.0-50, y = 7188.0 },
                  { x = 10858.0-50, y = 6826.697265625 },
                  { x = 10858.0-50, y = 6697.3989257812 },
                  --正下
                  { x = 10858.0-100, y = 6697.0-100 },
                  --左下
                  { x = 10858.0, y = 6696.0-100 },
                  { x = 11193.0, y = 6584.0-100 },
                  { x = 11447.0, y = 6449.0-100 },
                  --正左
                  { x = 11447.0+100, y = 6449.0-100 },
                  --正下
                  { x = 12287.0-100, y = 6233.0-100 },
                  { x = 12632.0-100, y = 5953.0-100 },
                  --正左
                  { x = 12632.0+100, y = 5953.0-100 },
                  { x = 13015.0+100, y = 6132.0-100 },
                  --左下
                  { x = 14136.0, y = 6392.0-100 },
                  { x = 15024.0, y = 6486.0-100 },
                  { x = 15459.0, y = 6481.0-100 },
                  { x = 16339.0, y = 6236.0-100 },
                  { x = 16766.0, y = 6638.0-100 },
                  { x = 17351.0, y = 6692.0-100 },
                  { x = 17840.0, y = 6836.0-100 },
                  { x = 17968.0, y = 7008.0-100 },
                  --正左
                  { x = 17968.0+100, y = 7008.0-100 },
                  --左上
                  { x = 17968.0+100, y = 7008.9750976562 },
                  --正左
                  { x = 18312.0+100, y = 7852.0-100 },



              }
            },
            { name = '红月印迹-罪恶洞穴',
              area = {
                  --正左
                  { x = 9763.0+50, y = 7399.0-50 },
                  { x = 9931.0+50, y = 7712.0-50 },
                  { x = 10413.0+100, y = 8240.0-100 },
                  --左下
                  { x = 11151.686523438, y = 8568.0-100 },
                  { x = 11459.0, y = 8455.0-100 },
                  --正左
                  { x = 11459.0+100, y = 8455.0-100 },
                  { x = 12619.0+100, y = 8933.0-100 },
                  { x = 12468.0+100, y = 8873.0-100 },
                  { x = 12984.0+100, y = 9306.0-100 },
                  { x = 13444.0+100, y = 9582.0-100 },
                  { x = 14017.0+100, y = 9880.0-100 },
                  { x = 14274.0+100, y = 10267.0-100 },
                  { x = 15746.0+100, y = 12449.0-100 },
                  { x = 16125.0+100, y = 12685.0-100 },
                  { x = 16233.0+100, y = 13082.0-100 },
                  { x = 16729.0+100, y = 13398.0-100 },
                  { x = 17100.0+100, y = 14219.0-100 },
                  { x = 17370.0+100, y = 15110.0-100 },
                  { x = 17960.0+100, y = 16046.0-100 },
                  { x = 18146.0+100, y = 19394.0-100 },
                  { x = 18458.0+100, y = 19993.0-100 },
                  --左上
                  { x = 18458.0+100, y = 19993.0 },
                  --正上
                  { x = 18431.0+100, y = 20146.0+100 },
                  { x = 17749.0+100, y = 20507.0+100 },
                  --右上
                  { x = 17659.0, y = 20490.0+100 },
                  { x = 16332.596679688, y = 21362.0+100 },
                  { x = 14996.948242188, y = 21561.0+100 },
                  { x = 14095.09375, y = 21778.0+100 },
                  { x = 13120.212890625, y = 21966.0+100 },
                  { x = 12205.908203125, y = 21913.0+100 },
                  { x = 10664.545898438, y = 22315.0+100 },
                  { x = 9570.6787109375, y = 21819.0+100 },
                  { x = 8110.42578125, y = 21785.0+100 },
                  { x = 6212.7392578125, y = 21221.0+100 },
                  { x = 2569.7797851562, y = 20813.0+100 },
                  { x = 1019.2506103516, y = 21413.0+100 },
                  { x = -108.28958892822, y = 20733.0+100 },
                  --正右
                  { x = -112.0-100, y = 20747.0+100 },
                  { x = -584.0-100, y = 20473.0+100 },
                  { x = -944.0-100, y = 20380.0+100 },
                  { x = -1310.0-100, y = 19955.0+100 },
                  { x = -1593.0-100, y = 19445.0+100 },
                  --右下
                  { x = -2479.0-100, y = 17927.0 },
                  { x = -2031.0-100, y = 16218.0 },
                  { x = -1951.0-100, y = 15522.0 },
                  { x = -2225.0-100, y = 14853.0 },
                  { x = -2336.0-100, y = 14010.0 },
                  --正下
                  { x = -2329.0-100, y = 14004.0-100 },
                  { x = -1950.0-100, y = 13468.0-100 },
                  { x = -861.0-100, y = 12962.0-100 },
                  { x = 1224.0-100, y = 11448.0-100 },
                  --左下
                  { x = 1211.9371337891, y = 11449.0-100 },
                  { x = 2190.0, y = 12094.0-100 },
                  --正下
                  { x = 4048.0-100, y = 12357.0-100 },
                  { x = 6626.0-100, y = 11809.0-100 },
                  --右下
                  { x = 8063.0-100, y = 9652.609375 },
                  { x = 7856.0-100, y = 8671.4814453125 },
                  { x = 8201.0-100, y = 8078.0 },
                  --正下
                  { x = 8201.0-100, y = 8078.0-100 },
                  { x = 8420.0-100, y = 7832.0-100 },
                  { x = 9213.0-100, y = 7633.0-100 },
                  { x = 9763.0-100, y = 7399.0-100 },
                  --正左
                  { x = 9763.0+50, y = 7399.0-50 },
              }
            },
            { name = '红月印迹-半魔人居住地',
              area = {
                  --正上
                  { x = 2530.0+100, y = 49410.0+100 },
                  { x = 2305.0+100, y = 49699.0+100 },
                  { x = 2076.0+100, y = 49909.0+100 },
                  { x = -1650.0+100, y = 51954.0+100 },
                  --右上
                  { x = -1650.0, y = 51954.0+100 },
                  { x = -2326.0, y = 52016.0+100 },
                  { x = -2741.0, y = 51914.0+100 },
                  --正右
                  { x = -2741.0-100, y = 51914.0+100 },
                  --右下
                  { x = -2839.0-100, y = 51858.09375 },
                  { x = -2832.0-100, y = 51354.0 },
                  { x = -2853.0-100, y = 49418.0 },
                  { x = -2853.0-100, y = 49202.0 },
                  { x = -2358.0-100, y = 47561.0 },
                  --正下
                  { x = -2352.0-100, y = 47595.0-100 },
                  --左下
                  { x = -2352.4660644531, y = 47595.0-1000 },
                  { x = -2023.8642578125, y = 47542.0-1000 },
                  { x = 1831.0, y = 46430.0-100 },
                  { x = 2113.0, y = 46430.0-100 },
                  --正左
                  { x = 2113.0+100, y = 46430.0-100 },
                  --左上
                  { x = 2113.0+100, y = 46430.0 },
                  { x = 2159.0+100, y = 46706.0 },
                  { x = 2427.0+100, y = 48256.0 },
                  { x = 2499.0+100, y = 48547.0 },
                  { x = 2488.0+100, y = 49168.0 },
                  { x = 2530.0+100, y = 49410.0 },

              }
            },
        },

        ['卡拉贾村'] = {
            {
                name = '亡者峡谷-左',
                area = {
                    { x = 1572.0 + 200, y = -1048.0 },--false 无区域 战：false
                    { x = 1550.0 + 100, y = 40.0 },--false 无区域 战：false
                    { x = 1550.0, y = 40.0 + 50 },--false 无区域 战：false
                    { x = 1281.0 - 30, y = 23.0 + 30 },--false 无区域 战：false
                    { x = 319.0 - 500, y = -345.0 + 500 },--false 无区域 战：false

                    { x = 253.0 - 300, y = -428.0 - 300 },--false 无区域 战：false
                    { x = -105.0- 100 , y = -1592.0 },--false 无区域 战：false
                    { x = -105.0 - 100, y = -1592.0 - 100 },--false 无区域 战：false
                    { x = 117.0, y = -2213.0 - 1000 },--false 无区域 战：false
                    { x = 728.0 + 300, y = -2202.0 - 300 },--false 无区域 战：false
                },
            },
            {
                name = '亡者峡谷-上',
                area = {
                    { x = 1912.0 + 300, y = 816.0 },--false 无区域 战：false
                    { x = 1912.0 + 300, y = 816.0 + 300 },--false 无区域 战：false
                    { x = 1635.0 + 300, y = 1275.0 + 300 },--false 无区域 战：false
                    { x = 450.0 + 200, y = 2424.0 + 200 },--false 无区域 战：false
                    { x = 450.0 - 100, y = 2424.0 + 100 },--false 无区域 战：false
                    { x = -232.0 - 100, y = 2216.0 },--false 无区域 战：false
                    { x = -255.0 - 50, y = 2000.0 - 50 },--false 无区域 战：false
                    { x = -187.0 - 50, y = 1867.0 - 50 },--false 无区域 战：false
                    { x = 150.0, y = 1859.0 - 100 },--false 无区域 战：false
                    { x = 1276.0 - 50, y = 596.0 - 50 },--false 无区域 战：false
                    { x = 1276.0 + 50, y = 596.0 - 50 },--false 无区域 战：false
                    { x = 1689.0 + 300, y = 594.0 - 300 },--false 无区域 战：false
                },
            },
            {
                name = '亡者峡谷-右',
                area = {
                    { x = -580.0 + 50, y = 1636.0 },--false 无区域 战：false
                    { x = -647.0 + 20, y = 1912.0 + 20 },--false 无区域 战：false
                    { x = -647.0 - 100, y = 1912.0 + 100 },--false 无区域 战：false
                    { x = -1819.0 + 600, y = 2530.0 + 600 },--false 无区域 战：false
                    { x = -3374.0 + 600, y = 4307.0 + 600 },--false 无区域 战：false
                    { x = -3374.0 - 500, y = 4307.0 + 500 },--false 无区域 战：false
                    { x = -4035.0 - 100, y = 3592.0 },--false 无区域 战：false
                    { x = -4014.0 - 200, y = 3223.0 - 200 },--false 无区域 战：false
                    { x = -2735.0 - 300, y = 799.0 - 300 },--false 无区域 战：false
                    { x = -1810.0 - 100, y = 460.0 - 100 },--false 无区域 战：false
                    { x = -1810.0 + 50, y = 460.0 - 50 },--false 无区域 战：false
                    { x = -1502.0 + 30, y = 665.0 - 30 },--false 无区域 战：false
                    { x = -594.0 + 100, y = 1614.0 - 100 },--false 无区域 战：false
                },
            },
            {
                name = '亡者峡谷-下',
                area = {
                    { x = -913.0 + 300, y = -770.0 - 300 },--false 无区域 战：false
                    { x = -913.0 + 200, y = -770.0 + 200 },--false 无区域 战：false
                    { x = -1537.0 + 100, y = 99.0 + 100 },--false 无区域 战：false
                    { x = -1537.0 - 50, y = 99.0 + 50},--false 无区域 战：false
                    { x = -1814.0 - 20, y = -235.0 + 20},--false 无区域 战：false
                    { x = -1814.0 - 200, y = -235.0 - 200 },--false 无区域 战：false
                    { x = -1715.0 - 100, y = -1117.0 - 100 },--false 无区域 战：false
                    { x = -905.0 - 100, y = -1911.0 - 100 },--false 无区域 战：false
                    { x = -905.0 + 100, y = -1911.0 - 100 },--false 无区域 战：false
                    { x = -694.0 + 50, y = -1632.0 },--false 无区域 战：false
                },
            },
        },

        ['摩可可村'] = {
            {
                name = '主区',
                area = {
                    { x = 4192.0 + 15000, y = 4591.0 + 15000 },--false 无区域 战：false
                    { x = 4192.0 - 15000, y = 4591.0 + 15000 },--false 无区域 战：false
                    { x = 4192.0 - 15000, y = 4591.0 - 15000 },--false 无区域 战：false
                    { x = 4192.0 + 15000, y = 4591.0 - 15000 },--false 无区域 战：false
                },
                min_cz = nil,
                overlap = {
                    --    ['主岛分区1'] = 1, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['村长家'] = 1,
                },
            },
            {
                name = '村长家',
                area = {
                    { x = 8931 + 150, y = 5521 - 150 },
                    { x = 8922 + 100, y = 5888 },
                    { x = 8922, y = 5888 + 100 },
                    { x = 8544 + 100, y = 6099 + 100 },
                    { x = 8544 - 100, y = 6099  + 100},
                    { x = 8295 - 150, y = 5905 },
                    { x = 8347 - 300, y = 5571 - 300 },
                    { x = 8609 - 50, y = 5363 - 50 },
                    { x = 8609 + 100, y = 5363 - 100 },
                },
                min_cz = -5000,
            },
        },
        -------------------------------------------------------------------------------------
        -- 以下岛屿
        ['海上乐园佩托'] = {
            {
                name = '码头',
                area = {
                    { x = 7732.0 + 500, y = -9976.0 - 500 },--false 无区域 战：false
                    { x = 7732.0 + 500, y = -9976.0 + 500 },--false 无区域 战：false
                    { x = 8047.0 + 500, y = -6481.0 },--false 无区域 战：false
                    { x = 8002.0 + 500, y = -6169.0 + 500 },--false 无区域 战：false
                    { x = 7992.0 + 300, y = -3890.0 + 300 },--false 无区域 战：false
                    { x = 7732.0 + 300, y = -2571.0 + 300 },--false 无区域 战：false
                    { x = 7109.0 + 300, y = -2571.0 + 300 },--false 无区域 战：false
                    { x = 7109.0 - 300, y = -2571.0 + 300 },--false 无区域 战：false
                    { x = 5017.0 - 200, y = -5411.0 + 200 },--false 无区域 战：false
                    { x = 3200.0 - 200, y = -6921.0 + 200 },--false 无区域 战：false
                    { x = 3007.0 - 100, y = -7211.0 - 100 },--false 无区域 战：false
                    { x = 3263.0 - 100, y = -7583.0 - 100 },--false 无区域 战：false
                    { x = 7115.0 - 100, y = -9981.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '船上甲板',
                area = {
                    { x = 24802.0 - 200, y = 1529.0 - 200 },--false 无区域 战：false
                    { x = 27354.0 - 200, y = 1149.0 - 200 },--false 无区域 战：false
                    { x = 27354.0 + 500, y = 1149.0 - 500 },--false 无区域 战：false
                    { x = 29373.0 - 200, y = 1142.0 - 200 },--false 无区域 战：false
                    { x = 29373.0 + 200, y = 1142.0 - 200 },--false 无区域 战：false
                    { x = 38874.0 - 200, y = 1854.0 - 200 },--false 无区域 战：false
                    { x = 38874.0 + 200, y = 1854.0 - 200 },--false 无区域 战：false
                    { x = 38874.0 + 200, y = 1854.0 + 200 },--false 无区域 战：false
                    { x = 39695.0 + 200, y = 3051.0 },--false 无区域 战：false
                    { x = 40028.0 + 50, y = 4163.0 + 50 },--false 无区域 战：false
                    { x = 40029.0 + 50, y = 5588.0 + 50 },--false 无区域 战：false
                    { x = 38889.0 + 50, y = 6041.0 + 50 },--false 无区域 战：false
                    { x = 38816.0 + 50, y = 7081.0 + 50 },--false 无区域 战：false
                    { x = 34278.0 + 100, y = 7128.0 + 100 },--false 无区域 战：false
                    { x = 28848.0, y = 7510.0 + 100 },--false 无区域 战：false
                    { x = 28412.0 - 100, y = 7509.0 + 100 },--false 无区域 战：false
                    { x = 28412.0 - 100, y = 7509.0 - 100 },--false 无区域 战：false
                    { x = 28428.0 - 100, y = 6889.0 - 100 },--false 无区域 战：false
                    { x = 29342.0 - 100, y = 6348.0 - 100 },--false 无区域 战：false
                    { x = 29472.0 - 300, y = 4648.0 + 300 },--false 无区域 战：false
                    { x = 29472.0 - 400, y = 3980.0 - 400 },--false 无区域 战：false
                    { x = 28852.0 - 50, y = 2659.0 + 50 },--false 无区域 战：false
                    { x = 27792.0 - 20, y = 2054.0 + 20 },--false 无区域 战：false
                    { x = 26396.0 - 20, y = 2138.0 + 20 },--false 无区域 战：false
                    { x = 24802.0 - 50, y = 2119.0 + 50 },--false 无区域 战：false
                    { x = 24802.0 - 100, y = 2119.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '商业街',
                area = {
                    { x = 8522.0 + 200, y = 7359.0 },--false 无区域 战：false
                    { x = 8522.0 + 200, y = 7359.0 + 200 },--false 无区域 战：false
                    { x = 8551.0 + 200, y = 12488.0 + 200 },--false 无区域 战：false
                    { x = 7480.0 + 100, y = 13629.0 + 100 },--false 无区域 战：false
                    { x = 7480.0, y = 13629.0 + 100 },--false 无区域 战：false
                    { x = 6982.0 - 300, y = 13627.0 + 300 },--false 无区域 战：true
                    { x = 4042.0, y = 12489.0 + 300 },--false 无区域 战：false
                    { x = 4042.0 - 300, y = 12489.0 - 300 },--false 无区域 战：false
                    { x = 3900.0 - 100, y = 10849.0 - 100 },--false 无区域 战：false
                    { x = 3842.0 - 100, y = 7881.0 - 100 },--false 无区域 战：false
                    { x = 4602.0 + 300, y = 7759.0 - 300 },--false 无区域 战：false
                    { x = 5181.0 - 100, y = 7349.0 - 100 },--false 无区域 战：false
                    { x = 6553.0 + 200, y = 7359.0 - 200 },--false 无区域 战：false

                },
                min_cz = nil,
            },
            {
                name = '冰室',
                area = {
                    { x = -7409.0 + 300, y = -7471.0 },--false 无区域 战：false
                    { x = -7322.0 + 300, y = -5894.0 + 300 },--false 无区域 战：false
                    { x = -8458.0 + 100, y = -4426.0 + 100 },--false 无区域 战：false
                    { x = -8888.0 - 300, y = -4393.0 + 300 },--false 无区域 战：false
                    { x = -10729.0 - 300, y = -5714.0 + 300 },--false 无区域 战：false
                    { x = -10729.0 - 300, y = -5714.0 - 300 },--false 无区域 战：false
                    { x = -10968.0 - 100, y = -6473.0 },--false 无区域 战：false
                    { x = -10737.0 - 400, y = -7931.0 - 400 },--false 无区域 战：false
                    { x = -9788.0 - 100, y = -8111.0 - 100 },--false 无区域 战：false
                    { x = -8558.0 - 100, y = -9331.0 - 100 },--false 无区域 战：false
                    { x = -8558.0 + 300, y = -9331.0 - 300 },--false 无区域 战：false
                    { x = -8098.0 + 300, y = -9331.0 - 300 },--false 无区域 战：false
                    { x = -8098.0 + 500, y = -9331.0 + 500 },--false 无区域 战：false

                },
                min_cz = nil,
            },
            {
                name = '船长室',
                area = {
                    { x = -500.0 + 300, y = 17889.0 - 300 },--false 无区域 战：false
                    { x = -500.0 + 100, y = 17889.0 + 100 },--false 无区域 战：false
                    { x = -578.0 + 100, y = 20569.0 + 100 },--false 无区域 战：false
                    { x = -1615.0 + 100, y = 21192.0 + 100 },--false 无区域 战：false
                    { x = -1615.0 - 300, y = 21192.0 + 300 },--false 无区域 战：false
                    { x = -2878.0 - 500, y = 20289.0 + 500 },--false 无区域 战：false
                    { x = -2878.0 - 300, y = 20289.0 - 300 },--false 无区域 战：false
                    { x = -2968.0 - 300, y = 18120.0 - 300 },--false 无区域 战：false
                    { x = -2968.0 + 500, y = 18120.0 - 500 },--false 无区域 战：false
                    { x = -1428.0 - 100, y = 16859.0 - 100 },--false 无区域 战：false
                    { x = -928.0 + 500, y = 16859.0 - 500 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '造船厂',
                area = {
                    { x = -7697.0 + 300, y = 5587.0 - 300 },--false 无区域 战：false
                    { x = -7697.0 + 200, y = 5587.0 + 200 },--false 无区域 战：false
                    { x = -7558.0 + 300, y = 7084.0 + 300 },--false 无区域 战：false
                    { x = -7268.0 + 200, y = 9024.0 + 200 },--false 无区域 战：false
                    { x = -7271.0 + 200, y = 10869.0 + 200 },--false 无区域 战：false
                    { x = -7756.0 + 200, y = 13966.0 + 200 },--false 无区域 战：false
                    { x = -8248.0 - 300, y = 13967.0 + 300 },--false 无区域 战：false
                    { x = -9638.0 - 200, y = 11549.0 + 200 },--false 无区域 战：false
                    { x = -11148.0 - 200, y = 9619.0 - 200 },--false 无区域 战：false
                    { x = -11338.0 - 100, y = 8579.0 - 100 },--false 无区域 战：false
                    { x = -8248.0 - 200, y = 5553.0 - 200 },--false 无区域 战：false
                },
                min_cz = nil,
            },
        },

        ['熊猫扑扑岛'] = {
            {
                name = '主区',
                area = {
                    { x = 11149.0 + 100, y = 12304.0 + 100 },--false 无区域 战：false
                    { x = 8553.0 + 100, y = 13995.0 + 100 },--false 无区域 战：false
                    { x = 7970.0 - 100, y = 14140.0 + 100 },--false 无区域 战：false
                    { x = 5625.0 - 100, y = 13020.0 + 100 },--false 无区域 战：false
                    { x = 3596.0 + 100, y = 12709.0 + 100 },--false 无区域 战：false
                    { x = 3596.0 - 300, y = 12709.0 + 300 },--false 无区域 战：false
                    { x = 2694.0 - 300, y = 11526.0 + 300 },--false 无区域 战：false
                    { x = 2694.0 - 200, y = 11526.0 - 200 },--false 无区域 战：false
                    { x = 4075.0 - 10, y = 7994.0 - 10},--false 无区域 战：false
                    { x = 4436.0 - 100, y = 6368.0 - 100 },--false 无区域 战：false
                    { x = 5302.0 - 50, y = 5000.0 - 50 },--false 无区域 战：false
                    { x = 5371.0, y = 4965.0 - 50 },--false 无区域 战：false
                    { x = 9231.0 - 100, y = 4691.0 - 100 },--false 无区域 战：false
                    { x = 9604.0 - 50, y = 3970.0 - 50 },--false 无区域 战：false

                    { x = 9748.0 - 30, y = 3728.0 - 30 },--false 无区域 战：false
                    { x = 10120.0 + 300, y = 3921.0 - 300 },--false 无区域 战：false
                    { x = 11167.0 + 500, y = 5402.0 - 500 },--false 无区域 战：false
                    { x = 11887.0 + 500, y = 6795.0 - 500 },--true 无区域 战：false
                    { x = 12052.0 + 500 , y = 7149.0 },--false 无区域 战：false
                    { x = 12884.0 + 500 , y = 9305.0 },--false 无区域 战：false
                    { x = 13363.0 + 300, y = 10936.0 + 300 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '峭壁1',
                area = {
                    { x = 5186.0 + 30, y = 4352.0 },--false 无区域 战：false
                    { x = 4949.0, y = 4470.0 + 30 },--false 无区域 战：false
                    { x = 4181.0 - 5, y = 4237.0 + 5 },--false 无区域 战：false
                    { x = 4076.0 - 5, y = 4028.0 - 5 },--false 无区域 战：false
                    { x = 4426.0 - 10, y = 3797.0 - 10 },--false 无区域 战：false
                    { x = 4697.0 - 10, y = 3640.0 - 10},--false 无区域 战：false
                    { x = 4697.0 + 50, y = 3640.0 - 50 },--false 无区域 战：false
                    { x = 4984.0, y = 3913.0 },--false 无区域 战：false
                    { x = 4971.0 + 200, y = 3903.0 - 200 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '峭壁2',
                area = {
                    { x = 4006.0 + 5, y = 3957.0 - 5 },--false 无区域 战：false
                    { x = 4096.0 + 10, y = 4317.0 },--false 无区域 战：false
                    { x = 4050.0 + 10, y = 4404.0 + 10 },--false 无区域 战：false
                    { x = 3773.0, y = 4488.0 + 100 },--false 无区域 战：false
                    { x = 3478.0 - 100, y = 4058.0 + 100 },--false 无区域 战：false
                    { x = 3478.0 - 30, y = 4058.0 - 30 },--false 无区域 战：false
                    { x = 3728.0 - 50, y = 3903.0 - 50 },--false 无区域 战：false
                    { x = 3908.0 - 10, y = 3794.0 - 10 },--false 无区域 战：false
                    { x = 3908.0 + 30, y = 3794.0 - 30 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '峭壁3',
                area = {
                    { x = 3703.0 + 30, y = 3489.0 + 30 },--false 无区域 战：false
                    { x = 3548.0 + 40, y = 3607.0 + 40 },--false 无区域 战：false
                    { x = 3410.0 + 30, y = 3703.0 + 30 },--false 无区域 战：false
                    { x = 2774.0 - 100, y = 3654.0 + 100 },--false 无区域 战：false
                    { x = 2447.0 - 100, y = 3562.0 },--false 无区域 战：false
                    { x = 2641.0 - 100, y = 2972.0 - 100 },--false 无区域 战：false
                    { x = 2999.0, y = 2932.0 - 200 },--false 无区域 战：false
                    { x = 3574.0 + 100, y = 3301.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
        },

        ['黄昏岛'] = {
            {  --['黄昏岛'] = { x = 9035, y = 6267, z = 1273 },--false
                name = '左塔顶',
                area = {
                    { x = 9394.0 + 10, y = 6366.0 },--false 无区域 战：false
                    { x = 9252.0 + 10, y = 6472.0 + 10 },--false 无区域 战：false
                    { x = 9175.0 - 0, y = 6515.0 + 10 },--false 无区域 战：false
                    { x = 9002.0 - 10, y = 6254.0 },--false 无区域 战：false
                    { x = 9189.0 + 100, y = 6120.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '左塔中',
                area = {
                    { x = 9067.0 + 10, y = 6506.0 },--false 无区域 战：false
                    { x = 9035.0, y = 6523.0 + 30 },--false 无区域 战：false
                    { x = 8752.0 - 30, y = 6112.0 + 30 },--false 无区域 战：false
                    { x = 8752.0 - 10, y = 6112.0 - 10 },--false 无区域 战：false
                    { x = 8841.0, y = 6091.0 - 20 },--false 无区域 战：false
                    { x = 8927.0 + 5, y = 6217.0 - 5 },--false 无区域 战：false
                    { x = 8921.0 + 5, y = 6237.0 - 5 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '主岛',
                area = {
                    { x = 8485.0 + 100, y = 5782.0 - 100 },--false 无区域 战：false
                    { x = 8680.0 + 50, y = 6030.0 - 50 },--false 无区域 战：false
                    { x = 8691.0 + 10, y = 6071.0 },--false 无区域 战：false
                    { x = 8645.0, y = 6137.0 },--false 无区域 战：false
                    { x = 8953.0, y = 6621.0 },--false 无区域 战：false
                    { x = 9244.0 - 100, y = 7139.0 - 100 },--false 无区域 战：false
                    { x = 9971.0 - 50, y = 6701.0 - 50 },--false 无区域 战：false
                    { x = 9971.0 + 100, y = 6701.0 },--false 无区域 战：false
                    { x = 10197.0 + 100, y = 7010.0 },--false 无区域 战：false
                    { x = 10292.0 + 100, y = 7595.0 },--false 无区域 战：false
                    { x = 11877.0 + 200, y = 9424.0 },--false 无区域 战：false
                    { x = 11877.0 + 100, y = 9424.0 + 100 },--false 无区域 战：false
                    { x = 11216.0 + 100, y = 10546.0 + 100 },--false 无区域 战：false
                    { x = 8949.0 + 30, y = 10485.0 + 30 },--false 无区域 战：false
                    { x = 8600.0 + 30, y = 10722.0 + 30 },--false 无区域 战：false
                    { x = 7701.0 + 30, y = 10942.0 + 30 },--false 无区域 战：false
                    { x = 7696.0 + 30, y = 11620.0 + 30 },--false 无区域 战：false
                    { x = 7345.0, y = 11624.0 + 100 },--false 无区域 战：false
                    { x = 3441.0 - 100, y = 10354.0 + 100 },--false 无区域 战：false
                    { x = 2411.0 - 200, y = 9511.0 + 200 },--false 无区域 战：true
                    { x = 2411.0 - 100, y = 9511.0 - 100 },--false 无区域 战：true
                    { x = 2593.0 - 100, y = 9193.0 - 100 },--false 无区域 战：false
                    { x = 3327.0 - 100, y = 8943.0 - 100 },--false 无区域 战：false
                    { x = 3327.0 + 100, y = 8943.0 },--false 无区域 战：false
                    { x = 4933.0 - 200, y = 9019.0 - 200 },--false 无区域 战：false
                    { x = 4096.0 - 100, y = 7546.0 + 100 },--false 无区域 战：false
                    { x = 3723.0, y = 7643.0 + 15 },--false 无区域 战：false
                    { x = 3591.0 - 10, y = 7527.0 + 10 },--false 无区域 战：false
                    { x = 3470.0 - 20, y = 7440.0 },--false 无区域 战：false
                    { x = 4683.0 - 100, y = 5726.0 - 100 },--false 无区域 战：false
                    { x = 4564.0 - 50, y = 4717.0 },--false 无区域 战：false
                    { x = 4751.0, y = 4529.0 - 100 },--false 无区域 战：false
                    { x = 5905.0, y = 4619.0 - 100 },--false 无区域 战：false
                    { x = 6083.0 + 100, y = 4877.0 },--false 无区域 战：false
                    { x = 7382.0 + 100, y = 5019.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '右塔顶',
                area = {
                    { x = 3652.0 + 5, y = 7618.0 },--false 无区域 战：false
                    { x = 3704.0 + 30, y = 7824.0 + 30 },--false 无区域 战：false
                    { x = 3659.0 + 15, y = 8026.0 + 15 },--false 无区域 战：false
                    { x = 3513.0 + 20, y = 8153.0 + 20 },--false 无区域 战：false
                    { x = 3313.0, y = 8196.0 + 20 },--false 无区域 战：false
                    { x = 3120.0 - 30, y = 8139.0 + 30 },--false 无区域 战：false
                    { x = 2986.0 - 50, y = 7987.0 },--false 无区域 战：false
                    { x = 2952.0 - 30, y = 7819.0 - 30 },--false 无区域 战：false
                    { x = 3002.0 - 10, y = 7620.0 - 10 },--false 无区域 战：false
                    { x = 3139.0 - 10, y = 7490.0 - 10 },--false 无区域 战：false
                    { x = 3325.0 - 10, y = 7445.0 - 10 },--false 无区域 战：false
                    { x = 3325.0 + 5, y = 7445.0 - 5 },--false 无区域 战：false
                    { x = 3512.0 + 5, y = 7490.0 - 5 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '旅店',
                area = {
                    { x = -8561.0 + 200, y = -15513.0 - 200 },--false 无区域 战：false
                    { x = -8566.0 + 300, y = -15531.0 + 300 },--false 无区域 战：false
                    { x = -8578.0 + 300, y = -14702.0 + 300 },--false 无区域 战：false
                    { x = -8859.0 + 50, y = -14126.0 + 50 },--false 无区域 战：false
                    { x = -9679.0 - 100, y = -14221.0 + 100 },--false 无区域 战：false
                    { x = -10303.0 - 500, y = -14302.0 + 500 },--false 无区域 战：false
                    { x = -10607.0 - 500, y = -14818.0 - 500 },--false 无区域 战：false
                    { x = -10310.0 + 300, y = -15010.0 - 300 },--false 无区域 战：false
                    { x = -9805.0 - 200, y = -15538.0 - 200 },--false 无区域 战：false
                    { x = -9805.0, y = -15538.0 - 200 },--false 无区域 战：false
                },
                min_cz = nil,
            },
        },

        ['黑牙驻地'] = {
            {
                name = '主岛',
                area = {
                    { x = 7355.0 + 3000, y = 4217.0 - 3000 },--false 无区域 战：false
                    { x = 7355.0 + 3000, y = 4217.0 + 3000 },--false 无区域 战：false
                    { x = 5608.0 + 3000, y = 6345.0 + 3000 },--false 无区域 战：false
                    { x = 5608.0 - 3000, y = 6345.0 + 3000 },--false 无区域 战：false
                    { x = 3142.0 + 100, y = 5628.0 + 100 },--false 无区域 战：false
                    { x = 3142.0 - 100, y = 5628.0 + 100 },--false 无区域 战：false
                    { x = 3006.0 - 100, y = 5403.0 },--false 无区域 战：false
                    { x = 3095.0 - 100, y = 5181.0 - 100 },--false 无区域 战：false
                    { x = 2444.0 - 300, y = 3027.0 },--false 无区域 战：false
                    { x = 2428.0 - 100, y = 2528.0 - 100 },--false 无区域 战：false
                    { x = 2428.0 + 3000, y = 2528.0 - 3000 },--false 无区域 战：false
                },
                min_cz = nil,
                overlap = {
                    ['上岛'] = 1, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['左上岛'] = 1,
                },
            },
            {
                name = '左上岛',
                area = {
                    { x = 3753.0 + 100, y = 6417.0 },--false 主岛 战：false
                    { x = 3753.0, y = 6417.0 + 100 },--false 主岛 战：false
                    { x = 3588.0 - 150, y = 6217.0 },--false 主岛 战：false
                    { x = 3654.0 - 100, y = 6112.0 - 100 },--false 主岛 战：false
                    { x = 3654.0 + 100, y = 6112.0 - 100 },--false 主岛 战：false
                },
                min_cz = 150,
            },
            {
                name = '上岛',
                area = {
                    { x = 3265.0 + 100, y = 6806.0 },--false 主岛 战：false
                    { x = 3029.0, y = 6860.0 + 200 },--false 无区域 战：false
                    { x = 2817.0 - 100, y = 6787.0 },--false 无区域 战：false
                    { x = 2983.0, y = 6675.0 - 100 },--false 无区域 战：false
                },
                min_cz = 150,
            },
            {
                name = '中岛',
                area = {
                    { x = 2672.0 + 30, y = 5484.0 - 30 },--false 无区域 战：false
                    { x = 2672.0 + 30, y = 5484.0 + 30 },--false 无区域 战：false
                    { x = 2545.0 + 50, y = 6301.0 + 50 },--false 无区域 战：false
                    { x = 2405.0, y = 6332.0 + 50 },--false 无区域 战：false
                    { x = 2028.0 - 100, y = 6147.0 + 100 },--false 无区域 战：false
                    { x = 2028.0 - 300, y = 6147.0 - 300 },--false 无区域 战：false
                    { x = 2225.0 - 50, y = 5650.0 - 50 },--false 无区域 战：false
                    { x = 2349.0 - 30, y = 5488.0 - 30 },--false 无区域 战：false
                    { x = 2656.0, y = 5444.0 - 50 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '下岛',
                area = {
                    { x = 2351.0 + 50, y = 5208.0 },--false 无区域 战：false
                    { x = 2287.0 + 20, y = 5284.0 + 20 },--false 无区域 战：false
                    { x = 2100.0, y = 5289.0 + 50 },--false 无区域 战：false
                    { x = 2076.0 - 200, y = 5100.0 },--false 无区域 战：false
                    { x = 2076.0, y = 5100.0 - 200 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '黑牙的家',
                area = {
                    { x = -1318.0 + 100, y = -16944.0 - 100 },--false 无区域 战：false
                    { x = -1318.0 + 100, y = -16944.0 + 100 },--false 无区域 战：false
                    { x = -1168.0 + 100, y = -16236.0 + 100 },--false 无区域 战：false
                    { x = -1376.0 + 100, y = -15692.0 + 100 },--false 无区域 战：false
                    { x = -1816.0 - 100, y = -15564.0 + 100 },--false 无区域 战：false
                    { x = -1816.0 - 500, y = -15564.0 - 500 },--false 无区域 战：false
                    { x = -2059.0 - 500, y = -16412.0 + 500 },--false 无区域 战：false
                    { x = -2059.0 - 500, y = -16412.0 - 500 },--false 无区域 战：false
                    { x = -1908.0 - 200, y = -16973.0 - 200 },--false 无区域 战：false
                },
                min_cz = -70,
            },
        },

        ['梦想海鸥岛'] = {
            {
                name = '大区1',
                area = {
                    { x = 6236.0 + 200, y = 10075.0 + 200 },--false 无区域 战：false
                    { x = 5464.0 - 500, y = 10480.0 + 500 },--false 无区域 战：false
                    { x = 4563.0 - 200, y = 10737.0 + 200 },--false 无区域 战：false
                    { x = 4563.0, y = 10737.0 - 300 },--false 无区域 战：false
                    { x = 3301.0 - 300, y = 9534.0 + 300 },--false 无区域 战：false
                    { x = 3301.0 - 300, y = 9534.0 - 300 },--false 无区域 战：false
                    { x = 3608.0 - 300, y = 7985.0 - 300 },--false 无区域 战：false
                    { x = 3911.0 - 300, y = 7095.0 - 300 },--false 无区域 战：false
                    { x = 4113.0 - 200, y = 5258.0 - 200 },--false 无区域 战：false
                    { x = 4417.0 - 200, y = 4153.0 - 200 },--false 无区域 战：false
                    { x = 5222.0, y = 3245.0 - 300 },--false 无区域 战：false
                    { x = 6759.0 + 300, y = 3992.0 },--false 无区域 战：false
                    { x = 6769.0 + 50, y = 4801.0 + 50 },--false 无区域 战：false
                    { x = 7317.0 - 100, y = 6003.0 - 100 },--false 无区域 战：false
                    { x = 7488.0 - 30, y = 5383.0 - 30 },--false 无区域 战：false
                    { x = 7639.0 + 30, y = 5362.0 - 30 },--false 无区域 战：false
                    { x = 7830.0 + 50, y = 5373.0 - 50 },--false 无区域 战：false
                    { x = 7960.0 + 50, y = 5468.0 },--false 无区域 战：false
                    { x = 8234.0 + 30, y = 6267.0 },--false 无区域 战：false
                    { x = 7270.0 + 200, y = 7257.0 + 200 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '小区1',
                area = {
                    { x = 7658.0 + 30, y = 5077.0 + 30 },--false 无区域 战：false
                    { x = 7442.0 - 30, y = 5099.0 + 30 },--false 无区域 战：false
                    { x = 7378.0 - 20, y = 4614.0 - 20 },--false 无区域 战：false
                    { x = 7373.0 - 10, y = 4468.0 - 10 },--false 无区域 战：false
                    { x = 7373.0 + 30, y = 4468.0 - 30 },--false 无区域 战：false
                    { x = 7547.0 + 50, y = 4507.0 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '小区2',
                area = {
                    { x = 8697.0 + 200, y = 4364.0 },--false 无区域 战：false
                    { x = 8697.0 + 100, y = 4364.0 + 100 },--false 无区域 战：false
                    { x = 8359.0, y = 4735.0 + 200 },--false 无区域 战：false
                    { x = 8067.0 - 100, y = 4822.0 + 100 },--false 无区域 战：false
                    { x = 7756.0, y = 4726.0 + 100 },--false 无区域 战：false
                    { x = 7756.0 - 10, y = 4726.0 },--false 无区域 战：false
                    { x = 7699.0 - 10, y = 4663.0 - 10 },--false 无区域 战：false
                    { x = 7670.0 - 10, y = 4544.0 - 10 },--false 无区域 战：false

                    { x = 7659.0 - 10, y = 4477.0 + 10 },--false 无区域 战：false
                    { x = 7659.0 - 10, y = 4477.0 - 10 },--false 无区域 战：false

                    { x = 7674.0 - 20, y = 4374.0 - 20 },--false 无区域 战：false
                    { x = 7745.0, y = 4350.0 - 20 },--false 无区域 战：false
                    { x = 7953.0 + 100, y = 4359.0 - 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
            {
                name = '大区2',
                area = {
                    { x = 10951.0 - 300, y = 3198.0 },--false 无区域 战：false
                    { x = 10951.0, y = 3198.0 - 300},--false 无区域 战：false
                    { x = 11758.0 + 300, y = 4717.0 },--false 无区域 战：false
                    { x = 11462.0 + 200, y = 6208.0 + 200 },--false 无区域 战：false
                    { x = 10737.0 + 100, y = 9073.0 + 100 },--false 无区域 战：false
                    { x = 10458.0 + 100, y = 10337.0 + 100 },--false 无区域 战：false
                    { x = 10458.0, y = 10337.0 + 300 },--false 无区域 战：false
                    { x = 9184.0 + 100, y = 10971.0 + 100 },--false 无区域 战：false
                    { x = 9184.0 - 300, y = 10971.0 + 300 },--false 无区域 战：false
                    { x = 8570.0 - 200, y = 10887.0 },--false 无区域 战：false
                    { x = 8606.0, y = 10755.0 - 200 },--false 无区域 战：false
                    { x = 9628.0, y = 7494.0 + 100},--false 无区域 战：false
                    { x = 9205.0 - 200, y = 7201.0 + 200 },--false 无区域 战：false
                    { x = 9042.0 - 200, y = 6771.0 + 200},--false 无区域 战：false
                    { x = 9042.0 - 100, y = 6771.0 - 100 },--false 无区域 战：false
                    { x = 9207.0 - 100, y = 6532.0 - 100 },--false 无区域 战：false
                    { x = 11132.0 - 100, y = 6124.0 - 100 },--false 无区域 战：false
                    { x = 11157.0 - 100, y = 4235.0 + 100 },--false 无区域 战：false
                },
                min_cz = nil,
            },
        },

        ['智慧岛'] = {
            {
                name = '主岛',
                area = {
                    { x = 2419.0 + 15000, y = 4224.0 + 15000 },--false 无区域 战：false
                    { x = 2419.0 - 15000, y = 4224.0 + 15000 },--false 无区域 战：false
                    { x = 2419.0 - 15000, y = 4224.0 - 15000 },--false 无区域 战：false
                    { x = 2419.0 + 15000, y = 4224.0 - 15000 },--false 无区域 战：false
                },
                min_cz = nil,
                overlap = {
                --    ['主岛分区1'] = 1, -- 与这个区域产生重叠区域时 使用的高度Z
                    ['图书馆一层'] = 1,
                    ['图书馆二层'] = 1,
                },
            },
            {
                name = '图书馆二层',
                area = {
                    { x = 4951.0 + 300, y = -524.0 },--false 主岛 战：false
                    { x = 5001.0 + 100, y = 1186.0 + 100 },--false 主岛 战：false
                    { x = 4023.0 - 100, y = 1320.0 + 100 },--false 主岛 战：false
                    { x = 3039.0 - 1000, y = 1170.0 + 1000 },--false 主岛 战：false
                    { x = 3039.0 - 1000, y = 1170.0 - 1000 },--false 主岛 战：false
                    { x = 2151.0 - 500, y = 166.0 },--false 主岛 战：false
                    { x = 2151.0 - 100, y = -467.0 - 100 },--false 主岛 战：false
                    { x = 4961.0 + 200, y = -514.0 - 200 },--false 主岛 战：false
                },
            },
            {
                name = '图书馆一层',
                area = {
                    { x = 5872.0 + 500, y = 2724.0 - 500 },--false 无区域 战：false
                    { x = 6467.0 + 100, y = 4416.0 + 100 },--false 无区域 战：false
                    { x = 6467.0 + 100, y = 5329.0 + 100 },--false 无区域 战：false
                    { x = 6009.0 + 100, y = 6538.0 + 100 },--false 无区域 战：false
                    { x = 3577.0 - 100, y = 6602.0 + 100 },--false 无区域 战：false
                    { x = 3579.0 - 100, y = 5577.0 - 100 },--false 无区域 战：false
                    { x = 2826.0 + 50, y = 5373.0 + 50 },--false 无区域 战：false
                    { x = 2207.0 - 100, y = 5405.0 + 100 },--false 无区域 战：false
                    { x = 2211.0 - 50, y = 4304.0 - 50 },--false 无区域 战：false
                    { x = 3409.0 - 50, y = 4324.0 - 50 },--false 无区域 战：false
                    { x = 3559.0 - 100, y = 2486.0 - 100 },--false 无区域 战：false
                },
                min_cz = -14000,
            },
        },

    }

}

-- 自身模块
local this = map_area_res

-------------------------------------------------------------------------------------
-- [读取] 获取当前坐标对应区域
map_area_res.get_area_name = function(x,y,z)
    local map_name = actor_unit.map_name()
    local map_info = this.map_area_info[map_name]
    if not map_info then
        return '无区域'
    end
    z              = z or local_player:cz()
    y              = y or local_player:cy()
    x              = x or local_player:cx()
    local list     = {}
    for _,v in pairs(map_info) do
        local area   = v.area
        local min_cz = v.min_cz
        if area and utils.is_point_in_polygon(x, y, area) then
            v.calc_z = min_cz and math.abs(min_cz - z) or 0
            table.insert(list,v)
        end
    end
    -- 获取区域信息
    if not table.is_empty(list) then
        local list2 = {}
        if #list > 1 then
            for _,v in pairs(list) do
                local name    = v.name
                local overlap = v.overlap
                local min_cz  = v.min_cz
                if overlap and not table.is_empty(overlap) then
                    for name1,cz in pairs(overlap) do
                        for _,v1 in pairs(list) do
                            if v1.name == name1 and name ~= v1.name then
                                min_cz = cz
                                break
                            end
                        end
                    end
                end
                local calc_z = min_cz and math.abs(min_cz - z) or 0
                table.insert(list2,{ name = name,calc_z = calc_z })
            end
        end
        list = not table.is_empty(list2) and list2 or list
        table.sort(list,function(a, b) return a.calc_z < b.calc_z end)
        return list[1].name
    end
    return '无区域'
end

-------------------------------------------------------------------------------------
-- [读取] 获取升降或移动区域时 检测坐标
map_area_res.get_change_info_by_area_name = function(area_name)
    local area_move = this.get_map_area_move_by_map_name()
    local info      = area_move[area_name]
    if not table.is_empty(info) then
        local c_info = info['可换地图']
        if not table.is_empty(c_info) then
            local my_z = local_player:cz()
            local list = {}
            for _,v in pairs(c_info) do
                local calc_z = math.abs(my_z - v.z)
                v.calc_z = calc_z
                table.insert(list,v)
            end
            if not table.is_empty(list) then
                table.sort(list,function(a, b) return a.calc_z < b.calc_z end)
                return list[1].x,list[1].y,list[1].z
            end
        end
    end
    return 0,0,0
end

-------------------------------------------------------------------------------------
-- [读取] 获取当前区域类型【升降 移动 普通】
map_area_res.get_area_move_type_by_area_name = function(area_name)
    local area_move = this.get_map_area_move_by_map_name()
    local info      = area_move[area_name]
    return info and info['移动类型'] or '普通'
end

-------------------------------------------------------------------------------------
-- [读取] 获取当前地图移动物体列表
map_area_res.get_curr_area_lifter_list = function()
    local map_name = actor_unit.map_name()
    local map_info = this.map_area_info[map_name]
    local list     = {}
    if not table.is_empty(map_info) then
        local area_move = this.get_map_area_move_by_map_name(map_name)
        for _,v in pairs(map_info) do
            local info = area_move[v.name]
            if not table.is_empty(info) then
                local change_map = info['可换地图']
                for area_name,v1 in pairs(change_map) do
                    local operate = v1['操作']
                    if not table.is_empty(operate) then
                        if operate.res_id and operate.res_id ~= 0 and operate.type and operate.type ~= 0 then
                            table.insert(list,{ res_id = operate.res_id,type = operate.type,action = operate.action,area_name = area_name })
                        end
                    end
                end
            end
        end
    end
    return list
end

-------------------------------------------------------------------------------------
-- [读取] 获取地图区域切换信息
map_area_res.get_map_area_move_by_map_name = function(map_name)
    map_name = map_name or actor_unit.map_name()
    local list = this.map_area_move[map_name]
    return not table.is_empty(list) and list or {}
end

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return map_area_res

-------------------------------------------------------------------------------------