------------------------------------------------------------------------------------
-- game/resources/ship_res.lua
--
--
--
-- @module      ship_res
-- @author      admin
-- @license     MIT
-- @release     v1.0.0 - 2023-03-22
-- @copyright   2023
-- @usage
-- local ship_res = import('game/resources/ship_res')
------------------------------------------------------------------------------------
local ship_res = {
    -- 船对应IDX
    ship_info = {
        ['埃斯托克'] = { idx = 0 },
        ['风泊'] = { idx = 1 },
        ['巴克斯图姆'] = { idx = 2 },
        ['普纽玛'] = { idx = 3 },
        ['弗兰斯'] = { idx = 4 },
        ['特拉贡'] = { idx = 5 },
    },
}

-- 自身模块
local this = ship_res

-------------------------------------------------------------------------------------
-- 返回实例对象
-- 
-- @export
return ship_res

-------------------------------------------------------------------------------------