-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   item_res
-- @describe: 物品资源
-- @version:  v1.0
--
local pairs  = pairs
local string = string
-------------------------------------------------------------------------------------
-- NPC商店资源
---@class shop_res
local shop_res = {
    MERCHANT_NPC = {
        ['莱恩哈特'] = {
            ['药水商人'] = {
                [1] = { npc_name = '贝达',
                        active_name = '莱恩哈特',
                        npc_pos = { x = 9708, y = 8289, z = 255 },
                        sell_item = {
                            ['初级治疗药水'] = { idx = 1, money = 6, name = '初级治疗药水' },
                            ['普通治疗药水'] = { idx = 2, money = 10, name = '普通治疗药水' },
                            ['贝达的莱恩哈特家常菜'] = { idx = 3, money = 3000, name = '贝达的莱恩哈特家常菜' },
                        }, },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '葛班',
                    active_name = '莱恩哈特',
                    npc_pos = { x = 10627.0, y = 7206.0, z = 256.0 },
                },
            },
        },

        ['罗格希尔'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '柯尔利卡',
                    active_name = '旅者休息地',
                    npc_pos = { x = 18051, y = 47645, z = 256 },
                    sell_item = {
                        ['初级治疗药水'] = { idx = 1, money = 6, name = '初级治疗药水' },
                        ['普通治疗药水'] = { idx = 2, money = 10, name = '普通治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '安可',
                    active_name = '旅者休息地',
                    npc_pos = { x = 18178.0, y = 48431.0, z = 256.0 },
                },
            },

        },
        ['安格莫斯山麓'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '弗曼',
                    active_name = '国境监视哨所',
                    npc_pos = { x = 17147, y = 11992, z = 256 },
                    sell_item = {
                        ['初级治疗药水'] = { idx = 1, money = 6, name = '初级治疗药水' },
                        ['普通治疗药水'] = { idx = 2, money = 10, name = '普通治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '马安',
                    active_name = '国境监视哨所',
                    npc_pos = { x = 16649.0, y = 12152.0, z = 256.0 },
                },
            },
        },
        ['国境地带'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '罗杰',
                    active_name = '瑞格里亚圣疗院',
                    npc_pos = { x = 10336, y = 15151, z = 547.9 },
                    sell_item = {
                        ['初级治疗药水'] = { idx = 1, money = 6, name = '初级治疗药水' },
                        ['普通治疗药水'] = { idx = 2, money = 10, name = '普通治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '加尔各',
                    active_name = '瑞格里亚圣疗院',
                    npc_pos = { x = 12352.0, y = 14937.0, z = 535.0 },
                },
            },

        },
        ['萨兰德丘陵'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '汉森',
                    active_name = '盐场',
                    npc_pos = { x = -1297, y = 6564, z = 516.7 },
                    sell_item = {
                        ['初级治疗药水'] = { idx = 1, money = 6, name = '初级治疗药水' },
                        ['普通治疗药水'] = { idx = 2, money = 10, name = '普通治疗药水' },
                    },
                },
                [2] = {
                    npc_name = '比尔马',
                    active_name = '流民营地',
                    npc_pos = { x = 19986, y = 29153, z = 509 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1, money = 10, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2, money = 20, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '克拉丁',
                    active_name = '盐场',
                    npc_pos = { x = 156.0, y = 7312.0, z = 515.53326416016 },
                },
                [2] = {
                    npc_name = '达伊仑',
                    active_name = '流民营地',
                    npc_pos = { x = 20301.0, y = 30685.0, z = 509.0 },
                },
            },
        },
        ['奥兹霍丘陵'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '弗洛拉',
                    active_name = '奥兹霍集结地',
                    npc_pos = { x = 242.0, y = 646.0, z = 515.95520019531 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1.0, money = 10.0, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2.0, money = 20.0, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '托蒂',
                    active_name = '奥兹霍集结地',
                    npc_pos = { x = -81.0, y = 1556.0, z = 512.0 },
                },
            },
        },
        ['扎格拉斯山'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '厄尔梅',
                    active_name = '扎格拉斯要塞',
                    npc_pos = { x = 17002.0, y = 10356.0, z = 2048.0 },
                    sell_item = {
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '肖芬',
                    active_name = '扎格拉斯要塞',
                    npc_pos = { x = 14169.0, y = 12413.0, z = 2048.0 },
                },
            },
        },
        ['雷科巴'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '费顿',
                    active_name = '雷科巴',
                    npc_pos = { x = 10416.0, y = 15233.0, z = 1023.9997558594 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1.0, money = 10.0, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2.0, money = 20.0, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '雷科巴',
                    npc_name = '朗博',
                    npc_pos = { x = 12600.0, y = 13272.0, z = 1021.095703125 },
                },
            },
        },
        ['梅德里克圣疗院'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '丽雅',
                    active_name = '梅德里克圣疗院',
                    npc_pos = { x = 11337.0, y = 8409.0, z = 2899.5 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1.0, money = 10.0, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2.0, money = 20.0, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '梅德里克圣疗院',
                    npc_name = '曼迪',
                    npc_pos = { x = 10534.0, y = 9439.0, z = 2895.5476074219 },
                },
            },
        },
        ['比尔布森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '泉眼疏散哨所',
                    npc_name = '乔安',
                    npc_pos = { x = 9478.0, y = 12150.0, z = 1024.0 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1.0, money = 10.0, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2.0, money = 20.0, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '泉眼疏散哨所',
                    npc_name = '伯伦',
                    npc_pos = { x = 9123.0, y = 12086.0, z = 1024.0 },
                },
            },
        },
        ['激战平原'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '玛丽安',
                    active_name = '前方哨所',
                    npc_pos = { x = 7066.0, y = 6705.0, z = 2048.0 },
                    sell_item = {
                        ['普通治疗药水'] = { idx = 1.0, money = 10.0, name = '普通治疗药水' },
                        ['高级治疗药水'] = { idx = 2.0, money = 20.0, name = '高级治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '比伦',
                    active_name = '前方哨所',
                    npc_pos = { x = 6726.0, y = 5012.0, z = 2048.0 },
                },
            },
        },
        ['梨木之地'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '杰米尼',
                    active_name = '西恩旅店',
                    npc_pos = { x = -10908.0, y = -28348.0, z = 767.99981689453 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    npc_name = '雷奥',
                    active_name = '达亚村',
                    npc_pos = { x = -17527.0, y = -2496.0, z = 1024.0 },
                },
            },
        },
        ['黑玫瑰圣疗殿堂'] = {
            ['药水商人'] = {
                [1] = {
                    npc_name = '桑兹',
                    active_name = '斯蒂西亚村',
                    npc_pos = { x = 7357.0, y = 11381.0, z = 512.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '斯蒂西亚村',
                    npc_name = '帕毗卢斯',
                    npc_pos = { x = 8142.0, y = 12914.0, z = 511.11254882812 },
                },
            },
        },
        ['卢特兰城'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '卡帕尔',
                    npc_pos = { x = 5467.0, y = 4395.0, z = 448.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水' },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水' },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水' },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水' },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水' },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水' },
                    },
                },
                [2] = {
                    active_name = '王宫入口',
                    npc_name = '赛西弗',
                    npc_pos = { x = 9379.0, y = 6587.0, z = 1023.9997558594 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水' },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水' },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水' },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水' },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水' },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '王宫入口',
                    npc_name = '特杰',
                    npc_pos = { x = 10021.0, y = 5181.0, z = 1023.9998779297 },
                },
                [2] = {
                    active_name = '商业街',
                    npc_name = '格罗利',
                    npc_pos = { x = 4846.0, y = 4476.0, z = 448.0 },
                },
                [3] = {
                    active_name = '商业街',
                    npc_name = '拉尔特',
                    npc_pos = { x = -333.0, y = 6362.0, z = 453.26586914062 },
                },
            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '哈纳尔',
                    npc_pos = { x = 2067.0, y = 7578.0, z = 448.0 },
                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '布拉依特',
                    npc_pos = { x = -166.0, y = 6902.0, z = 455 },
                },
            },
            ['混沌商人'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '艾特',
                    npc_pos = { x = 5115, y = 4415, z = 447 },--false
                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '贝蒙德',
                    npc_pos = { x = 377.0, y = 5912.0, z = 453.38806152344 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },
            },
        },

        ['迪奥利卡平原'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '蒙特里克住宅',
                    npc_name = '杰汀',
                    npc_pos = { x = 17673.0, y = 7414.0, z = 1536.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '蒙特里克住宅',
                    npc_name = '铁匠普隆',
                    npc_pos = { x = 13632.0, y = 16404.0, z = 1536.0 },
                },
            },
        },
        ['日晕之丘'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '南瓜农场',
                    npc_name = '埃伊尼',
                    npc_pos = { x = -12756.0, y = -15398.0, z = 768.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '南瓜农场',
                    npc_name = '奥利弗',
                    npc_pos = { x = -14462.0, y = -13950.0, z = 766.30004882812 },
                },
            },
        },
        ['拉伊亚阶地'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '水雾休息区',
                    npc_name = '杰尼特',
                    npc_pos = { x = -13026.0, y = -19012.0, z = 1015.9997558594 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '水雾休息区',
                    npc_name = '德里斯',
                    npc_pos = { x = -13686.0, y = -17884.0, z = 1019.0 },
                },
            },
        },
        ['伯雷亚领地'] = {
            --['药水商人'] = {
            --    [1] = {
            --        active_name = '伯雷亚城',
            --        npc_name = '恩里凯',
            --        npc_pos = { x = -26472.0, y = -17243.0, z = 768.0 },
            --        sell_item = {
            --            ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
            --            ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
            --        },
            --    },
            --},
            ['维修工'] = {
                [1] = {
                    active_name = '伯雷亚城',
                    npc_name = '德瓦林',
                    npc_pos = { x = -27870.0, y = -16404.0, z = 832.0 },
                },
                [2] = {
                    active_name = '加拉托尔铁武坊',
                    npc_name = '巴洛',
                    npc_pos = { x = -8844.0, y = -5906.0, z = 512.0 },
                },
            },
        },
        ['鬃波港'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '鬃波港',
                    npc_name = '米勒亚',
                    npc_pos = { x = 7822.0, y = 6336.0, z = 456.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '鬃波港',
                    npc_name = '玛班',
                    npc_pos = { x = 4157.0, y = 6612.0, z = 256.0 },
                },
            },
        },
        ['科罗克尼斯海岸'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '警备队宿营地',
                    npc_name = '卡洛斯',
                    npc_pos = { x = 14174.0, y = 18011.0, z = 64.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '警备队宿营地',
                    npc_name = '列尔普',
                    npc_pos = { x = 15339.0, y = 16743.0, z = 63.0 },
                },
            },
        },
        -------------------------------------------------------------------------------------------
        ['海潮森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '海香海岸',
                    npc_name = '席琳',
                    npc_pos = { x = 8580.0, y = 4831.0, z = 511.99987792969 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '海香海岸',
                    npc_name = '皮克斯',
                    npc_pos = { x = 9116.0, y = 5663.0, z = 511.14129638672 },
                },
            },
        },

        ['摩可可村'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '摩可可村广场',
                    npc_name = '纳里纳里',
                    npc_pos = { x = 2650.0, y = 2647.0, z = -340.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '摩可可村广场',
                    npc_name = '利匹利匹',
                    npc_pos = { x = 4697.0, y = 5935.0, z = -329.14013671875 },
                },
            },
        },

        ['大岩林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '大岩之丘',
                    npc_name = '穆尼穆尼',
                    npc_pos = { x = 15680.0, y = 16096.0, z = 2304.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '大岩之丘',
                    npc_name = '利帕帕',
                    npc_pos = { x = 14281.0, y = 16589.0, z = 2304.0 },
                },
            },
        },
        ['沉默巨人之森'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '岩石之乡',
                    npc_name = '卢皮卢皮',
                    npc_pos = { x = 1556.0, y = -2663.0, z = -4068.9995117188 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '岩石之乡',
                    npc_name = '斯娜娜',
                    npc_pos = { x = 648.0, y = -3006.0, z = -4068.9995117188 },
                },
            },
        },
        ['丰饶森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '丰饶森林农场',
                    npc_name = '诺米诺米',
                    npc_pos = { x = 12588.0, y = 11712.0, z = 474.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '丰饶森林农场',
                    npc_name = '都娜娜',
                    npc_pos = { x = 12856.0, y = 10730.0, z = 479.0 },
                },
            },
        },

        -------------------------------------------------------------------------------------------
        ['港口城市苍天'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '市政府',
                    npc_name = '马良',
                    npc_pos = { x = -9597.0, y = 4210.0, z = 384.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '市政府',
                    npc_name = '超燕',
                    npc_pos = { x = -5673.0, y = 3349.0, z = 383.65933227539 },
                },
            },
            ['杂货商人'] = {
                [1] = {
                    active_name = '市政府',
                    npc_name = '米丽',
                    npc_pos = { x = -6808.0, y = 14159.0, z = 255 },
                },
            },
        },
        ['紫藤之丘'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '燕氏家族修炼场',
                    npc_name = '秦韶华',
                    npc_pos = { x = 9140.0, y = 3480.0, z = 1161.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '燕氏家族修炼场',
                    npc_name = '萧岚',
                    npc_pos = { x = 8049.0, y = 3760.0, z = 1161.0 },
                },
            },
        },
        ['德尔菲县'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '燕兰',
                    npc_pos = { x = 7835.0, y = 3632.0, z = 896.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '商业街',
                    npc_name = '明恭',
                    npc_pos = { x = 5070.0, y = 3946.0, z = 1023.6125488281 },
                },
            },
        },
        ['音之森'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '隐士的庙',
                    npc_name = '秦穆林',
                    npc_pos = { x = -12537.0, y = 382.0, z = 2068.6271972656 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '隐士的庙',
                    npc_name = '陈小明',
                    npc_pos = { x = -11372.0, y = 1227.0, z = 2113.0 },
                },
            },
        },
        ['薄暮之雾'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '紫色烟雾',
                    npc_name = '萧琴',
                    npc_pos = { x = 6068.0, y = 7205.0, z = 2303.9995117188 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '紫色烟雾',
                    npc_name = '孔美兰',
                    npc_pos = { x = 6410.0, y = 6783.0, z = 2304.0 },
                },
            },
        },
        ['镜谷'] = {
            ['维修工'] = {
                [1] = {
                    active_name = '竹林寺',
                    npc_name = '孔先',
                    npc_pos = { x = 20497.0, y = 5773.0, z = 262.71267700195 },
                },
            },
        },
        -------------------------------------------------------------------------------------------
        ['贫瘠通道'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '卢芬港',
                    npc_name = '苏菲',
                    npc_pos = { x = -22343.0, y = 4758.0, z = 542.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '卢芬港',
                    npc_name = '劳拉',
                    npc_pos = { x = -23957.0, y = 6415.0, z = 542.0 },
                },
            },
        },
        ['清风丘陵'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '垃圾场',
                    npc_name = '雷内',
                    npc_pos = { x = 14549.0, y = 8218.0, z = -271.921875 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '垃圾场',
                    npc_name = '吉普利特',
                    npc_pos = { x = 14030.0, y = 8385.0, z = -275.3046875 },
                },
            },
        },

        ['斯特恩'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '生产区',
                    npc_name = '罗杰',
                    npc_pos = { x = 12184.0, y = 18168.0, z = 775.88958740234 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水' },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水' },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水' },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水' },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水' },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '生产区',
                    npc_name = '装备修理机',
                    npc_pos = { x = 12206.0, y = 18841.0, z = 767.99981689453 },
                },
            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '生产区',
                    npc_name = '杜纳尔',
                    npc_pos = { x = 12601.0, y = 20986.0, z = 865.95098876953 },
                    sell_item = {
                    },
                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '市场区',
                    npc_name = '哈蒙德',
                    npc_pos = { x = 7144.0, y = 12149.0, z = 512.0 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },
                [2] = {
                    active_name = '商业区',
                    npc_name = '贝蒙德',
                    npc_pos = { x = 18969.0, y = 7787.0, z = 1285.3996582031 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },
            },
        },
        ['托特里奇'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '钟表广场',
                    npc_name = '杰因',
                    npc_pos = { x = 11968.0, y = 11157.0, z = 0.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                        ['X-090892'] = { idx = 3.0, money = 30000.0, name = 'X-090892' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '钟表广场',
                    npc_name = '艾玛',
                    npc_pos = { x = 8842.0, y = 13225.0, z = 0.0 },
                },
            },
        },

        ['分裂之地'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '警备哨所',
                    npc_name = '科勒',
                    npc_pos = { x = 13440.0, y = 13235.0, z = 1664.0 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '警备哨所',
                    npc_name = '德利卡',
                    npc_pos = { x = 12444.0, y = 12248.0, z = 1664.0 },
                },
            },
        },
        ['丽泽瀑布'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '漩涡观测站',
                    npc_name = '阿尔迪斯',
                    npc_pos = { x = 11615.0, y = 12089.0, z = 1897.5548095703 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '漩涡观测站',
                    npc_name = '杰拉特',
                    npc_pos = { x = 11955.0, y = 13272.0, z = 1897.5548095703 },
                },
            },
        },
        ['涅贝霍恩'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '涅贝霍恩研究所',
                    npc_name = '克莱恩',
                    npc_pos = { x = -15595.0, y = 14133.0, z = 3342 },
                    sell_item = {
                        ['名人治疗药水'] = { idx = 1.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 2.0, money = 60.0, name = '达人治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '涅贝霍恩研究所',
                    npc_name = '帕连',
                    npc_pos = { x = -17784.0, y = 13596.0, z = 3334.6953125 },
                },
            },
        },
        --------------------------------------------------------------------------------------------

        ['科罗纳港'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '港口北部入口',
                    npc_name = '莫尔亚迪',
                    npc_pos = { x = 7905.0, y = 21157.0, z = 1568.0 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '港口北部入口',
                    npc_name = '克拉多特',
                    npc_pos = { x = 8449.0, y = 18282.0, z = 1568.0 },
                },
            },
        },

        ['贝隆城'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '和谐广场',
                    npc_name = '魔法学家艾丹',
                    npc_pos = { x = 18981.0, y = 14666.0, z = 4911.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水' },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水' },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水' },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水' },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水' },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水' },
                    },
                },
                [2] = {
                    active_name = '商业区',
                    npc_name = '迪卡特',
                    npc_pos = { x = 19900.0, y = 2229.0, z = 3846.0 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水' },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水' },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水' },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水' },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水' },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '商业区',
                    npc_name = '玛诺林',
                    npc_pos = { x = 22714.0, y = 7016.0, z = 4352.9995117188 },
                },
                [2] = {
                    active_name = '和谐广场',
                    npc_name = '文丽',
                    npc_pos = { x = 19503.0, y = 14660.0, z = 4911.0 },
                },
                [3] = {
                    active_name = '和谐广场',
                    npc_name = '卢伊伯斯',
                    scene_map = '近卫队',
                    npc_pos = { x = 4193.0, y = -21160.0, z = 3713.6726074219 },
                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '制作地区',
                    npc_name = '哈蒙德',
                    npc_pos = { x = 4833.0, y = 9474.0, z = 4225.9995117188 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },
                [2] = {
                    active_name = '商业区',
                    npc_name = '贝蒙德',
                    npc_pos = { x = 23742.0, y = 4756.0, z = 4352.9995117188 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },
            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '制作地区',
                    npc_name = '赛纳尔',
                    npc_pos = { x = 7489.0, y = 8657.0, z = 4284.9995117188 },
                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '制作地区',
                    npc_name = '教授莫斯比',
                    npc_pos = { x = 7750.0, y = 7401.0, z = 4339 },
                    check_task = {},
                },
            },
            ['混沌商人'] = {
                [1] = {
                    active_name = '制作地区',
                    npc_name = '商人基诺',
                    npc_pos = { x = 5921, y = 6684, z = 4227 },
                },
            },
        },
        ['巴兰卡山脉'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '守灯村',
                    npc_name = '纳里塔',
                    npc_pos = { x = 14956.0, y = 11143.0, z = 767.99975585938 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '守灯村',
                    npc_name = '布伦温',
                    npc_pos = { x = 15211.0, y = 9240.0, z = 767 },
                },
            },
        },
        ['佩斯纳尔高原'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '佩斯纳尔高原',
                    npc_name = '乎雷索',
                    npc_pos = { x = 14465.0, y = 10096.0, z = 3977.9997558594 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '佩斯纳尔高原',
                    npc_name = '金德尔',
                    npc_pos = { x = 13223.0, y = 9734.0, z = 3974.9997558594 },
                },
            },
        },
        ['拉尼亚村'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '拉尼亚村',
                    npc_name = '赛瑞内',
                    npc_pos = { x = 4282.0, y = 6518.0, z = 336.21298217773 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '拉尼亚村',
                    npc_name = '卡米拉',
                    scene_map = '卡米拉的铁匠铺',
                    npc_pos = { x = -8024.0, y = -33376.0, z = -25.277057647705 },
                },
            },

        },
        ['帕尔纳森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '圣木帕尔纳的殿堂',
                    npc_name = '博伦',
                    npc_pos = { x = 14732.0, y = 15534.0, z = -1024.0 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '圣木帕尔纳的殿堂',
                    npc_name = '赛内特',
                    npc_pos = { x = 15636.0, y = 15353.0, z = -1024.0 },
                },
            },
        },
        ['伯尼尔森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '瓦兰卡尔游侠总部',
                    npc_name = '巡逻队员',
                    npc_pos = { x = 2258.0119628906, y = 12470.526367188, z = 2561.89453125 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '瓦兰卡尔游侠总部',
                    npc_name = '亨泽尔',
                    npc_pos = { x = 3236.0, y = 12103.0, z = 2561.9272460938 },
                },
            },
        },
        --------------------------------------------------------------------------------------------
        -- 休沙尔大陆
        ['冰封之海'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '阴影市场',
                    npc_name = '格里尼思',
                    npc_pos = { x = -9545, y = 13477, z = 509 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '阴影市场',
                    npc_name = '玛尔仑',
                    npc_pos = { x = -7925, y = 16221, z = 883 },
                },
            },
        },
        ['利根斯村'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '利根斯村',
                    npc_name = '卡尔林',
                    npc_pos = { x = 5200, y = 3227, z = 1029 },--false
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '利根斯村',
                    npc_name = '纽维尔',
                    npc_pos = { x = 7489, y = 4833, z = 1218 },--false
                },
            },
        },
        ['凝时之湖'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '湖水钓鱼场',
                    npc_name    = '布兰德尔',
                    npc_pos     = { x = 19744, y = 6690, z = 386 },--false
                    sell_item   = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '湖水钓鱼场',
                    npc_name = '扎尔戈',
                    npc_pos  = { x = 18925, y = 6581, z = 386 },--false
                },
            },
        },
        ['风刃之丘'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '风刃之丘哨所',
                    npc_name = '杰纳',
                    npc_pos = { x = 17353, y = 5461, z = 3927 },
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '风刃之丘哨所',
                    npc_name = '巴腾',
                    npc_pos = { x = 17353, y = 5461, z = 3927 },
                },
            },
        },
        ['霜狱高原'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '狼团阵地',
                    npc_name = '埃米尔',
                    npc_pos = { x = 11075, y = 22072, z = 5125 },--false
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '狼团阵地',
                    npc_name = '卡伊斯',
                    npc_pos = { x = 10381, y = 20332, z = 5125 },--false
                },
            },
        },
        ['冰蝶峭壁'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '灰狼团阵地',
                    npc_name = '莫根',
                    npc_pos = { x = 15279, y = 9479, z = 508 },--false
                    sell_item = {
                        ['达人治疗药水'] = { idx = 1.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 2.0, money = 100.0, name = '强化治疗药水' },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '灰狼团阵地',
                    npc_name = '德尔云',
                    npc_pos = { x = 14596, y = 10794, z = 513 },--false
                },
            },
        },
        --------------------------------------------------------------------------------------------
        -- 洛恒戴尔
        ['银波湖'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '码头',
                    npc_name = '里希特',
                    npc_pos = { x = 16230, y = 16572, z = 1343 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '码头',
                    npc_name = '菲利斯',
                    npc_pos = { x = 16098, y = 16653, z = 1343 },
                },
            },
        },

        ['洛亚伦'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '黎明之塔',
                    npc_name = '埃拉利',
                    npc_pos = { x = 8508, y = 10798, z = 528 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '黎明之塔',
                    npc_name    = '哈尔连',
                    npc_pos     = { x = 8327, y = 11076, z = 529 },--false
                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '黎明之塔',
                    npc_name = '贝蒙德',
                    npc_pos = { x = 3052, y = 10658, z = 125 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },

            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '匠人之森',
                    npc_name = '内诺尔',
                    npc_pos = { x = 8266, y = 730, z = 8 },
                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '匠人之森',
                    npc_name = '贝利佩',
                    npc_pos = { x = 8650, y = 1044, z = 8 },
                    check_task = {},
                },
            },
        },

        ['破败的泽纳尔'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '月光塔之丘',
                    npc_name = '埃拉尔',
                    npc_pos = { x = 12670, y = 12717, z = 514 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '月光塔之丘',
                    npc_name = '里尔佩',
                    npc_pos = { x = 13922, y = 11709, z = 767 },
                },
            },
        },

        ['风弥之丘'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '风弥之丘',
                    npc_name = '拉利佩',
                    npc_pos = { x = 9961, y = 4925, z = 1020 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '风弥之丘',
                    npc_name = '荷马',
                    npc_pos = { x = 9560, y = 1136, z = 1174 },
                },
            },
        },

        ['琉璃莲花池'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '水声村',
                    npc_name = '塔姆普',
                    npc_pos = { x = 7729, y = 11631, z = 402 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '水声村',
                    npc_name = '巴雅',
                    npc_pos = { x = 8941, y = 12204, z = 355 },
                },
            },
        },

        ['埃尔乔文之荫'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '阴影大地',
                    npc_name = '珀杉',
                    npc_pos = { x = 5919, y = 3068, z = 2157 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '阴影大地',
                    npc_name = '艾贝尔',
                    npc_pos = { x = 5316, y = 3549, z = 2161 },
                },
            },
        },

        --------------------------------------------------------------------------------------------
        -- 永恩
        ['起始之地'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '潮湿的采矿地',
                    npc_name = '美德勒',
                    npc_pos = { x = -9212, y = 11628, z = -499 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '潮湿的采矿地',
                    npc_name = '利摩尔',
                    npc_pos = { x = -9675, y = 11650, z = -490 },
                },
            },
        },

        ['伟大之城'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '传奇铁匠铺',
                    npc_name = '多毗尔',
                    npc_pos = { x = 12541, y = 14374, z = 4336 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '传奇铁匠铺',
                    npc_name    = '理帕勒',
                    npc_pos     = { x = 11901, y = 17771, z = 4297 },--false

                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '传奇铁匠铺',
                    npc_name = '贝蒙德',
                    scene_map = '交易中心',
                    npc_pos = { x = 18410, y = 29183, z = 1916 },
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },

            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '传奇铁匠铺',
                    npc_name = '戴萨尔',
                    npc_pos = { x = 10555, y = 18316, z = 4452 },
                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '传奇铁匠铺',
                    npc_name = '厄维尔',
                    npc_pos = {x = 11567, y = 17033, z = 4304 },
                    check_task = {},
                },
            },
        },

        ['未竟庭院'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '伟大的水路管理所',
                    npc_name = '里卢尔',
                    npc_pos = { x = -14887, y = 2793, z = 1439 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '伟大的水路管理所',
                    npc_name = '帕佩勒',
                    npc_pos = { x = -15219, y = 2801, z = 1439 },
                },
            },
        },

        ['黑砧工坊'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '临时避难所',
                    npc_name = '珀萨尔',
                    ['npc_pos'] = { x = 16949, y = 17693, z = -510 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '临时避难所',
                    npc_name = '里夏洛',
                    npc_pos = { x = 17382, y = 18054, z = -513 },
                },
            },
        },

        ['铁锤工坊'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '铁锤坑道入口',
                    npc_name = '希普勒',
                    ['npc_pos'] = { x = -13987, y = -27634, z = 3939 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '铁锤坑道入口',
                    npc_name = '罗姆勒',
                    npc_pos = { x = -13987, y = -27634, z = 3939 },
                },
            },
        },

        ['应许之地'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '遗忘的老路',
                    npc_name    = '劳勒',
                    npc_pos     = { x = 21557, y = 11714, z = 1278 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '遗忘的老路',
                    npc_name    = '杰拉尔',
                    npc_pos     = { x = 22223, y = 11544, z = 1277 },--false
                },
            },
        },

        --------------------------------------------------------------------------------------------
        -- 费顿
        ['无名峡谷'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '塞克利亚营地',
                    npc_name    = '埃伊奇',
                    npc_pos     = { x = -5250, y = 11063, z = 16397 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '塞克利亚营地',
                    npc_name    = '麦克斯',
                    npc_pos     = { x = -5588, y = 11311, z = 16397 },--false
                },
            },
        },

        ['卡拉贾村'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '蛇之峡谷',
                    npc_name    = '德伊吉亚',
                    npc_pos     = { x = -2394, y = -6247, z = 667 },--false

                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '古老的广场',
                    npc_name    = '梅丽娜',
                    npc_pos     = { x = 5574, y = 690, z = 1190 },--false


                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '古老的广场',
                    npc_name = '吉内亚',
                    npc_pos = { x = 3295, y = 1391, z = 940 },--false
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },

            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '古老的广场',
                    npc_name    = '希斯鲁',
                    npc_pos     = { x = 6537, y = 1041, z = 1212 },--false

                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '古老的广场',
                    npc_name    = '蒂亚纳',
                    npc_pos     = { x = 7079, y = -56, z = 1193 },--false
                    check_task  = {},
                },
            },
            ['邮件'] = {
                [1] = {
                    active_name = '古老的广场',
                    npc_name    = '邮递员塞罗',
                    npc_pos     = { x = 4032, y = 706, z = 938 },--false
                    check_task  = {},
                },
            },
        },

        ['哀叹沼泽'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '半魔人定居地',
                    npc_name    = '娜塔莎',
                    npc_pos     = { x = 17929, y = 3143, z = 2822 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '半魔人定居地',
                    npc_name    = '米娅',
                    npc_pos     = { x = 17929, y = 3143, z = 2822 },--false
                },
            },
        },

        ['阴沉峭壁'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '圣疗院广场',
                    npc_name    = '阿尔登',
                    npc_pos     = { x = 14210, y = 7631, z = 1027 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '圣疗院广场',
                    npc_name    = '杰特',
                    npc_pos     = { x = 13830, y = 7629, z = 1027 },--false
                },
            },
        },

        ['红月印迹'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '受伤的大地',
                    npc_name    = '巴勃罗',
                    ['npc_pos'] = { x = 10764, y = -1416, z = 258 },--false

                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '受伤的大地',
                    npc_name    = '米乌茨',
                    npc_pos     = { x = 10899, y = -775, z = 255 },--false
                },
            },
        },

        --------------------------------------------------------------------------------------------
        -- 帕普妮卡
        ['妮亚村'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '常青之屋',
                    npc_name    = '里里卡尔',
                    npc_pos     = { x = -8622, y = -6578, z = 713 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },
            ['维修工'] = {
                [1] = {
                    active_name = '常青之屋',
                    npc_name    = '埃里埃',
                    npc_pos     = { x = -9162, y = -6025, z = 718 },--false
                },
            },
            ['金币商店'] = {
                [1] = {
                    active_name = '常青之屋',
                    npc_name    = '杰斯',
                    npc_pos     = { x = -2438, y = 3562, z = 738 },--false
                    sell_item = {
                        ['丰厚的金币袋子'] = { idx = 1.0, money = 80.0, name = '丰厚的金币袋子' },
                        ['小金库'] = { idx = 2.0, money = 200.0, name = '小金库' },
                        ['巨大的金币箱子'] = { idx = 3.0, money = 500.0, name = '巨大的金币箱子' },
                    },
                },

            },
            ['装备精炼'] = {
                [1] = {
                    active_name = '常青之屋',
                    npc_name    = '塞弗尔',
                    npc_pos     = { x = -2227, y = 41, z = 1084 },--false
                },
            },
            ['能力石加工'] = {
                [1] = {
                    active_name = '常青之屋',
                    npc_name    = '格洛娜',
                    npc_pos     = { x = -4701, y = 20, z = 1035 },--false
                    check_task  = {},
                },
            },
        },
        ['蒂卡蒂卡聚落'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '民兵队居所',
                    npc_name    = '塔伊塔纳',
                    npc_pos     = { x = 3557, y = 15839, z = 1023 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0, money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '民兵队居所',
                    npc_name    = '比克斯',
                    npc_pos     = { x = 2966, y = 15947, z = 1023 },--false
                },
            },
        },
        ['悠浅海路'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '灰色火山地带',
                    npc_name    = '洛鄂尔',
                    npc_pos     = { x = 17432, y = 9380, z = 638 },--false
                    finish_task = { need_task = '缓慢沉着地',need_task_map = -1 },
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0,money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '灰色火山地带',
                    npc_name    = '皮卡',
                    npc_pos     = { x = 17848, y = 9437, z = 638 },--false
                },
            },
        },
        ['星沙海滩'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '间歇泉地带',
                    npc_name    = '锡凯亚',
                    npc_pos     = { x = 26780, y = 8074, z = 1759 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0,money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '间歇泉地带',
                    npc_name    = '埃拉',
                    npc_pos     = { x = 27337, y = 7695, z = 1763 },--false
                },
            },
        },
        ['秘密森林'] = {
            ['药水商人'] = {
                [1] = {
                    active_name = '民兵队驻地',
                    npc_name    = '赫里萨',
                    npc_pos     = { x = 2749, y = 3419, z = 1023 },--false
                    sell_item = {
                        ['高级治疗药水'] = { idx = 1.0, money = 20.0, name = '高级治疗药水' },
                        ['名人治疗药水'] = { idx = 2.0, money = 35.0, name = '名人治疗药水' },
                        ['达人治疗药水'] = { idx = 3.0, money = 60.0, name = '达人治疗药水' },
                        ['强化治疗药水'] = { idx = 4.0, money = 100.0, name = '强化治疗药水' },
                        ['神圣治愈药水'] = { idx = 5.0, money = 220.0, name = '神圣治愈药水',power = 500 },
                        ['守护治愈药水'] = { idx = 6.0, money = 260.0, name = '守护治愈药水',power = 700 },
                        ['净化治愈药水'] = { idx = 7.0, money = 460.0, name = '净化治愈药水',power = 900 },
                        ['祝福治愈药水'] = { idx = 8.0, money = 620.0, name = '祝福治愈药水',power = 1000 },
                        ['星光治疗药水'] = { idx = 9.0, money = 1500.0, name = '星光治疗药水',power = 1200 },
                        ['神秘治疗药水'] = { idx = 10.0,money = 2250.0, name = '神秘治疗药水',power = 1400 },
                    },
                },
            },

            ['维修工'] = {
                [1] = {
                    active_name = '民兵队驻地',
                    npc_name    = '海姆梅尔',
                    npc_pos     = { x = 3545, y = 3722, z = 1023 },--false
                },
            },
        },
        --------------------------------------------------------------------------------------------
        -- 小岛
        ['海上乐园佩托'] = {
            ['物品交换'] = {
                [1] = {
                    npc_name = '宝藏猎手伊戈尔',
                    npc_pos = { x = 29571, y = 7196, z = 165 },
                    sell_item = {
                        ['共鸣之歌'] = { money_id = 10,can_buy = 1,money = 16500 },
                    },
                },
            },
        },
    },

}

local this = shop_res
-------------------------------------------------------------------------------------
-- 返回对象
return shop_res

-------------------------------------------------------------------------------------